---
type: ParameterTypeId
namespace: Autodesk.Revit.DB
version: 2024
members: 3543
tags: [revit-api, class]
---

# ParameterTypeId

`Autodesk.Revit.DB.ParameterTypeId` · Revit 2024 · 3543 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | ActualMaxRidgeHeightParam | — | `public static ForgeTypeId ActualMaxRidgeHeightParam { get ; }` |
| Property | AlignmentStationLabelDistance | — | `public static ForgeTypeId AlignmentStationLabelDistance { get ; }` |
| Property | AlignmentStationLabelIncludeStation | — | `public static ForgeTypeId AlignmentStationLabelIncludeStation { get ; }` |
| Property | AlignmentStationLabelIndStation | — | `public static ForgeTypeId AlignmentStationLabelIndStation { get ; }` |
| Property | AlignmentStationLabelSetEndStation | — | `public static ForgeTypeId AlignmentStationLabelSetEndStation { get ; }` |
| Property | AlignmentStationLabelSetInterval | — | `public static ForgeTypeId AlignmentStationLabelSetInterval { get ; }` |
| Property | AlignmentStationLabelSetOffset | — | `public static ForgeTypeId AlignmentStationLabelSetOffset { get ; }` |
| Property | AlignmentStationLabelSetStartStation | — | `public static ForgeTypeId AlignmentStationLabelSetStartStation { get ; }` |
| Property | AlignmentStationLabelStationValue | — | `public static ForgeTypeId AlignmentStationLabelStationValue { get ; }` |
| Property | AlignmentStationPrefix | — | `public static ForgeTypeId AlignmentStationPrefix { get ; }` |
| Property | AlignmentStationSuffix | — | `public static ForgeTypeId AlignmentStationSuffix { get ; }` |
| Property | AllGridRotationForDivisionRule | — | `public static ForgeTypeId AllGridRotationForDivisionRule { get ; }` |
| Property | AllModelDescription | — | `public static ForgeTypeId AllModelDescription { get ; }` |
| Property | AllModelImage | — | `public static ForgeTypeId AllModelImage { get ; }` |
| Property | AllModelInstanceComments | — | `public static ForgeTypeId AllModelInstanceComments { get ; }` |
| Property | AllModelManufacturer | — | `public static ForgeTypeId AllModelManufacturer { get ; }` |
| Property | AllModelModel | — | `public static ForgeTypeId AllModelModel { get ; }` |
| Property | AllModelTypeComments | — | `public static ForgeTypeId AllModelTypeComments { get ; }` |
| Property | AllModelTypeImage | — | `public static ForgeTypeId AllModelTypeImage { get ; }` |
| Property | AllModelUrl | — | `public static ForgeTypeId AllModelUrl { get ; }` |
| Property | AllowAutoEmbed | — | `public static ForgeTypeId AllowAutoEmbed { get ; }` |
| Property | AlternateUnits | — | `public static ForgeTypeId AlternateUnits { get ; }` |
| Property | AlternateUnitsPrefix | — | `public static ForgeTypeId AlternateUnitsPrefix { get ; }` |
| Property | AlternateUnitsSuffix | — | `public static ForgeTypeId AlternateUnitsSuffix { get ; }` |
| Property | AlwaysZeroLength | — | `public static ForgeTypeId AlwaysZeroLength { get ; }` |
| Property | AnalyticConstruction | — | `public static ForgeTypeId AnalyticConstruction { get ; }` |
| Property | AnalyticConstructionGbxmlTypeid | — | `public static ForgeTypeId AnalyticConstructionGbxmlTypeid { get ; }` |
| Property | AnalyticConstructionLookupTable | — | `public static ForgeTypeId AnalyticConstructionLookupTable { get ; }` |
| Property | AnalyticalAbsorptance | — | `public static ForgeTypeId AnalyticalAbsorptance { get ; }` |
| Property | AnalyticalAdjacentSpace | — | `public static ForgeTypeId AnalyticalAdjacentSpace { get ; }` |
| Property | AnalyticalDefineThermalPropertiesBy | — | `public static ForgeTypeId AnalyticalDefineThermalPropertiesBy { get ; }` |
| Property | AnalyticalElementHasAssociation | — | `public static ForgeTypeId AnalyticalElementHasAssociation { get ; }` |
| Property | AnalyticalElementPhysicalAsset | — | `public static ForgeTypeId AnalyticalElementPhysicalAsset { get ; }` |
| Property | AnalyticalElementStructuralRole | — | `public static ForgeTypeId AnalyticalElementStructuralRole { get ; }` |
| Property | AnalyticalGeometryIsValid | — | `public static ForgeTypeId AnalyticalGeometryIsValid { get ; }` |
| Property | AnalyticalHeatTransferCoefficient | — | `public static ForgeTypeId AnalyticalHeatTransferCoefficient { get ; }` |
| Property | AnalyticalLinkReleaseRotationX | — | `public static ForgeTypeId AnalyticalLinkReleaseRotationX { get ; }` |
| Property | AnalyticalLinkReleaseRotationY | — | `public static ForgeTypeId AnalyticalLinkReleaseRotationY { get ; }` |
| Property | AnalyticalLinkReleaseRotationZ | — | `public static ForgeTypeId AnalyticalLinkReleaseRotationZ { get ; }` |
| Property | AnalyticalLinkReleaseTranslationX | — | `public static ForgeTypeId AnalyticalLinkReleaseTranslationX { get ; }` |
| Property | AnalyticalLinkReleaseTranslationY | — | `public static ForgeTypeId AnalyticalLinkReleaseTranslationY { get ; }` |
| Property | AnalyticalLinkReleaseTranslationZ | — | `public static ForgeTypeId AnalyticalLinkReleaseTranslationZ { get ; }` |
| Property | AnalyticalMemberForceEndAllNonZero | — | `public static ForgeTypeId AnalyticalMemberForceEndAllNonZero { get ; }` |
| Property | AnalyticalMemberForceEndFx | — | `public static ForgeTypeId AnalyticalMemberForceEndFx { get ; }` |
| Property | AnalyticalMemberForceEndFy | — | `public static ForgeTypeId AnalyticalMemberForceEndFy { get ; }` |
| Property | AnalyticalMemberForceEndFz | — | `public static ForgeTypeId AnalyticalMemberForceEndFz { get ; }` |
| Property | AnalyticalMemberForceEndMx | — | `public static ForgeTypeId AnalyticalMemberForceEndMx { get ; }` |
| Property | AnalyticalMemberForceEndMy | — | `public static ForgeTypeId AnalyticalMemberForceEndMy { get ; }` |
| Property | AnalyticalMemberForceEndMz | — | `public static ForgeTypeId AnalyticalMemberForceEndMz { get ; }` |
| Property | AnalyticalMemberForceStartAllNonZero | — | `public static ForgeTypeId AnalyticalMemberForceStartAllNonZero { get ; }` |
| Property | AnalyticalMemberForceStartFx | — | `public static ForgeTypeId AnalyticalMemberForceStartFx { get ; }` |
| Property | AnalyticalMemberForceStartFy | — | `public static ForgeTypeId AnalyticalMemberForceStartFy { get ; }` |
| Property | AnalyticalMemberForceStartFz | — | `public static ForgeTypeId AnalyticalMemberForceStartFz { get ; }` |
| Property | AnalyticalMemberForceStartMx | — | `public static ForgeTypeId AnalyticalMemberForceStartMx { get ; }` |
| Property | AnalyticalMemberForceStartMy | — | `public static ForgeTypeId AnalyticalMemberForceStartMy { get ; }` |
| Property | AnalyticalMemberForceStartMz | — | `public static ForgeTypeId AnalyticalMemberForceStartMz { get ; }` |
| Property | AnalyticalMemberRotation | — | `public static ForgeTypeId AnalyticalMemberRotation { get ; }` |
| Property | AnalyticalMemberSectionType | — | `public static ForgeTypeId AnalyticalMemberSectionType { get ; }` |
| Property | AnalyticalModelArea | — | `public static ForgeTypeId AnalyticalModelArea { get ; }` |
| Property | AnalyticalModelBaseAlignmentMethod | — | `public static ForgeTypeId AnalyticalModelBaseAlignmentMethod { get ; }` |
| Property | AnalyticalModelBaseExtensionMethod | — | `public static ForgeTypeId AnalyticalModelBaseExtensionMethod { get ; }` |
| Property | AnalyticalModelBaseYProjection | — | `public static ForgeTypeId AnalyticalModelBaseYProjection { get ; }` |
| Property | AnalyticalModelBaseZProjection | — | `public static ForgeTypeId AnalyticalModelBaseZProjection { get ; }` |
| Property | AnalyticalModelCodeChecking | — | `public static ForgeTypeId AnalyticalModelCodeChecking { get ; }` |
| Property | AnalyticalModelColumnBaseExtension | — | `public static ForgeTypeId AnalyticalModelColumnBaseExtension { get ; }` |
| Property | AnalyticalModelColumnTopExtension | — | `public static ForgeTypeId AnalyticalModelColumnTopExtension { get ; }` |
| Property | AnalyticalModelEndAlignmentMethod | — | `public static ForgeTypeId AnalyticalModelEndAlignmentMethod { get ; }` |
| Property | AnalyticalModelEndProjectionOrthogonal | — | `public static ForgeTypeId AnalyticalModelEndProjectionOrthogonal { get ; }` |
| Property | AnalyticalModelEndYProjection | — | `public static ForgeTypeId AnalyticalModelEndYProjection { get ; }` |
| Property | AnalyticalModelEndZProjection | — | `public static ForgeTypeId AnalyticalModelEndZProjection { get ; }` |
| Property | AnalyticalModelFloorAlignmentMethod | — | `public static ForgeTypeId AnalyticalModelFloorAlignmentMethod { get ; }` |
| Property | AnalyticalModelFloorProjection | — | `public static ForgeTypeId AnalyticalModelFloorProjection { get ; }` |
| Property | AnalyticalModelFoundationsMark | — | `public static ForgeTypeId AnalyticalModelFoundationsMark { get ; }` |
| Property | AnalyticalModelLength | — | `public static ForgeTypeId AnalyticalModelLength { get ; }` |
| Property | AnalyticalModelManuallyAdjusted | — | `public static ForgeTypeId AnalyticalModelManuallyAdjusted { get ; }` |
| Property | AnalyticalModelNodesMark | — | `public static ForgeTypeId AnalyticalModelNodesMark { get ; }` |
| Property | AnalyticalModelPerimeter | — | `public static ForgeTypeId AnalyticalModelPerimeter { get ; }` |
| Property | AnalyticalModelPhysicalType | — | `public static ForgeTypeId AnalyticalModelPhysicalType { get ; }` |
| Property | AnalyticalModelRotation | — | `public static ForgeTypeId AnalyticalModelRotation { get ; }` |
| Property | AnalyticalModelSketchAlignmentMethod | — | `public static ForgeTypeId AnalyticalModelSketchAlignmentMethod { get ; }` |
| Property | AnalyticalModelSketchProjection | — | `public static ForgeTypeId AnalyticalModelSketchProjection { get ; }` |
| Property | AnalyticalModelStartAlignmentMethod | — | `public static ForgeTypeId AnalyticalModelStartAlignmentMethod { get ; }` |
| Property | AnalyticalModelStartProjectionOrthogonal | — | `public static ForgeTypeId AnalyticalModelStartProjectionOrthogonal { get ; }` |
| Property | AnalyticalModelStartYProjection | — | `public static ForgeTypeId AnalyticalModelStartYProjection { get ; }` |
| Property | AnalyticalModelStartZProjection | — | `public static ForgeTypeId AnalyticalModelStartZProjection { get ; }` |
| Property | AnalyticalModelStickElementsMark | — | `public static ForgeTypeId AnalyticalModelStickElementsMark { get ; }` |
| Property | AnalyticalModelSurfaceElementsMark | — | `public static ForgeTypeId AnalyticalModelSurfaceElementsMark { get ; }` |
| Property | AnalyticalModelTopAlignmentMethod | — | `public static ForgeTypeId AnalyticalModelTopAlignmentMethod { get ; }` |
| Property | AnalyticalModelTopExtensionMethod | — | `public static ForgeTypeId AnalyticalModelTopExtensionMethod { get ; }` |
| Property | AnalyticalModelTopYProjection | — | `public static ForgeTypeId AnalyticalModelTopYProjection { get ; }` |
| Property | AnalyticalModelTopZProjection | — | `public static ForgeTypeId AnalyticalModelTopZProjection { get ; }` |
| Property | AnalyticalModelWallAlignmentMethod | — | `public static ForgeTypeId AnalyticalModelWallAlignmentMethod { get ; }` |
| Property | AnalyticalModelWallBaseProjection | — | `public static ForgeTypeId AnalyticalModelWallBaseProjection { get ; }` |
| Property | AnalyticalModelWallProjection | — | `public static ForgeTypeId AnalyticalModelWallProjection { get ; }` |
| Property | AnalyticalModelWallTopProjection | — | `public static ForgeTypeId AnalyticalModelWallTopProjection { get ; }` |
| Property | AnalyticalNodeConnectionStatus | — | `public static ForgeTypeId AnalyticalNodeConnectionStatus { get ; }` |
| Property | AnalyticalPanelThickness | — | `public static ForgeTypeId AnalyticalPanelThickness { get ; }` |
| Property | AnalyticalRoughness | — | `public static ForgeTypeId AnalyticalRoughness { get ; }` |
| Property | AnalyticalSolarHeatGainCoefficient | — | `public static ForgeTypeId AnalyticalSolarHeatGainCoefficient { get ; }` |
| Property | AnalyticalSpace | — | `public static ForgeTypeId AnalyticalSpace { get ; }` |
| Property | AnalyticalSurface | — | `public static ForgeTypeId AnalyticalSurface { get ; }` |
| Property | AnalyticalThermalMass | — | `public static ForgeTypeId AnalyticalThermalMass { get ; }` |
| Property | AnalyticalThermalResistance | — | `public static ForgeTypeId AnalyticalThermalResistance { get ; }` |
| Property | AnalyticalVisualLightTransmittance | — | `public static ForgeTypeId AnalyticalVisualLightTransmittance { get ; }` |
| Property | AnalyticalZone | — | `public static ForgeTypeId AnalyticalZone { get ; }` |
| Property | AnalyticalZoneName | — | `public static ForgeTypeId AnalyticalZoneName { get ; }` |
| Property | AnyPatternIdParam | — | `public static ForgeTypeId AnyPatternIdParam { get ; }` |
| Property | AnyPatternIdParamNoNo | — | `public static ForgeTypeId AnyPatternIdParamNoNo { get ; }` |
| Property | ArcCenterMark | — | `public static ForgeTypeId ArcCenterMark { get ; }` |
| Property | ArcLeaderParam | — | `public static ForgeTypeId ArcLeaderParam { get ; }` |
| Property | ArcWallCntrMrkVisible | — | `public static ForgeTypeId ArcWallCntrMrkVisible { get ; }` |
| Property | AreaSchemeId | — | `public static ForgeTypeId AreaSchemeId { get ; }` |
| Property | AreaSchemeName | — | `public static ForgeTypeId AreaSchemeName { get ; }` |
| Property | AreaType | — | `public static ForgeTypeId AreaType { get ; }` |
| Property | AreaTypeText | — | `public static ForgeTypeId AreaTypeText { get ; }` |
| Property | ArrowCentered | — | `public static ForgeTypeId ArrowCentered { get ; }` |
| Property | ArrowClosed | — | `public static ForgeTypeId ArrowClosed { get ; }` |
| Property | ArrowFilled | — | `public static ForgeTypeId ArrowFilled { get ; }` |
| Property | ArrowSize | — | `public static ForgeTypeId ArrowSize { get ; }` |
| Property | ArrowType | — | `public static ForgeTypeId ArrowType { get ; }` |
| Property | ArrowheadEndAtRiser | — | `public static ForgeTypeId ArrowheadEndAtRiser { get ; }` |
| Property | ArrowheadType | — | `public static ForgeTypeId ArrowheadType { get ; }` |
| Property | AssemblyName | — | `public static ForgeTypeId AssemblyName { get ; }` |
| Property | AssemblyNamingCategory | — | `public static ForgeTypeId AssemblyNamingCategory { get ; }` |
| Property | AssemblyPrecastFreeze | — | `public static ForgeTypeId AssemblyPrecastFreeze { get ; }` |
| Property | AssignTemplateOnViewCreation | — | `public static ForgeTypeId AssignTemplateOnViewCreation { get ; }` |
| Property | AssociatedLevel | — | `public static ForgeTypeId AssociatedLevel { get ; }` |
| Property | AssociatedLevelOffset | — | `public static ForgeTypeId AssociatedLevelOffset { get ; }` |
| Property | AutoJoinCondition | — | `public static ForgeTypeId AutoJoinCondition { get ; }` |
| Property | AutoJoinConditionWall | — | `public static ForgeTypeId AutoJoinConditionWall { get ; }` |
| Property | AutoMullionBorder1Grid1 | — | `public static ForgeTypeId AutoMullionBorder1Grid1 { get ; }` |
| Property | AutoMullionBorder1Grid2 | — | `public static ForgeTypeId AutoMullionBorder1Grid2 { get ; }` |
| Property | AutoMullionBorder1Horiz | — | `public static ForgeTypeId AutoMullionBorder1Horiz { get ; }` |
| Property | AutoMullionBorder1Vert | — | `public static ForgeTypeId AutoMullionBorder1Vert { get ; }` |
| Property | AutoMullionBorder2Grid1 | — | `public static ForgeTypeId AutoMullionBorder2Grid1 { get ; }` |
| Property | AutoMullionBorder2Grid2 | — | `public static ForgeTypeId AutoMullionBorder2Grid2 { get ; }` |
| Property | AutoMullionBorder2Horiz | — | `public static ForgeTypeId AutoMullionBorder2Horiz { get ; }` |
| Property | AutoMullionBorder2Vert | — | `public static ForgeTypeId AutoMullionBorder2Vert { get ; }` |
| Property | AutoMullionInteriorGrid1 | — | `public static ForgeTypeId AutoMullionInteriorGrid1 { get ; }` |
| Property | AutoMullionInteriorGrid2 | — | `public static ForgeTypeId AutoMullionInteriorGrid2 { get ; }` |
| Property | AutoMullionInteriorHoriz | — | `public static ForgeTypeId AutoMullionInteriorHoriz { get ; }` |
| Property | AutoMullionInteriorVert | — | `public static ForgeTypeId AutoMullionInteriorVert { get ; }` |
| Property | AutoPanel | — | `public static ForgeTypeId AutoPanel { get ; }` |
| Property | AutoPanelWall | — | `public static ForgeTypeId AutoPanelWall { get ; }` |
| Property | Azimuth | — | `public static ForgeTypeId Azimuth { get ; }` |
| Property | BackgroundDraftPatternIdParam | — | `public static ForgeTypeId BackgroundDraftPatternIdParam { get ; }` |
| Property | BackgroundPatternColorParam | — | `public static ForgeTypeId BackgroundPatternColorParam { get ; }` |
| Property | BaselineDimOffset | — | `public static ForgeTypeId BaselineDimOffset { get ; }` |
| Property | BasepointAngletonParam | — | `public static ForgeTypeId BasepointAngletonParam { get ; }` |
| Property | BasepointEastwestParam | — | `public static ForgeTypeId BasepointEastwestParam { get ; }` |
| Property | BasepointElevationParam | — | `public static ForgeTypeId BasepointElevationParam { get ; }` |
| Property | BasepointLatitudeParam | — | `public static ForgeTypeId BasepointLatitudeParam { get ; }` |
| Property | BasepointLongitudeParam | — | `public static ForgeTypeId BasepointLongitudeParam { get ; }` |
| Property | BasepointNorthsouthParam | — | `public static ForgeTypeId BasepointNorthsouthParam { get ; }` |
| Property | BeamHJustification | — | `public static ForgeTypeId BeamHJustification { get ; }` |
| Property | BeamSystem3dParam | — | `public static ForgeTypeId BeamSystem3dParam { get ; }` |
| Property | BeamSystemTagInstParamAngle | — | `public static ForgeTypeId BeamSystemTagInstParamAngle { get ; }` |
| Property | BeamSystemTagParamLeft | — | `public static ForgeTypeId BeamSystemTagParamLeft { get ; }` |
| Property | BeamSystemTagParamRight | — | `public static ForgeTypeId BeamSystemTagParamRight { get ; }` |
| Property | BeamVJustification | — | `public static ForgeTypeId BeamVJustification { get ; }` |
| Property | BeamVJustificationOtherValue | — | `public static ForgeTypeId BeamVJustificationOtherValue { get ; }` |
| Property | BendingDetailAngularDimensionTextPosition | — | `public static ForgeTypeId BendingDetailAngularDimensionTextPosition { get ; }` |
| Property | BendingDetailDetailLevel | — | `public static ForgeTypeId BendingDetailDetailLevel { get ; }` |
| Property | BendingDetailRepesentationFor3dBars | — | `public static ForgeTypeId BendingDetailRepesentationFor3dBars { get ; }` |
| Property | BendingDetailSegmenetRepesentation | — | `public static ForgeTypeId BendingDetailSegmenetRepesentation { get ; }` |
| Property | BendingDetailSegmentLengthDimensionTextPosition | — | `public static ForgeTypeId BendingDetailSegmentLengthDimensionTextPosition { get ; }` |
| Property | BendingDetailTypeAngularDimensionOffset | — | `public static ForgeTypeId BendingDetailTypeAngularDimensionOffset { get ; }` |
| Property | BendingDetailTypeAngularDimensionTypeId | — | `public static ForgeTypeId BendingDetailTypeAngularDimensionTypeId { get ; }` |
| Property | BendingDetailTypeAngularDimensionsEnabled | — | `public static ForgeTypeId BendingDetailTypeAngularDimensionsEnabled { get ; }` |
| Property | BendingDetailTypeAngularDimensionsForHooksEnabled | — | `public static ForgeTypeId BendingDetailTypeAngularDimensionsForHooksEnabled { get ; }` |
| Property | BendingDetailTypeAngularDimensionsMeasurement | — | `public static ForgeTypeId BendingDetailTypeAngularDimensionsMeasurement { get ; }` |
| Property | BendingDetailTypeBendDiameterDimensionsEnabled | — | `public static ForgeTypeId BendingDetailTypeBendDiameterDimensionsEnabled { get ; }` |
| Property | BendingDetailTypeBendDiameterDimensionsForHooksEnabled | — | `public static ForgeTypeId BendingDetailTypeBendDiameterDimensionsForHooksEnabled { get ; }` |
| Property | BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled | — | `public static ForgeTypeId BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled { get ; }` |
| Property | BendingDetailTypeDiameterDimensionTypeId | — | `public static ForgeTypeId BendingDetailTypeDiameterDimensionTypeId { get ; }` |
| Property | BendingDetailTypeOrthogonalAndOverallDimesionsEnabled | — | `public static ForgeTypeId BendingDetailTypeOrthogonalAndOverallDimesionsEnabled { get ; }` |
| Property | BendingDetailTypeRadialDimensionTypeId | — | `public static ForgeTypeId BendingDetailTypeRadialDimensionTypeId { get ; }` |
| Property | BendingDetailTypeSegmentLengthDimensionTypeId | — | `public static ForgeTypeId BendingDetailTypeSegmentLengthDimensionTypeId { get ; }` |
| Property | BendingDetailTypeSegmentLengthDimensionsEnabled | — | `public static ForgeTypeId BendingDetailTypeSegmentLengthDimensionsEnabled { get ; }` |
| Property | BendingDetailTypeSegmentLengthDimensionsForHooksEnabled | — | `public static ForgeTypeId BendingDetailTypeSegmentLengthDimensionsForHooksEnabled { get ; }` |
| Property | BendingDetailTypeSegmentLengthDimensionsOffset | — | `public static ForgeTypeId BendingDetailTypeSegmentLengthDimensionsOffset { get ; }` |
| Property | BendingDetailTypeSegmentLengthsDisplayOption | — | `public static ForgeTypeId BendingDetailTypeSegmentLengthsDisplayOption { get ; }` |
| Property | BendingDetailTypeSegmentLengthsForArcsDisplayOption | — | `public static ForgeTypeId BendingDetailTypeSegmentLengthsForArcsDisplayOption { get ; }` |
| Property | BendingDetailTypeShowAngularDimensionsFor | — | `public static ForgeTypeId BendingDetailTypeShowAngularDimensionsFor { get ; }` |
| Property | BendingDetailTypeShowBarBendingUsing | — | `public static ForgeTypeId BendingDetailTypeShowBarBendingUsing { get ; }` |
| Property | BendingDetailVaryingRebarDimension | — | `public static ForgeTypeId BendingDetailVaryingRebarDimension { get ; }` |
| Property | BentFabricParamBendDirection | — | `public static ForgeTypeId BentFabricParamBendDirection { get ; }` |
| Property | BentFabricParamLongitudinalCutLength | — | `public static ForgeTypeId BentFabricParamLongitudinalCutLength { get ; }` |
| Property | BentFabricParamStraightWiresLocation | — | `public static ForgeTypeId BentFabricParamStraightWiresLocation { get ; }` |
| Property | BlendEndParam | — | `public static ForgeTypeId BlendEndParam { get ; }` |
| Property | BlendStartParam | — | `public static ForgeTypeId BlendStartParam { get ; }` |
| Property | BoundaryAreaRestraintX | — | `public static ForgeTypeId BoundaryAreaRestraintX { get ; }` |
| Property | BoundaryAreaRestraintY | — | `public static ForgeTypeId BoundaryAreaRestraintY { get ; }` |
| Property | BoundaryAreaRestraintZ | — | `public static ForgeTypeId BoundaryAreaRestraintZ { get ; }` |
| Property | BoundaryBearing | — | `public static ForgeTypeId BoundaryBearing { get ; }` |
| Property | BoundaryConditionsIsExt | — | `public static ForgeTypeId BoundaryConditionsIsExt { get ; }` |
| Property | BoundaryConditionsType | — | `public static ForgeTypeId BoundaryConditionsType { get ; }` |
| Property | BoundaryDirectionRotX | — | `public static ForgeTypeId BoundaryDirectionRotX { get ; }` |
| Property | BoundaryDirectionRotY | — | `public static ForgeTypeId BoundaryDirectionRotY { get ; }` |
| Property | BoundaryDirectionRotZ | — | `public static ForgeTypeId BoundaryDirectionRotZ { get ; }` |
| Property | BoundaryDirectionX | — | `public static ForgeTypeId BoundaryDirectionX { get ; }` |
| Property | BoundaryDirectionY | — | `public static ForgeTypeId BoundaryDirectionY { get ; }` |
| Property | BoundaryDirectionZ | — | `public static ForgeTypeId BoundaryDirectionZ { get ; }` |
| Property | BoundaryDistance | — | `public static ForgeTypeId BoundaryDistance { get ; }` |
| Property | BoundaryLinearRestraintRotX | — | `public static ForgeTypeId BoundaryLinearRestraintRotX { get ; }` |
| Property | BoundaryLinearRestraintX | — | `public static ForgeTypeId BoundaryLinearRestraintX { get ; }` |
| Property | BoundaryLinearRestraintY | — | `public static ForgeTypeId BoundaryLinearRestraintY { get ; }` |
| Property | BoundaryLinearRestraintZ | — | `public static ForgeTypeId BoundaryLinearRestraintZ { get ; }` |
| Property | BoundaryParamPreset | — | `public static ForgeTypeId BoundaryParamPreset { get ; }` |
| Property | BoundaryParamPresetArea | — | `public static ForgeTypeId BoundaryParamPresetArea { get ; }` |
| Property | BoundaryParamPresetLinear | — | `public static ForgeTypeId BoundaryParamPresetLinear { get ; }` |
| Property | BoundaryRadius | — | `public static ForgeTypeId BoundaryRadius { get ; }` |
| Property | BoundaryRestraintRotX | — | `public static ForgeTypeId BoundaryRestraintRotX { get ; }` |
| Property | BoundaryRestraintRotY | — | `public static ForgeTypeId BoundaryRestraintRotY { get ; }` |
| Property | BoundaryRestraintRotZ | — | `public static ForgeTypeId BoundaryRestraintRotZ { get ; }` |
| Property | BoundaryRestraintX | — | `public static ForgeTypeId BoundaryRestraintX { get ; }` |
| Property | BoundaryRestraintY | — | `public static ForgeTypeId BoundaryRestraintY { get ; }` |
| Property | BoundaryRestraintZ | — | `public static ForgeTypeId BoundaryRestraintZ { get ; }` |
| Property | BoundaryXRotationFixed | — | `public static ForgeTypeId BoundaryXRotationFixed { get ; }` |
| Property | BoundaryXRotationSpring | — | `public static ForgeTypeId BoundaryXRotationSpring { get ; }` |
| Property | BoundaryXTranslationFixed | — | `public static ForgeTypeId BoundaryXTranslationFixed { get ; }` |
| Property | BoundaryXTranslationSpring | — | `public static ForgeTypeId BoundaryXTranslationSpring { get ; }` |
| Property | BoundaryYRotationFixed | — | `public static ForgeTypeId BoundaryYRotationFixed { get ; }` |
| Property | BoundaryYRotationSpring | — | `public static ForgeTypeId BoundaryYRotationSpring { get ; }` |
| Property | BoundaryYTranslationFixed | — | `public static ForgeTypeId BoundaryYTranslationFixed { get ; }` |
| Property | BoundaryYTranslationSpring | — | `public static ForgeTypeId BoundaryYTranslationSpring { get ; }` |
| Property | BoundaryZRotationFixed | — | `public static ForgeTypeId BoundaryZRotationFixed { get ; }` |
| Property | BoundaryZRotationSpring | — | `public static ForgeTypeId BoundaryZRotationSpring { get ; }` |
| Property | BoundaryZTranslationFixed | — | `public static ForgeTypeId BoundaryZTranslationFixed { get ; }` |
| Property | BoundaryZTranslationSpring | — | `public static ForgeTypeId BoundaryZTranslationSpring { get ; }` |
| Property | BrOrgFilter | — | `public static ForgeTypeId BrOrgFilter { get ; }` |
| Property | BrOrgFolders | — | `public static ForgeTypeId BrOrgFolders { get ; }` |
| Property | BuildingClosingTimeParam | — | `public static ForgeTypeId BuildingClosingTimeParam { get ; }` |
| Property | BuildingCurveGstyle | — | `public static ForgeTypeId BuildingCurveGstyle { get ; }` |
| Property | BuildingCurveGstylePlusInvisible | — | `public static ForgeTypeId BuildingCurveGstylePlusInvisible { get ; }` |
| Property | BuildingOpeningTimeParam | — | `public static ForgeTypeId BuildingOpeningTimeParam { get ; }` |
| Property | BuildingUnoccupiedCoolingSetPointParam | — | `public static ForgeTypeId BuildingUnoccupiedCoolingSetPointParam { get ; }` |
| Property | BuildingpadHeightabovelevelParam | — | `public static ForgeTypeId BuildingpadHeightabovelevelParam { get ; }` |
| Property | BuildingpadThickness | — | `public static ForgeTypeId BuildingpadThickness { get ; }` |
| Property | BuilidingPadStructureIdParam | — | `public static ForgeTypeId BuilidingPadStructureIdParam { get ; }` |
| Property | CabletrayMinbendmultiplierParam | — | `public static ForgeTypeId CabletrayMinbendmultiplierParam { get ; }` |
| Property | CalloutAttrHeadTag | — | `public static ForgeTypeId CalloutAttrHeadTag { get ; }` |
| Property | CalloutCornerSheetRadius | — | `public static ForgeTypeId CalloutCornerSheetRadius { get ; }` |
| Property | CalloutSyncronizeBoundOffsetFar | — | `public static ForgeTypeId CalloutSyncronizeBoundOffsetFar { get ; }` |
| Property | CalloutTag | — | `public static ForgeTypeId CalloutTag { get ; }` |
| Property | CeilingAttrDefaultHeightParam | — | `public static ForgeTypeId CeilingAttrDefaultHeightParam { get ; }` |
| Property | CeilingAttrPatternParam | — | `public static ForgeTypeId CeilingAttrPatternParam { get ; }` |
| Property | CeilingAttrSpacing1Param | — | `public static ForgeTypeId CeilingAttrSpacing1Param { get ; }` |
| Property | CeilingAttrSpacing2Param | — | `public static ForgeTypeId CeilingAttrSpacing2Param { get ; }` |
| Property | CeilingAttrSystemnameParam | — | `public static ForgeTypeId CeilingAttrSystemnameParam { get ; }` |
| Property | CeilingHasThicknessParam | — | `public static ForgeTypeId CeilingHasThicknessParam { get ; }` |
| Property | CeilingHeightabovelevelParam | — | `public static ForgeTypeId CeilingHeightabovelevelParam { get ; }` |
| Property | CeilingStructureIdParam | — | `public static ForgeTypeId CeilingStructureIdParam { get ; }` |
| Property | CeilingThickness | — | `public static ForgeTypeId CeilingThickness { get ; }` |
| Property | CeilingThicknessParam | — | `public static ForgeTypeId CeilingThicknessParam { get ; }` |
| Property | CenterMarkSize | — | `public static ForgeTypeId CenterMarkSize { get ; }` |
| Property | CircMullionRadius | — | `public static ForgeTypeId CircMullionRadius { get ; }` |
| Property | CircuitLoadClassificationAbbreviationParam | — | `public static ForgeTypeId CircuitLoadClassificationAbbreviationParam { get ; }` |
| Property | CircuitLoadClassificationParam | — | `public static ForgeTypeId CircuitLoadClassificationParam { get ; }` |
| Property | CircuitPhaseParam | — | `public static ForgeTypeId CircuitPhaseParam { get ; }` |
| Property | CircuitWaysParam | — | `public static ForgeTypeId CircuitWaysParam { get ; }` |
| Property | CircularFramingDiameter | — | `public static ForgeTypeId CircularFramingDiameter { get ; }` |
| Property | ClearCover | — | `public static ForgeTypeId ClearCover { get ; }` |
| Property | ClearCoverBottom | — | `public static ForgeTypeId ClearCoverBottom { get ; }` |
| Property | ClearCoverExterior | — | `public static ForgeTypeId ClearCoverExterior { get ; }` |
| Property | ClearCoverInterior | — | `public static ForgeTypeId ClearCoverInterior { get ; }` |
| Property | ClearCoverOther | — | `public static ForgeTypeId ClearCoverOther { get ; }` |
| Property | ClearCoverTop | — | `public static ForgeTypeId ClearCoverTop { get ; }` |
| Property | ClientName | — | `public static ForgeTypeId ClientName { get ; }` |
| Property | ClineSubcategory | — | `public static ForgeTypeId ClineSubcategory { get ; }` |
| Property | CoarseScaleFillPatternColor | — | `public static ForgeTypeId CoarseScaleFillPatternColor { get ; }` |
| Property | CoarseScaleFillPatternIdParam | — | `public static ForgeTypeId CoarseScaleFillPatternIdParam { get ; }` |
| Property | ColorFillFilteredParam | — | `public static ForgeTypeId ColorFillFilteredParam { get ; }` |
| Property | ColorFillSwatchHeightParam | — | `public static ForgeTypeId ColorFillSwatchHeightParam { get ; }` |
| Property | ColorFillSwatchWidthParam | — | `public static ForgeTypeId ColorFillSwatchWidthParam { get ; }` |
| Property | ColorSchemeLocation | — | `public static ForgeTypeId ColorSchemeLocation { get ; }` |
| Property | ColumnBaseAttachCutParam | — | `public static ForgeTypeId ColumnBaseAttachCutParam { get ; }` |
| Property | ColumnBaseAttachJustificationParam | — | `public static ForgeTypeId ColumnBaseAttachJustificationParam { get ; }` |
| Property | ColumnBaseAttachedParam | — | `public static ForgeTypeId ColumnBaseAttachedParam { get ; }` |
| Property | ColumnBaseAttachmentOffsetParam | — | `public static ForgeTypeId ColumnBaseAttachmentOffsetParam { get ; }` |
| Property | ColumnLocationMark | — | `public static ForgeTypeId ColumnLocationMark { get ; }` |
| Property | ColumnTopAttachCutParam | — | `public static ForgeTypeId ColumnTopAttachCutParam { get ; }` |
| Property | ColumnTopAttachJustificationParam | — | `public static ForgeTypeId ColumnTopAttachJustificationParam { get ; }` |
| Property | ColumnTopAttachedParam | — | `public static ForgeTypeId ColumnTopAttachedParam { get ; }` |
| Property | ColumnTopAttachmentOffsetParam | — | `public static ForgeTypeId ColumnTopAttachmentOffsetParam { get ; }` |
| Property | ConceptualConstructionMaterial | — | `public static ForgeTypeId ConceptualConstructionMaterial { get ; }` |
| Property | ConduitStandardTypeParam | — | `public static ForgeTypeId ConduitStandardTypeParam { get ; }` |
| Property | ConnectorAngle | — | `public static ForgeTypeId ConnectorAngle { get ; }` |
| Property | ConnectorAngleOfDeflection | — | `public static ForgeTypeId ConnectorAngleOfDeflection { get ; }` |
| Property | ConnectorDiameter | — | `public static ForgeTypeId ConnectorDiameter { get ; }` |
| Property | ConnectorEngagementLength | — | `public static ForgeTypeId ConnectorEngagementLength { get ; }` |
| Property | ConnectorGenderType | — | `public static ForgeTypeId ConnectorGenderType { get ; }` |
| Property | ConnectorHeight | — | `public static ForgeTypeId ConnectorHeight { get ; }` |
| Property | ConnectorIndex | — | `public static ForgeTypeId ConnectorIndex { get ; }` |
| Property | ConnectorInsideDiameter | — | `public static ForgeTypeId ConnectorInsideDiameter { get ; }` |
| Property | ConnectorJointType | — | `public static ForgeTypeId ConnectorJointType { get ; }` |
| Property | ConnectorLength | — | `public static ForgeTypeId ConnectorLength { get ; }` |
| Property | ConnectorProfileType | — | `public static ForgeTypeId ConnectorProfileType { get ; }` |
| Property | ConnectorRadius | — | `public static ForgeTypeId ConnectorRadius { get ; }` |
| Property | ConnectorReferenceIndex | — | `public static ForgeTypeId ConnectorReferenceIndex { get ; }` |
| Property | ConnectorUtilityParam | — | `public static ForgeTypeId ConnectorUtilityParam { get ; }` |
| Property | ConnectorVisibleSize | — | `public static ForgeTypeId ConnectorVisibleSize { get ; }` |
| Property | ConnectorWidth | — | `public static ForgeTypeId ConnectorWidth { get ; }` |
| Property | ConstraintFixedOffset | — | `public static ForgeTypeId ConstraintFixedOffset { get ; }` |
| Property | ConstructionIsSchematic | — | `public static ForgeTypeId ConstructionIsSchematic { get ; }` |
| Property | ConstructionName | — | `public static ForgeTypeId ConstructionName { get ; }` |
| Property | ContinuousFootingBearingWidth | — | `public static ForgeTypeId ContinuousFootingBearingWidth { get ; }` |
| Property | ContinuousFootingBottomHeel | — | `public static ForgeTypeId ContinuousFootingBottomHeel { get ; }` |
| Property | ContinuousFootingBottomToe | — | `public static ForgeTypeId ContinuousFootingBottomToe { get ; }` |
| Property | ContinuousFootingBreakAtInsertsDisable | — | `public static ForgeTypeId ContinuousFootingBreakAtInsertsDisable { get ; }` |
| Property | ContinuousFootingDefaultEndExtensionLength | — | `public static ForgeTypeId ContinuousFootingDefaultEndExtensionLength { get ; }` |
| Property | ContinuousFootingEccentricity | — | `public static ForgeTypeId ContinuousFootingEccentricity { get ; }` |
| Property | ContinuousFootingLength | — | `public static ForgeTypeId ContinuousFootingLength { get ; }` |
| Property | ContinuousFootingStructuralUsage | — | `public static ForgeTypeId ContinuousFootingStructuralUsage { get ; }` |
| Property | ContinuousFootingTopHeel | — | `public static ForgeTypeId ContinuousFootingTopHeel { get ; }` |
| Property | ContinuousFootingTopToe | — | `public static ForgeTypeId ContinuousFootingTopToe { get ; }` |
| Property | ContinuousFootingWidth | — | `public static ForgeTypeId ContinuousFootingWidth { get ; }` |
| Property | ContinuousrailBeginningTerminationAttachmentParam | — | `public static ForgeTypeId ContinuousrailBeginningTerminationAttachmentParam { get ; }` |
| Property | ContinuousrailBeginningTerminationTypeParam | — | `public static ForgeTypeId ContinuousrailBeginningTerminationTypeParam { get ; }` |
| Property | ContinuousrailDefaultJoinTypeParam | — | `public static ForgeTypeId ContinuousrailDefaultJoinTypeParam { get ; }` |
| Property | ContinuousrailEndExtensionLengthParam | — | `public static ForgeTypeId ContinuousrailEndExtensionLengthParam { get ; }` |
| Property | ContinuousrailEndTerminationAttachmentParam | — | `public static ForgeTypeId ContinuousrailEndTerminationAttachmentParam { get ; }` |
| Property | ContinuousrailEndTerminationTypeParam | — | `public static ForgeTypeId ContinuousrailEndTerminationTypeParam { get ; }` |
| Property | ContinuousrailExtensionLengthParam | — | `public static ForgeTypeId ContinuousrailExtensionLengthParam { get ; }` |
| Property | ContinuousrailFilletRadiusParam | — | `public static ForgeTypeId ContinuousrailFilletRadiusParam { get ; }` |
| Property | ContinuousrailJoinTypeParam | — | `public static ForgeTypeId ContinuousrailJoinTypeParam { get ; }` |
| Property | ContinuousrailLengthParam | — | `public static ForgeTypeId ContinuousrailLengthParam { get ; }` |
| Property | ContinuousrailMaterialsParam | — | `public static ForgeTypeId ContinuousrailMaterialsParam { get ; }` |
| Property | ContinuousrailPlusTreadDepthParam | — | `public static ForgeTypeId ContinuousrailPlusTreadDepthParam { get ; }` |
| Property | ContinuousrailProfileTypeParam | — | `public static ForgeTypeId ContinuousrailProfileTypeParam { get ; }` |
| Property | ContinuousrailTransitionTypeParam | — | `public static ForgeTypeId ContinuousrailTransitionTypeParam { get ; }` |
| Property | ContourElevation | — | `public static ForgeTypeId ContourElevation { get ; }` |
| Property | ContourElevationStep | — | `public static ForgeTypeId ContourElevationStep { get ; }` |
| Property | ContourLabelsElevBaseType | — | `public static ForgeTypeId ContourLabelsElevBaseType { get ; }` |
| Property | ContourLabelsLinearUnits | — | `public static ForgeTypeId ContourLabelsLinearUnits { get ; }` |
| Property | ContourLabelsPrimaryOnly | — | `public static ForgeTypeId ContourLabelsPrimaryOnly { get ; }` |
| Property | ContourLabelsRelativeBase | — | `public static ForgeTypeId ContourLabelsRelativeBase { get ; }` |
| Property | CouplerCode | — | `public static ForgeTypeId CouplerCode { get ; }` |
| Property | CouplerCoupledBarSize | — | `public static ForgeTypeId CouplerCoupledBarSize { get ; }` |
| Property | CouplerCoupledEndtreatment | — | `public static ForgeTypeId CouplerCoupledEndtreatment { get ; }` |
| Property | CouplerCoupledEngagement | — | `public static ForgeTypeId CouplerCoupledEngagement { get ; }` |
| Property | CouplerLength | — | `public static ForgeTypeId CouplerLength { get ; }` |
| Property | CouplerMainBarSize | — | `public static ForgeTypeId CouplerMainBarSize { get ; }` |
| Property | CouplerMainEndtreatment | — | `public static ForgeTypeId CouplerMainEndtreatment { get ; }` |
| Property | CouplerMainEngagement | — | `public static ForgeTypeId CouplerMainEngagement { get ; }` |
| Property | CouplerMark | — | `public static ForgeTypeId CouplerMark { get ; }` |
| Property | CouplerNumber | — | `public static ForgeTypeId CouplerNumber { get ; }` |
| Property | CouplerQuantity | — | `public static ForgeTypeId CouplerQuantity { get ; }` |
| Property | CouplerRotationAngle | — | `public static ForgeTypeId CouplerRotationAngle { get ; }` |
| Property | CouplerWeight | — | `public static ForgeTypeId CouplerWeight { get ; }` |
| Property | CouplerWidth | — | `public static ForgeTypeId CouplerWidth { get ; }` |
| Property | CoverTypeLength | — | `public static ForgeTypeId CoverTypeLength { get ; }` |
| Property | CoverTypeName | — | `public static ForgeTypeId CoverTypeName { get ; }` |
| Property | CurtainGridBaseOrientation | — | `public static ForgeTypeId CurtainGridBaseOrientation { get ; }` |
| Property | CurtainVersionParam | — | `public static ForgeTypeId CurtainVersionParam { get ; }` |
| Property | CurtainWallPanelHostId | — | `public static ForgeTypeId CurtainWallPanelHostId { get ; }` |
| Property | CurtainWallPanelsHeight | — | `public static ForgeTypeId CurtainWallPanelsHeight { get ; }` |
| Property | CurtainWallPanelsWidth | — | `public static ForgeTypeId CurtainWallPanelsWidth { get ; }` |
| Property | CurtainWallSyspanelOffset | — | `public static ForgeTypeId CurtainWallSyspanelOffset { get ; }` |
| Property | CurtainWallSyspanelThickness | — | `public static ForgeTypeId CurtainWallSyspanelThickness { get ; }` |
| Property | CurtaingridAdjustBorderHoriz | — | `public static ForgeTypeId CurtaingridAdjustBorderHoriz { get ; }` |
| Property | CurtaingridAdjustBorderU | — | `public static ForgeTypeId CurtaingridAdjustBorderU { get ; }` |
| Property | CurtaingridAdjustBorderV | — | `public static ForgeTypeId CurtaingridAdjustBorderV { get ; }` |
| Property | CurtaingridAdjustBorderVert | — | `public static ForgeTypeId CurtaingridAdjustBorderVert { get ; }` |
| Property | CurtaingridAdjustBordern1 | — | `public static ForgeTypeId CurtaingridAdjustBordern1 { get ; }` |
| Property | CurtaingridAdjustBordern2 | — | `public static ForgeTypeId CurtaingridAdjustBordern2 { get ; }` |
| Property | CurtaingridAngleHoriz | — | `public static ForgeTypeId CurtaingridAngleHoriz { get ; }` |
| Property | CurtaingridAngleU | — | `public static ForgeTypeId CurtaingridAngleU { get ; }` |
| Property | CurtaingridAngleV | — | `public static ForgeTypeId CurtaingridAngleV { get ; }` |
| Property | CurtaingridAngleVert | — | `public static ForgeTypeId CurtaingridAngleVert { get ; }` |
| Property | CurtaingridAnglen1 | — | `public static ForgeTypeId CurtaingridAnglen1 { get ; }` |
| Property | CurtaingridAnglen2 | — | `public static ForgeTypeId CurtaingridAnglen2 { get ; }` |
| Property | CurtaingridBeltHoriz | — | `public static ForgeTypeId CurtaingridBeltHoriz { get ; }` |
| Property | CurtaingridBeltRatioU | — | `public static ForgeTypeId CurtaingridBeltRatioU { get ; }` |
| Property | CurtaingridBeltRatioV | — | `public static ForgeTypeId CurtaingridBeltRatioV { get ; }` |
| Property | CurtaingridBeltRation1 | — | `public static ForgeTypeId CurtaingridBeltRation1 { get ; }` |
| Property | CurtaingridBeltRation2 | — | `public static ForgeTypeId CurtaingridBeltRation2 { get ; }` |
| Property | CurtaingridBeltU | — | `public static ForgeTypeId CurtaingridBeltU { get ; }` |
| Property | CurtaingridBeltV | — | `public static ForgeTypeId CurtaingridBeltV { get ; }` |
| Property | CurtaingridBeltVert | — | `public static ForgeTypeId CurtaingridBeltVert { get ; }` |
| Property | CurtaingridBeltn1 | — | `public static ForgeTypeId CurtaingridBeltn1 { get ; }` |
| Property | CurtaingridBeltn2 | — | `public static ForgeTypeId CurtaingridBeltn2 { get ; }` |
| Property | CurtaingridOriginHoriz | — | `public static ForgeTypeId CurtaingridOriginHoriz { get ; }` |
| Property | CurtaingridOriginU | — | `public static ForgeTypeId CurtaingridOriginU { get ; }` |
| Property | CurtaingridOriginV | — | `public static ForgeTypeId CurtaingridOriginV { get ; }` |
| Property | CurtaingridOriginVert | — | `public static ForgeTypeId CurtaingridOriginVert { get ; }` |
| Property | CurtaingridOriginn1 | — | `public static ForgeTypeId CurtaingridOriginn1 { get ; }` |
| Property | CurtaingridOriginn2 | — | `public static ForgeTypeId CurtaingridOriginn2 { get ; }` |
| Property | CurtaingridUseCurveDist | — | `public static ForgeTypeId CurtaingridUseCurveDist { get ; }` |
| Property | CurtaingridUseCurveDistHoriz | — | `public static ForgeTypeId CurtaingridUseCurveDistHoriz { get ; }` |
| Property | CurtaingridUseCurveDistU | — | `public static ForgeTypeId CurtaingridUseCurveDistU { get ; }` |
| Property | CurtaingridUseCurveDistV | — | `public static ForgeTypeId CurtaingridUseCurveDistV { get ; }` |
| Property | CurtaingridUseCurveDistVert | — | `public static ForgeTypeId CurtaingridUseCurveDistVert { get ; }` |
| Property | CurtaingridUseCurveDistn1 | — | `public static ForgeTypeId CurtaingridUseCurveDistn1 { get ; }` |
| Property | CurtaingridUseCurveDistn2 | — | `public static ForgeTypeId CurtaingridUseCurveDistn2 { get ; }` |
| Property | CurveBottomLevel | — | `public static ForgeTypeId CurveBottomLevel { get ; }` |
| Property | CurveByPointsProjectionType | — | `public static ForgeTypeId CurveByPointsProjectionType { get ; }` |
| Property | CurveDeterminesOrientation | — | `public static ForgeTypeId CurveDeterminesOrientation { get ; }` |
| Property | CurveEdgeOffset | — | `public static ForgeTypeId CurveEdgeOffset { get ; }` |
| Property | CurveElemArcEndAngle | — | `public static ForgeTypeId CurveElemArcEndAngle { get ; }` |
| Property | CurveElemArcRadius | — | `public static ForgeTypeId CurveElemArcRadius { get ; }` |
| Property | CurveElemArcRange | — | `public static ForgeTypeId CurveElemArcRange { get ; }` |
| Property | CurveElemArcStartAngle | — | `public static ForgeTypeId CurveElemArcStartAngle { get ; }` |
| Property | CurveElemDefinesSlope | — | `public static ForgeTypeId CurveElemDefinesSlope { get ; }` |
| Property | CurveElemLength | — | `public static ForgeTypeId CurveElemLength { get ; }` |
| Property | CurveElemLineAngle | — | `public static ForgeTypeId CurveElemLineAngle { get ; }` |
| Property | CurveHeightOffset | — | `public static ForgeTypeId CurveHeightOffset { get ; }` |
| Property | CurveIsDetail | — | `public static ForgeTypeId CurveIsDetail { get ; }` |
| Property | CurveIsFilled | — | `public static ForgeTypeId CurveIsFilled { get ; }` |
| Property | CurveIsMultilevel | — | `public static ForgeTypeId CurveIsMultilevel { get ; }` |
| Property | CurveIsReferenceLine | — | `public static ForgeTypeId CurveIsReferenceLine { get ; }` |
| Property | CurveIsSlopeDefining | — | `public static ForgeTypeId CurveIsSlopeDefining { get ; }` |
| Property | CurveLevel | — | `public static ForgeTypeId CurveLevel { get ; }` |
| Property | CurveNumberOfSegments | — | `public static ForgeTypeId CurveNumberOfSegments { get ; }` |
| Property | CurveParamConcreteCantilever | — | `public static ForgeTypeId CurveParamConcreteCantilever { get ; }` |
| Property | CurveParamSteelCantilever | — | `public static ForgeTypeId CurveParamSteelCantilever { get ; }` |
| Property | CurveSupportOffset | — | `public static ForgeTypeId CurveSupportOffset { get ; }` |
| Property | CurveTopLevel | — | `public static ForgeTypeId CurveTopLevel { get ; }` |
| Property | CurveVisibilityParam | — | `public static ForgeTypeId CurveVisibilityParam { get ; }` |
| Property | CurveWallOffset | — | `public static ForgeTypeId CurveWallOffset { get ; }` |
| Property | CurveWallOffsetRoofs | — | `public static ForgeTypeId CurveWallOffsetRoofs { get ; }` |
| Property | CustMullionThick | — | `public static ForgeTypeId CustMullionThick { get ; }` |
| Property | CustMullionWidth1 | — | `public static ForgeTypeId CustMullionWidth1 { get ; }` |
| Property | CustMullionWidth2 | — | `public static ForgeTypeId CustMullionWidth2 { get ; }` |
| Property | CutLineAngle | — | `public static ForgeTypeId CutLineAngle { get ; }` |
| Property | CutLineDistance | — | `public static ForgeTypeId CutLineDistance { get ; }` |
| Property | CutLineExtension | — | `public static ForgeTypeId CutLineExtension { get ; }` |
| Property | CutLineType | — | `public static ForgeTypeId CutLineType { get ; }` |
| Property | CutMarkSymbol | — | `public static ForgeTypeId CutMarkSymbol { get ; }` |
| Property | CutMarkSymbolSize | — | `public static ForgeTypeId CutMarkSymbolSize { get ; }` |
| Property | CwpAddGridPrefix | — | `public static ForgeTypeId CwpAddGridPrefix { get ; }` |
| Property | CwpAddGridSuffix | — | `public static ForgeTypeId CwpAddGridSuffix { get ; }` |
| Property | CwpAddLevelPrefix | — | `public static ForgeTypeId CwpAddLevelPrefix { get ; }` |
| Property | CwpAddLevelSuffix | — | `public static ForgeTypeId CwpAddLevelSuffix { get ; }` |
| Property | CwpCopyFloorInserts | — | `public static ForgeTypeId CwpCopyFloorInserts { get ; }` |
| Property | CwpCopyRoofInserts | — | `public static ForgeTypeId CwpCopyRoofInserts { get ; }` |
| Property | CwpCopyWallInserts | — | `public static ForgeTypeId CwpCopyWallInserts { get ; }` |
| Property | CwpLevelOffset | — | `public static ForgeTypeId CwpLevelOffset { get ; }` |
| Property | CwpLinkedRoomParams | — | `public static ForgeTypeId CwpLinkedRoomParams { get ; }` |
| Property | CwpLinkedRoomPhases | — | `public static ForgeTypeId CwpLinkedRoomPhases { get ; }` |
| Property | CwpReuseExistingGrids | — | `public static ForgeTypeId CwpReuseExistingGrids { get ; }` |
| Property | CwpReuseExistingLevels | — | `public static ForgeTypeId CwpReuseExistingLevels { get ; }` |
| Property | CwpReuseGridsSameName | — | `public static ForgeTypeId CwpReuseGridsSameName { get ; }` |
| Property | CwpReuseLevelsSameName | — | `public static ForgeTypeId CwpReuseLevelsSameName { get ; }` |
| Property | CwpSplitColumnsAtLevels | — | `public static ForgeTypeId CwpSplitColumnsAtLevels { get ; }` |
| Property | DatumBubbleEndn1 | — | `public static ForgeTypeId DatumBubbleEndn1 { get ; }` |
| Property | DatumBubbleEndn2 | — | `public static ForgeTypeId DatumBubbleEndn2 { get ; }` |
| Property | DatumBubbleLocationInElev | — | `public static ForgeTypeId DatumBubbleLocationInElev { get ; }` |
| Property | DatumPlaneDefinesOrigin | — | `public static ForgeTypeId DatumPlaneDefinesOrigin { get ; }` |
| Property | DatumPlaneDefinesWallClosure | — | `public static ForgeTypeId DatumPlaneDefinesWallClosure { get ; }` |
| Property | DatumText | — | `public static ForgeTypeId DatumText { get ; }` |
| Property | DatumVolumeOfInterest | — | `public static ForgeTypeId DatumVolumeOfInterest { get ; }` |
| Property | DebugtabDataboundcontrolsdemoBoolean | — | `public static ForgeTypeId DebugtabDataboundcontrolsdemoBoolean { get ; }` |
| Property | DebugtabDataboundcontrolsdemoDouble | — | `public static ForgeTypeId DebugtabDataboundcontrolsdemoDouble { get ; }` |
| Property | DebugtabDataboundcontrolsdemoEnum | — | `public static ForgeTypeId DebugtabDataboundcontrolsdemoEnum { get ; }` |
| Property | DebugtabDataboundcontrolsdemoInteger | — | `public static ForgeTypeId DebugtabDataboundcontrolsdemoInteger { get ; }` |
| Property | DecalAttributes | — | `public static ForgeTypeId DecalAttributes { get ; }` |
| Property | DecalHeight | — | `public static ForgeTypeId DecalHeight { get ; }` |
| Property | DecalLockProportions | — | `public static ForgeTypeId DecalLockProportions { get ; }` |
| Property | DecalSubcategoryId | — | `public static ForgeTypeId DecalSubcategoryId { get ; }` |
| Property | DecalWidth | — | `public static ForgeTypeId DecalWidth { get ; }` |
| Property | DefaultConstructionExtWallUnderground | — | `public static ForgeTypeId DefaultConstructionExtWallUnderground { get ; }` |
| Property | DefaultConstructionMassExteriorWall | — | `public static ForgeTypeId DefaultConstructionMassExteriorWall { get ; }` |
| Property | DefaultConstructionMassFloor | — | `public static ForgeTypeId DefaultConstructionMassFloor { get ; }` |
| Property | DefaultConstructionMassGlazing | — | `public static ForgeTypeId DefaultConstructionMassGlazing { get ; }` |
| Property | DefaultConstructionMassInteriorWall | — | `public static ForgeTypeId DefaultConstructionMassInteriorWall { get ; }` |
| Property | DefaultConstructionMassOpening | — | `public static ForgeTypeId DefaultConstructionMassOpening { get ; }` |
| Property | DefaultConstructionMassRoof | — | `public static ForgeTypeId DefaultConstructionMassRoof { get ; }` |
| Property | DefaultConstructionMassShade | — | `public static ForgeTypeId DefaultConstructionMassShade { get ; }` |
| Property | DefaultConstructionMassSkylight | — | `public static ForgeTypeId DefaultConstructionMassSkylight { get ; }` |
| Property | DefaultConstructionMassSlab | — | `public static ForgeTypeId DefaultConstructionMassSlab { get ; }` |
| Property | DefaultViewTemplate | — | `public static ForgeTypeId DefaultViewTemplate { get ; }` |
| Property | DefinesConstantHeight | — | `public static ForgeTypeId DefinesConstantHeight { get ; }` |
| Property | DesignOptionId | — | `public static ForgeTypeId DesignOptionId { get ; }` |
| Property | DesignOptionParam | — | `public static ForgeTypeId DesignOptionParam { get ; }` |
| Property | DiameterSymbolLocation | — | `public static ForgeTypeId DiameterSymbolLocation { get ; }` |
| Property | DiameterSymbolText | — | `public static ForgeTypeId DiameterSymbolText { get ; }` |
| Property | DimDisplayEq | — | `public static ForgeTypeId DimDisplayEq { get ; }` |
| Property | DimIsreporting | — | `public static ForgeTypeId DimIsreporting { get ; }` |
| Property | DimLabel | — | `public static ForgeTypeId DimLabel { get ; }` |
| Property | DimLabelGpShow | — | `public static ForgeTypeId DimLabelGpShow { get ; }` |
| Property | DimLabelIsInstance | — | `public static ForgeTypeId DimLabelIsInstance { get ; }` |
| Property | DimLeader | — | `public static ForgeTypeId DimLeader { get ; }` |
| Property | DimLeaderArrowhead | — | `public static ForgeTypeId DimLeaderArrowhead { get ; }` |
| Property | DimLeaderDisplayCondition | — | `public static ForgeTypeId DimLeaderDisplayCondition { get ; }` |
| Property | DimLeaderShoulderLength | — | `public static ForgeTypeId DimLeaderShoulderLength { get ; }` |
| Property | DimLeaderType | — | `public static ForgeTypeId DimLeaderType { get ; }` |
| Property | DimLineExtension | — | `public static ForgeTypeId DimLineExtension { get ; }` |
| Property | DimNotModifiable | — | `public static ForgeTypeId DimNotModifiable { get ; }` |
| Property | DimPrefix | — | `public static ForgeTypeId DimPrefix { get ; }` |
| Property | DimReferenceCount | — | `public static ForgeTypeId DimReferenceCount { get ; }` |
| Property | DimStyleAngularUnits | — | `public static ForgeTypeId DimStyleAngularUnits { get ; }` |
| Property | DimStyleAngularUnitsAlt | — | `public static ForgeTypeId DimStyleAngularUnitsAlt { get ; }` |
| Property | DimStyleCenterlinePattern | — | `public static ForgeTypeId DimStyleCenterlinePattern { get ; }` |
| Property | DimStyleCenterlineSymbol | — | `public static ForgeTypeId DimStyleCenterlineSymbol { get ; }` |
| Property | DimStyleCenterlineTickMark | — | `public static ForgeTypeId DimStyleCenterlineTickMark { get ; }` |
| Property | DimStyleDimLineSnapDist | — | `public static ForgeTypeId DimStyleDimLineSnapDist { get ; }` |
| Property | DimStyleFlippedDimLineExtension | — | `public static ForgeTypeId DimStyleFlippedDimLineExtension { get ; }` |
| Property | DimStyleInteriorTickMark | — | `public static ForgeTypeId DimStyleInteriorTickMark { get ; }` |
| Property | DimStyleLeaderTickMark | — | `public static ForgeTypeId DimStyleLeaderTickMark { get ; }` |
| Property | DimStyleLinearUnits | — | `public static ForgeTypeId DimStyleLinearUnits { get ; }` |
| Property | DimStyleLinearUnitsAlt | — | `public static ForgeTypeId DimStyleLinearUnitsAlt { get ; }` |
| Property | DimStyleReadConvention | — | `public static ForgeTypeId DimStyleReadConvention { get ; }` |
| Property | DimStyleShowOpeningHt | — | `public static ForgeTypeId DimStyleShowOpeningHt { get ; }` |
| Property | DimStyleSuppressSpaces | — | `public static ForgeTypeId DimStyleSuppressSpaces { get ; }` |
| Property | DimSuffix | — | `public static ForgeTypeId DimSuffix { get ; }` |
| Property | DimTextBackground | — | `public static ForgeTypeId DimTextBackground { get ; }` |
| Property | DimTextLocationForLeader | — | `public static ForgeTypeId DimTextLocationForLeader { get ; }` |
| Property | DimToInsertType | — | `public static ForgeTypeId DimToInsertType { get ; }` |
| Property | DimToInserts | — | `public static ForgeTypeId DimToInserts { get ; }` |
| Property | DimToIntersectingGrids | — | `public static ForgeTypeId DimToIntersectingGrids { get ; }` |
| Property | DimToIntersectingWalls | — | `public static ForgeTypeId DimToIntersectingWalls { get ; }` |
| Property | DimTotalLength | — | `public static ForgeTypeId DimTotalLength { get ; }` |
| Property | DimValueAngle | — | `public static ForgeTypeId DimValueAngle { get ; }` |
| Property | DimValueLength | — | `public static ForgeTypeId DimValueLength { get ; }` |
| Property | DimWitnsLineCntrl | — | `public static ForgeTypeId DimWitnsLineCntrl { get ; }` |
| Property | DimWitnsLineExtensionBelow | — | `public static ForgeTypeId DimWitnsLineExtensionBelow { get ; }` |
| Property | Directcontext3dApplicationId | — | `public static ForgeTypeId Directcontext3dApplicationId { get ; }` |
| Property | Directcontext3dLoaded | — | `public static ForgeTypeId Directcontext3dLoaded { get ; }` |
| Property | Directcontext3dName | — | `public static ForgeTypeId Directcontext3dName { get ; }` |
| Property | Directcontext3dServerId | — | `public static ForgeTypeId Directcontext3dServerId { get ; }` |
| Property | Directcontext3dSourceId | — | `public static ForgeTypeId Directcontext3dSourceId { get ; }` |
| Property | DisplacedElementDisplacementX | — | `public static ForgeTypeId DisplacedElementDisplacementX { get ; }` |
| Property | DisplacedElementDisplacementY | — | `public static ForgeTypeId DisplacedElementDisplacementY { get ; }` |
| Property | DisplacedElementDisplacementZ | — | `public static ForgeTypeId DisplacedElementDisplacementZ { get ; }` |
| Property | DisplacementPathDepth | — | `public static ForgeTypeId DisplacementPathDepth { get ; }` |
| Property | DisplacementPathStyle | — | `public static ForgeTypeId DisplacementPathStyle { get ; }` |
| Property | DistanceToCutMark | — | `public static ForgeTypeId DistanceToCutMark { get ; }` |
| Property | DividedSurfaceAllGridRotation | — | `public static ForgeTypeId DividedSurfaceAllGridRotation { get ; }` |
| Property | DividedSurfaceAllPoints | — | `public static ForgeTypeId DividedSurfaceAllPoints { get ; }` |
| Property | DividedSurfaceComponentTrimType | — | `public static ForgeTypeId DividedSurfaceComponentTrimType { get ; }` |
| Property | DividedSurfaceCoverFaceCompletely | — | `public static ForgeTypeId DividedSurfaceCoverFaceCompletely { get ; }` |
| Property | DividedSurfaceDisplayComponents | — | `public static ForgeTypeId DividedSurfaceDisplayComponents { get ; }` |
| Property | DividedSurfaceDisplayDiscardeddivisionlines | — | `public static ForgeTypeId DividedSurfaceDisplayDiscardeddivisionlines { get ; }` |
| Property | DividedSurfaceDisplayGridlines | — | `public static ForgeTypeId DividedSurfaceDisplayGridlines { get ; }` |
| Property | DividedSurfaceDisplayNodes | — | `public static ForgeTypeId DividedSurfaceDisplayNodes { get ; }` |
| Property | DividedSurfaceDisplayOriginalSurface | — | `public static ForgeTypeId DividedSurfaceDisplayOriginalSurface { get ; }` |
| Property | DividedSurfaceDisplayPatternFill | — | `public static ForgeTypeId DividedSurfaceDisplayPatternFill { get ; }` |
| Property | DividedSurfaceDisplayPatternLines | — | `public static ForgeTypeId DividedSurfaceDisplayPatternLines { get ; }` |
| Property | DividedSurfaceDisplaySurfaceOption | — | `public static ForgeTypeId DividedSurfaceDisplaySurfaceOption { get ; }` |
| Property | DividedSurfaceEdgeNumber | — | `public static ForgeTypeId DividedSurfaceEdgeNumber { get ; }` |
| Property | DividedSurfaceFacetNumber | — | `public static ForgeTypeId DividedSurfaceFacetNumber { get ; }` |
| Property | DividedSurfaceGridOptionParamn1 | — | `public static ForgeTypeId DividedSurfaceGridOptionParamn1 { get ; }` |
| Property | DividedSurfaceGridOptionParamn2 | — | `public static ForgeTypeId DividedSurfaceGridOptionParamn2 { get ; }` |
| Property | DividedSurfaceGridlinesStyle | — | `public static ForgeTypeId DividedSurfaceGridlinesStyle { get ; }` |
| Property | DividedSurfaceOffsetFromSurface | — | `public static ForgeTypeId DividedSurfaceOffsetFromSurface { get ; }` |
| Property | DividedSurfaceOriginalSurfaceMaterial | — | `public static ForgeTypeId DividedSurfaceOriginalSurfaceMaterial { get ; }` |
| Property | DividedSurfacePattern | — | `public static ForgeTypeId DividedSurfacePattern { get ; }` |
| Property | DividedSurfacePatternFillMaterial | — | `public static ForgeTypeId DividedSurfacePatternFillMaterial { get ; }` |
| Property | DividedSurfacePatternFlip | — | `public static ForgeTypeId DividedSurfacePatternFlip { get ; }` |
| Property | DividedSurfacePatternIndentn1 | — | `public static ForgeTypeId DividedSurfacePatternIndentn1 { get ; }` |
| Property | DividedSurfacePatternIndentn2 | — | `public static ForgeTypeId DividedSurfacePatternIndentn2 { get ; }` |
| Property | DividedSurfacePatternLinesStyle | — | `public static ForgeTypeId DividedSurfacePatternLinesStyle { get ; }` |
| Property | DividedSurfacePatternMirror | — | `public static ForgeTypeId DividedSurfacePatternMirror { get ; }` |
| Property | DividedSurfacePatternRotationAngle | — | `public static ForgeTypeId DividedSurfacePatternRotationAngle { get ; }` |
| Property | DividedSurfacePointNumber | — | `public static ForgeTypeId DividedSurfacePointNumber { get ; }` |
| Property | DividedSurfaceRule1Suspension | — | `public static ForgeTypeId DividedSurfaceRule1Suspension { get ; }` |
| Property | DividedSurfaceRule2Suspension | — | `public static ForgeTypeId DividedSurfaceRule2Suspension { get ; }` |
| Property | DividedSurfaceSurfaceArea | — | `public static ForgeTypeId DividedSurfaceSurfaceArea { get ; }` |
| Property | DividedSurfaceTileBorder | — | `public static ForgeTypeId DividedSurfaceTileBorder { get ; }` |
| Property | DividedSurfaceTotalEdgeLength | — | `public static ForgeTypeId DividedSurfaceTotalEdgeLength { get ; }` |
| Property | DividedpathBeginningIndent | — | `public static ForgeTypeId DividedpathBeginningIndent { get ; }` |
| Property | DividedpathDisplayNodeNumbers | — | `public static ForgeTypeId DividedpathDisplayNodeNumbers { get ; }` |
| Property | DividedpathDisplayNodes | — | `public static ForgeTypeId DividedpathDisplayNodes { get ; }` |
| Property | DividedpathDisplayReferenceCurves | — | `public static ForgeTypeId DividedpathDisplayReferenceCurves { get ; }` |
| Property | DividedpathDistance | — | `public static ForgeTypeId DividedpathDistance { get ; }` |
| Property | DividedpathEndIndent | — | `public static ForgeTypeId DividedpathEndIndent { get ; }` |
| Property | DividedpathFlipDirection | — | `public static ForgeTypeId DividedpathFlipDirection { get ; }` |
| Property | DividedpathJustification | — | `public static ForgeTypeId DividedpathJustification { get ; }` |
| Property | DividedpathLayout | — | `public static ForgeTypeId DividedpathLayout { get ; }` |
| Property | DividedpathLayoutFixedNumPoint | — | `public static ForgeTypeId DividedpathLayoutFixedNumPoint { get ; }` |
| Property | DividedpathMaxDistance | — | `public static ForgeTypeId DividedpathMaxDistance { get ; }` |
| Property | DividedpathMeasurementType | — | `public static ForgeTypeId DividedpathMeasurementType { get ; }` |
| Property | DividedpathMergedPointNum | — | `public static ForgeTypeId DividedpathMergedPointNum { get ; }` |
| Property | DividedpathMinDistance | — | `public static ForgeTypeId DividedpathMinDistance { get ; }` |
| Property | DividedpathTotalPathLength | — | `public static ForgeTypeId DividedpathTotalPathLength { get ; }` |
| Property | DivisionPattern | — | `public static ForgeTypeId DivisionPattern { get ; }` |
| Property | DivisionProfileWidth | — | `public static ForgeTypeId DivisionProfileWidth { get ; }` |
| Property | DivisionRuleParam | — | `public static ForgeTypeId DivisionRuleParam { get ; }` |
| Property | DivisionSketchCurveDivisionParamsOverrideParam | — | `public static ForgeTypeId DivisionSketchCurveDivisionParamsOverrideParam { get ; }` |
| Property | DivisionSketchCurveExtentdToSilhParam | — | `public static ForgeTypeId DivisionSketchCurveExtentdToSilhParam { get ; }` |
| Property | DoorConstructionType | — | `public static ForgeTypeId DoorConstructionType { get ; }` |
| Property | DoorCost | — | `public static ForgeTypeId DoorCost { get ; }` |
| Property | DoorEvacuationExitType | — | `public static ForgeTypeId DoorEvacuationExitType { get ; }` |
| Property | DoorFinish | — | `public static ForgeTypeId DoorFinish { get ; }` |
| Property | DoorFrameMaterial | — | `public static ForgeTypeId DoorFrameMaterial { get ; }` |
| Property | DoorFrameType | — | `public static ForgeTypeId DoorFrameType { get ; }` |
| Property | DoorNumber | — | `public static ForgeTypeId DoorNumber { get ; }` |
| Property | DoorOperationType | — | `public static ForgeTypeId DoorOperationType { get ; }` |
| Property | DpartAreaComputed | — | `public static ForgeTypeId DpartAreaComputed { get ; }` |
| Property | DpartBaseLevel | — | `public static ForgeTypeId DpartBaseLevel { get ; }` |
| Property | DpartBaseLevelByOriginal | — | `public static ForgeTypeId DpartBaseLevelByOriginal { get ; }` |
| Property | DpartCanHostRebar | — | `public static ForgeTypeId DpartCanHostRebar { get ; }` |
| Property | DpartExcluded | — | `public static ForgeTypeId DpartExcluded { get ; }` |
| Property | DpartHeightComputed | — | `public static ForgeTypeId DpartHeightComputed { get ; }` |
| Property | DpartLayerConstruction | — | `public static ForgeTypeId DpartLayerConstruction { get ; }` |
| Property | DpartLayerFunction | — | `public static ForgeTypeId DpartLayerFunction { get ; }` |
| Property | DpartLayerIndex | — | `public static ForgeTypeId DpartLayerIndex { get ; }` |
| Property | DpartLayerWidth | — | `public static ForgeTypeId DpartLayerWidth { get ; }` |
| Property | DpartLengthComputed | — | `public static ForgeTypeId DpartLengthComputed { get ; }` |
| Property | DpartMaterialByOriginal | — | `public static ForgeTypeId DpartMaterialByOriginal { get ; }` |
| Property | DpartMaterialIdParam | — | `public static ForgeTypeId DpartMaterialIdParam { get ; }` |
| Property | DpartOriginalCategory | — | `public static ForgeTypeId DpartOriginalCategory { get ; }` |
| Property | DpartOriginalCategoryId | — | `public static ForgeTypeId DpartOriginalCategoryId { get ; }` |
| Property | DpartOriginalFamily | — | `public static ForgeTypeId DpartOriginalFamily { get ; }` |
| Property | DpartOriginalType | — | `public static ForgeTypeId DpartOriginalType { get ; }` |
| Property | DpartPhaseCreatedByOriginal | — | `public static ForgeTypeId DpartPhaseCreatedByOriginal { get ; }` |
| Property | DpartPhaseDemolishedByOriginal | — | `public static ForgeTypeId DpartPhaseDemolishedByOriginal { get ; }` |
| Property | DpartShapeModified | — | `public static ForgeTypeId DpartShapeModified { get ; }` |
| Property | DpartVolumeComputed | — | `public static ForgeTypeId DpartVolumeComputed { get ; }` |
| Property | DrawForEachRun | — | `public static ForgeTypeId DrawForEachRun { get ; }` |
| Property | DuctRoughness | — | `public static ForgeTypeId DuctRoughness { get ; }` |
| Property | DuctTerminalEngagementLength | — | `public static ForgeTypeId DuctTerminalEngagementLength { get ; }` |
| Property | EdgeLinework | — | `public static ForgeTypeId EdgeLinework { get ; }` |
| Property | EditedBy | — | `public static ForgeTypeId EditedBy { get ; }` |
| Property | ElecticalEquipVoltage | — | `public static ForgeTypeId ElecticalEquipVoltage { get ; }` |
| Property | ElecticalEquipWattage | — | `public static ForgeTypeId ElecticalEquipWattage { get ; }` |
| Property | ElemCategoryParam | — | `public static ForgeTypeId ElemCategoryParam { get ; }` |
| Property | ElemCategoryParamMt | — | `public static ForgeTypeId ElemCategoryParamMt { get ; }` |
| Property | ElemDeletableInFamily | — | `public static ForgeTypeId ElemDeletableInFamily { get ; }` |
| Property | ElemFamilyAndTypeParam | — | `public static ForgeTypeId ElemFamilyAndTypeParam { get ; }` |
| Property | ElemFamilyParam | — | `public static ForgeTypeId ElemFamilyParam { get ; }` |
| Property | ElemIsReference | — | `public static ForgeTypeId ElemIsReference { get ; }` |
| Property | ElemPartitionParam | — | `public static ForgeTypeId ElemPartitionParam { get ; }` |
| Property | ElemReferenceName | — | `public static ForgeTypeId ElemReferenceName { get ; }` |
| Property | ElemReferenceName2dXz | — | `public static ForgeTypeId ElemReferenceName2dXz { get ; }` |
| Property | ElemRoomId | — | `public static ForgeTypeId ElemRoomId { get ; }` |
| Property | ElemRoomName | — | `public static ForgeTypeId ElemRoomName { get ; }` |
| Property | ElemRoomNumber | — | `public static ForgeTypeId ElemRoomNumber { get ; }` |
| Property | ElemTypeLabel | — | `public static ForgeTypeId ElemTypeLabel { get ; }` |
| Property | ElemTypeParam | — | `public static ForgeTypeId ElemTypeParam { get ; }` |
| Property | ElementIsCutting | — | `public static ForgeTypeId ElementIsCutting { get ; }` |
| Property | ElementLockedParam | — | `public static ForgeTypeId ElementLockedParam { get ; }` |
| Property | ElevArrowAngle | — | `public static ForgeTypeId ElevArrowAngle { get ; }` |
| Property | ElevArrowFilled | — | `public static ForgeTypeId ElevArrowFilled { get ; }` |
| Property | ElevAssocDatum | — | `public static ForgeTypeId ElevAssocDatum { get ; }` |
| Property | ElevReferenceLabelPos | — | `public static ForgeTypeId ElevReferenceLabelPos { get ; }` |
| Property | ElevShape | — | `public static ForgeTypeId ElevShape { get ; }` |
| Property | ElevShowViewName | — | `public static ForgeTypeId ElevShowViewName { get ; }` |
| Property | ElevSymbolId | — | `public static ForgeTypeId ElevSymbolId { get ; }` |
| Property | ElevTextPos | — | `public static ForgeTypeId ElevTextPos { get ; }` |
| Property | ElevViewNamePos | — | `public static ForgeTypeId ElevViewNamePos { get ; }` |
| Property | ElevWidth | — | `public static ForgeTypeId ElevWidth { get ; }` |
| Property | ElevatnTag | — | `public static ForgeTypeId ElevatnTag { get ; }` |
| Property | EllipseFocusMrkVisible | — | `public static ForgeTypeId EllipseFocusMrkVisible { get ; }` |
| Property | EllipseXParam | — | `public static ForgeTypeId EllipseXParam { get ; }` |
| Property | EllipseYParam | — | `public static ForgeTypeId EllipseYParam { get ; }` |
| Property | EndExtension | — | `public static ForgeTypeId EndExtension { get ; }` |
| Property | EndJoinCutback | — | `public static ForgeTypeId EndJoinCutback { get ; }` |
| Property | EndTreatment | — | `public static ForgeTypeId EndTreatment { get ; }` |
| Property | EndYJustification | — | `public static ForgeTypeId EndYJustification { get ; }` |
| Property | EndYOffsetValue | — | `public static ForgeTypeId EndYOffsetValue { get ; }` |
| Property | EndZJustification | — | `public static ForgeTypeId EndZJustification { get ; }` |
| Property | EndZOffsetValue | — | `public static ForgeTypeId EndZOffsetValue { get ; }` |
| Property | EnergyAnalysisAdvancedOptions | — | `public static ForgeTypeId EnergyAnalysisAdvancedOptions { get ; }` |
| Property | EnergyAnalysisBuildingOperatingSchedule | — | `public static ForgeTypeId EnergyAnalysisBuildingOperatingSchedule { get ; }` |
| Property | EnergyAnalysisConceptualConstruction | — | `public static ForgeTypeId EnergyAnalysisConceptualConstruction { get ; }` |
| Property | EnergyAnalysisCreateAnalyticalModel | — | `public static ForgeTypeId EnergyAnalysisCreateAnalyticalModel { get ; }` |
| Property | EnergyAnalysisCurrentViewOnly | — | `public static ForgeTypeId EnergyAnalysisCurrentViewOnly { get ; }` |
| Property | EnergyAnalysisGlazingIsShaded | — | `public static ForgeTypeId EnergyAnalysisGlazingIsShaded { get ; }` |
| Property | EnergyAnalysisHorizontalVoidThreshold | — | `public static ForgeTypeId EnergyAnalysisHorizontalVoidThreshold { get ; }` |
| Property | EnergyAnalysisHvacSystem | — | `public static ForgeTypeId EnergyAnalysisHvacSystem { get ; }` |
| Property | EnergyAnalysisMassZoning | — | `public static ForgeTypeId EnergyAnalysisMassZoning { get ; }` |
| Property | EnergyAnalysisMasszoneCoreoffset | — | `public static ForgeTypeId EnergyAnalysisMasszoneCoreoffset { get ; }` |
| Property | EnergyAnalysisMasszoneDivideperimeter | — | `public static ForgeTypeId EnergyAnalysisMasszoneDivideperimeter { get ; }` |
| Property | EnergyAnalysisMasszoneUseenergydatasettings | — | `public static ForgeTypeId EnergyAnalysisMasszoneUseenergydatasettings { get ; }` |
| Property | EnergyAnalysisOutdoorAirInformationParam | — | `public static ForgeTypeId EnergyAnalysisOutdoorAirInformationParam { get ; }` |
| Property | EnergyAnalysisPercentageGlazing | — | `public static ForgeTypeId EnergyAnalysisPercentageGlazing { get ; }` |
| Property | EnergyAnalysisPercentageSkylights | — | `public static ForgeTypeId EnergyAnalysisPercentageSkylights { get ; }` |
| Property | EnergyAnalysisProjectPhase | — | `public static ForgeTypeId EnergyAnalysisProjectPhase { get ; }` |
| Property | EnergyAnalysisShadeDepth | — | `public static ForgeTypeId EnergyAnalysisShadeDepth { get ; }` |
| Property | EnergyAnalysisSillHeight | — | `public static ForgeTypeId EnergyAnalysisSillHeight { get ; }` |
| Property | EnergyAnalysisSkylightWidth | — | `public static ForgeTypeId EnergyAnalysisSkylightWidth { get ; }` |
| Property | EnergyAnalysisSpaceBoundingParam | — | `public static ForgeTypeId EnergyAnalysisSpaceBoundingParam { get ; }` |
| Property | EnergyAnalysisVerticalVoidThreshold | — | `public static ForgeTypeId EnergyAnalysisVerticalVoidThreshold { get ; }` |
| Property | EqualityFormula | — | `public static ForgeTypeId EqualityFormula { get ; }` |
| Property | EqualityTextForAngularDim | — | `public static ForgeTypeId EqualityTextForAngularDim { get ; }` |
| Property | EqualityTextForContinuousLinearDim | — | `public static ForgeTypeId EqualityTextForContinuousLinearDim { get ; }` |
| Property | EqualityWitnessDisplay | — | `public static ForgeTypeId EqualityWitnessDisplay { get ; }` |
| Property | ExchangeEntityId | — | `public static ForgeTypeId ExchangeEntityId { get ; }` |
| Property | ExchangeId | — | `public static ForgeTypeId ExchangeId { get ; }` |
| Property | ExtrusionAutoParams | — | `public static ForgeTypeId ExtrusionAutoParams { get ; }` |
| Property | ExtrusionEndParam | — | `public static ForgeTypeId ExtrusionEndParam { get ; }` |
| Property | ExtrusionLength | — | `public static ForgeTypeId ExtrusionLength { get ; }` |
| Property | ExtrusionStartParam | — | `public static ForgeTypeId ExtrusionStartParam { get ; }` |
| Property | FabricBendDiameter | — | `public static ForgeTypeId FabricBendDiameter { get ; }` |
| Property | FabricNumber | — | `public static ForgeTypeId FabricNumber { get ; }` |
| Property | FabricParamCoverOffset | — | `public static ForgeTypeId FabricParamCoverOffset { get ; }` |
| Property | FabricParamCutByHost | — | `public static ForgeTypeId FabricParamCutByHost { get ; }` |
| Property | FabricParamCutOverallLength | — | `public static ForgeTypeId FabricParamCutOverallLength { get ; }` |
| Property | FabricParamCutOverallWidth | — | `public static ForgeTypeId FabricParamCutOverallWidth { get ; }` |
| Property | FabricParamCutSheetMass | — | `public static ForgeTypeId FabricParamCutSheetMass { get ; }` |
| Property | FabricParamLapsplicePosition | — | `public static ForgeTypeId FabricParamLapsplicePosition { get ; }` |
| Property | FabricParamLocationGeneric | — | `public static ForgeTypeId FabricParamLocationGeneric { get ; }` |
| Property | FabricParamLocationSlab | — | `public static ForgeTypeId FabricParamLocationSlab { get ; }` |
| Property | FabricParamLocationWall | — | `public static ForgeTypeId FabricParamLocationWall { get ; }` |
| Property | FabricParamMajorLapspliceLength | — | `public static ForgeTypeId FabricParamMajorLapspliceLength { get ; }` |
| Property | FabricParamMinorLapspliceLength | — | `public static ForgeTypeId FabricParamMinorLapspliceLength { get ; }` |
| Property | FabricParamRounding | — | `public static ForgeTypeId FabricParamRounding { get ; }` |
| Property | FabricParamSharedFamilyKey | — | `public static ForgeTypeId FabricParamSharedFamilyKey { get ; }` |
| Property | FabricParamSheetType | — | `public static ForgeTypeId FabricParamSheetType { get ; }` |
| Property | FabricParamSpanSymBottom | — | `public static ForgeTypeId FabricParamSpanSymBottom { get ; }` |
| Property | FabricParamSpanSymDBottom | — | `public static ForgeTypeId FabricParamSpanSymDBottom { get ; }` |
| Property | FabricParamSpanSymDLeft | — | `public static ForgeTypeId FabricParamSpanSymDLeft { get ; }` |
| Property | FabricParamSpanSymDRight | — | `public static ForgeTypeId FabricParamSpanSymDRight { get ; }` |
| Property | FabricParamSpanSymDTop | — | `public static ForgeTypeId FabricParamSpanSymDTop { get ; }` |
| Property | FabricParamSpanSymLeft | — | `public static ForgeTypeId FabricParamSpanSymLeft { get ; }` |
| Property | FabricParamSpanSymRight | — | `public static ForgeTypeId FabricParamSpanSymRight { get ; }` |
| Property | FabricParamSpanSymTop | — | `public static ForgeTypeId FabricParamSpanSymTop { get ; }` |
| Property | FabricParamSpanTagComponentReference | — | `public static ForgeTypeId FabricParamSpanTagComponentReference { get ; }` |
| Property | FabricParamTagView | — | `public static ForgeTypeId FabricParamTagView { get ; }` |
| Property | FabricParamTotalSheetMass | — | `public static ForgeTypeId FabricParamTotalSheetMass { get ; }` |
| Property | FabricSheetDefaultMajorLapspliceLength | — | `public static ForgeTypeId FabricSheetDefaultMajorLapspliceLength { get ; }` |
| Property | FabricSheetDefaultMinorLapspliceLength | — | `public static ForgeTypeId FabricSheetDefaultMinorLapspliceLength { get ; }` |
| Property | FabricSheetLength | — | `public static ForgeTypeId FabricSheetLength { get ; }` |
| Property | FabricSheetMajorDirectionWireType | — | `public static ForgeTypeId FabricSheetMajorDirectionWireType { get ; }` |
| Property | FabricSheetMajorEndOverhang | — | `public static ForgeTypeId FabricSheetMajorEndOverhang { get ; }` |
| Property | FabricSheetMajorLayoutPattern | — | `public static ForgeTypeId FabricSheetMajorLayoutPattern { get ; }` |
| Property | FabricSheetMajorNumberOfWires | — | `public static ForgeTypeId FabricSheetMajorNumberOfWires { get ; }` |
| Property | FabricSheetMajorReinforcementArea | — | `public static ForgeTypeId FabricSheetMajorReinforcementArea { get ; }` |
| Property | FabricSheetMajorSpacing | — | `public static ForgeTypeId FabricSheetMajorSpacing { get ; }` |
| Property | FabricSheetMajorStartOverhang | — | `public static ForgeTypeId FabricSheetMajorStartOverhang { get ; }` |
| Property | FabricSheetMass | — | `public static ForgeTypeId FabricSheetMass { get ; }` |
| Property | FabricSheetMassunit | — | `public static ForgeTypeId FabricSheetMassunit { get ; }` |
| Property | FabricSheetMinorDirectionWireType | — | `public static ForgeTypeId FabricSheetMinorDirectionWireType { get ; }` |
| Property | FabricSheetMinorEndOverhang | — | `public static ForgeTypeId FabricSheetMinorEndOverhang { get ; }` |
| Property | FabricSheetMinorLayoutPattern | — | `public static ForgeTypeId FabricSheetMinorLayoutPattern { get ; }` |
| Property | FabricSheetMinorNumberOfWires | — | `public static ForgeTypeId FabricSheetMinorNumberOfWires { get ; }` |
| Property | FabricSheetMinorReinforcementArea | — | `public static ForgeTypeId FabricSheetMinorReinforcementArea { get ; }` |
| Property | FabricSheetMinorSpacing | — | `public static ForgeTypeId FabricSheetMinorSpacing { get ; }` |
| Property | FabricSheetMinorStartOverhang | — | `public static ForgeTypeId FabricSheetMinorStartOverhang { get ; }` |
| Property | FabricSheetOverallLength | — | `public static ForgeTypeId FabricSheetOverallLength { get ; }` |
| Property | FabricSheetOverallWidth | — | `public static ForgeTypeId FabricSheetOverallWidth { get ; }` |
| Property | FabricSheetPhysicalMaterialAsset | — | `public static ForgeTypeId FabricSheetPhysicalMaterialAsset { get ; }` |
| Property | FabricSheetWidth | — | `public static ForgeTypeId FabricSheetWidth { get ; }` |
| Property | FabricWireDiameter | — | `public static ForgeTypeId FabricWireDiameter { get ; }` |
| Property | FabricWireDistance | — | `public static ForgeTypeId FabricWireDistance { get ; }` |
| Property | FabricWireLength | — | `public static ForgeTypeId FabricWireLength { get ; }` |
| Property | FabricWireOffset | — | `public static ForgeTypeId FabricWireOffset { get ; }` |
| Property | FabricWireType | — | `public static ForgeTypeId FabricWireType { get ; }` |
| Property | FabricationBottomElevationIncludeInsulationOfPart | — | `public static ForgeTypeId FabricationBottomElevationIncludeInsulationOfPart { get ; }` |
| Property | FabricationBottomElevationOfPart | — | `public static ForgeTypeId FabricationBottomElevationOfPart { get ; }` |
| Property | FabricationBottomOfPart | — | `public static ForgeTypeId FabricationBottomOfPart { get ; }` |
| Property | FabricationBranchSize | — | `public static ForgeTypeId FabricationBranchSize { get ; }` |
| Property | FabricationChangeServiceParam | — | `public static ForgeTypeId FabricationChangeServiceParam { get ; }` |
| Property | FabricationDoublewallMaterialAbbreviation | — | `public static ForgeTypeId FabricationDoublewallMaterialAbbreviation { get ; }` |
| Property | FabricationDuctworkStiffenerSpec | — | `public static ForgeTypeId FabricationDuctworkStiffenerSpec { get ; }` |
| Property | FabricationEndOffsetParam | — | `public static ForgeTypeId FabricationEndOffsetParam { get ; }` |
| Property | FabricationEndSize | — | `public static ForgeTypeId FabricationEndSize { get ; }` |
| Property | FabricationFittingDescription | — | `public static ForgeTypeId FabricationFittingDescription { get ; }` |
| Property | FabricationInsulationAbbreviation | — | `public static ForgeTypeId FabricationInsulationAbbreviation { get ; }` |
| Property | FabricationInsulationMaterialFinish | — | `public static ForgeTypeId FabricationInsulationMaterialFinish { get ; }` |
| Property | FabricationInsulationSpec | — | `public static ForgeTypeId FabricationInsulationSpec { get ; }` |
| Property | FabricationInsulationSpecificationAbbreviation | — | `public static ForgeTypeId FabricationInsulationSpecificationAbbreviation { get ; }` |
| Property | FabricationLevelParam | — | `public static ForgeTypeId FabricationLevelParam { get ; }` |
| Property | FabricationMaterialAbbreviation | — | `public static ForgeTypeId FabricationMaterialAbbreviation { get ; }` |
| Property | FabricationOffsetParam | — | `public static ForgeTypeId FabricationOffsetParam { get ; }` |
| Property | FabricationPartAlias | — | `public static ForgeTypeId FabricationPartAlias { get ; }` |
| Property | FabricationPartAngle | — | `public static ForgeTypeId FabricationPartAngle { get ; }` |
| Property | FabricationPartAngleOption | — | `public static ForgeTypeId FabricationPartAngleOption { get ; }` |
| Property | FabricationPartBoughtOut | — | `public static ForgeTypeId FabricationPartBoughtOut { get ; }` |
| Property | FabricationPartCutType | — | `public static ForgeTypeId FabricationPartCutType { get ; }` |
| Property | FabricationPartDepthIn | — | `public static ForgeTypeId FabricationPartDepthIn { get ; }` |
| Property | FabricationPartDepthInOption | — | `public static ForgeTypeId FabricationPartDepthInOption { get ; }` |
| Property | FabricationPartDepthOut | — | `public static ForgeTypeId FabricationPartDepthOut { get ; }` |
| Property | FabricationPartDepthOutOption | — | `public static ForgeTypeId FabricationPartDepthOutOption { get ; }` |
| Property | FabricationPartDiameterIn | — | `public static ForgeTypeId FabricationPartDiameterIn { get ; }` |
| Property | FabricationPartDiameterInOption | — | `public static ForgeTypeId FabricationPartDiameterInOption { get ; }` |
| Property | FabricationPartDiameterOut | — | `public static ForgeTypeId FabricationPartDiameterOut { get ; }` |
| Property | FabricationPartDiameterOutOption | — | `public static ForgeTypeId FabricationPartDiameterOutOption { get ; }` |
| Property | FabricationPartDoublewallMaterial | — | `public static ForgeTypeId FabricationPartDoublewallMaterial { get ; }` |
| Property | FabricationPartDoublewallMaterialArea | — | `public static ForgeTypeId FabricationPartDoublewallMaterialArea { get ; }` |
| Property | FabricationPartDoublewallMaterialThickness | — | `public static ForgeTypeId FabricationPartDoublewallMaterialThickness { get ; }` |
| Property | FabricationPartInsulationArea | — | `public static ForgeTypeId FabricationPartInsulationArea { get ; }` |
| Property | FabricationPartItemNumber | — | `public static ForgeTypeId FabricationPartItemNumber { get ; }` |
| Property | FabricationPartLength | — | `public static ForgeTypeId FabricationPartLength { get ; }` |
| Property | FabricationPartLengthOption | — | `public static ForgeTypeId FabricationPartLengthOption { get ; }` |
| Property | FabricationPartLiningArea | — | `public static ForgeTypeId FabricationPartLiningArea { get ; }` |
| Property | FabricationPartMaterial | — | `public static ForgeTypeId FabricationPartMaterial { get ; }` |
| Property | FabricationPartMaterialThickness | — | `public static ForgeTypeId FabricationPartMaterialThickness { get ; }` |
| Property | FabricationPartNotes | — | `public static ForgeTypeId FabricationPartNotes { get ; }` |
| Property | FabricationPartPatNo | — | `public static ForgeTypeId FabricationPartPatNo { get ; }` |
| Property | FabricationPartSheetmetalArea | — | `public static ForgeTypeId FabricationPartSheetmetalArea { get ; }` |
| Property | FabricationPartTakeoffDialogParam | — | `public static ForgeTypeId FabricationPartTakeoffDialogParam { get ; }` |
| Property | FabricationPartWeight | — | `public static ForgeTypeId FabricationPartWeight { get ; }` |
| Property | FabricationPartWidthIn | — | `public static ForgeTypeId FabricationPartWidthIn { get ; }` |
| Property | FabricationPartWidthInOption | — | `public static ForgeTypeId FabricationPartWidthInOption { get ; }` |
| Property | FabricationPartWidthOut | — | `public static ForgeTypeId FabricationPartWidthOut { get ; }` |
| Property | FabricationPartWidthOutOption | — | `public static ForgeTypeId FabricationPartWidthOutOption { get ; }` |
| Property | FabricationPipeInvertElevation | — | `public static ForgeTypeId FabricationPipeInvertElevation { get ; }` |
| Property | FabricationPrimarySize | — | `public static ForgeTypeId FabricationPrimarySize { get ; }` |
| Property | FabricationProductCode | — | `public static ForgeTypeId FabricationProductCode { get ; }` |
| Property | FabricationProductDataFinishDescription | — | `public static ForgeTypeId FabricationProductDataFinishDescription { get ; }` |
| Property | FabricationProductDataInstallType | — | `public static ForgeTypeId FabricationProductDataInstallType { get ; }` |
| Property | FabricationProductDataItemDescription | — | `public static ForgeTypeId FabricationProductDataItemDescription { get ; }` |
| Property | FabricationProductDataLongDescription | — | `public static ForgeTypeId FabricationProductDataLongDescription { get ; }` |
| Property | FabricationProductDataMaterialDescription | — | `public static ForgeTypeId FabricationProductDataMaterialDescription { get ; }` |
| Property | FabricationProductDataOem | — | `public static ForgeTypeId FabricationProductDataOem { get ; }` |
| Property | FabricationProductDataProduct | — | `public static ForgeTypeId FabricationProductDataProduct { get ; }` |
| Property | FabricationProductDataRange | — | `public static ForgeTypeId FabricationProductDataRange { get ; }` |
| Property | FabricationProductDataSizeDescription | — | `public static ForgeTypeId FabricationProductDataSizeDescription { get ; }` |
| Property | FabricationProductDataSpecification | — | `public static ForgeTypeId FabricationProductDataSpecification { get ; }` |
| Property | FabricationProductEntry | — | `public static ForgeTypeId FabricationProductEntry { get ; }` |
| Property | FabricationRelativeFilename | — | `public static ForgeTypeId FabricationRelativeFilename { get ; }` |
| Property | FabricationRoutingSolutionsUiParam | — | `public static ForgeTypeId FabricationRoutingSolutionsUiParam { get ; }` |
| Property | FabricationSecondarySize | — | `public static ForgeTypeId FabricationSecondarySize { get ; }` |
| Property | FabricationServiceAbbreviation | — | `public static ForgeTypeId FabricationServiceAbbreviation { get ; }` |
| Property | FabricationServiceName | — | `public static ForgeTypeId FabricationServiceName { get ; }` |
| Property | FabricationServiceParam | — | `public static ForgeTypeId FabricationServiceParam { get ; }` |
| Property | FabricationSetUpDownTag | — | `public static ForgeTypeId FabricationSetUpDownTag { get ; }` |
| Property | FabricationSetUpDownTagFromBottom | — | `public static ForgeTypeId FabricationSetUpDownTagFromBottom { get ; }` |
| Property | FabricationSlopeParam | — | `public static ForgeTypeId FabricationSlopeParam { get ; }` |
| Property | FabricationSpecification | — | `public static ForgeTypeId FabricationSpecification { get ; }` |
| Property | FabricationSpecificationAbbreviation | — | `public static ForgeTypeId FabricationSpecificationAbbreviation { get ; }` |
| Property | FabricationStartOffsetParam | — | `public static ForgeTypeId FabricationStartOffsetParam { get ; }` |
| Property | FabricationTopElevationIncludeInsulationOfPart | — | `public static ForgeTypeId FabricationTopElevationIncludeInsulationOfPart { get ; }` |
| Property | FabricationTopElevationOfPart | — | `public static ForgeTypeId FabricationTopElevationOfPart { get ; }` |
| Property | FabricationTopOfPart | — | `public static ForgeTypeId FabricationTopOfPart { get ; }` |
| Property | FabricationVendor | — | `public static ForgeTypeId FabricationVendor { get ; }` |
| Property | FabricationVendorCode | — | `public static ForgeTypeId FabricationVendorCode { get ; }` |
| Property | FaceroofLevelParam | — | `public static ForgeTypeId FaceroofLevelParam { get ; }` |
| Property | FaceroofOffsetParam | — | `public static ForgeTypeId FaceroofOffsetParam { get ; }` |
| Property | FamProfileDefinition | — | `public static ForgeTypeId FamProfileDefinition { get ; }` |
| Property | FamProfileUsage | — | `public static ForgeTypeId FamProfileUsage { get ; }` |
| Property | FamilyAllowCutWithVoids | — | `public static ForgeTypeId FamilyAllowCutWithVoids { get ; }` |
| Property | FamilyAlwaysVertical | — | `public static ForgeTypeId FamilyAlwaysVertical { get ; }` |
| Property | FamilyAutojoin | — | `public static ForgeTypeId FamilyAutojoin { get ; }` |
| Property | FamilyBaseLevelOffsetParam | — | `public static ForgeTypeId FamilyBaseLevelOffsetParam { get ; }` |
| Property | FamilyBaseLevelParam | — | `public static ForgeTypeId FamilyBaseLevelParam { get ; }` |
| Property | FamilyCanHostRebar | — | `public static ForgeTypeId FamilyCanHostRebar { get ; }` |
| Property | FamilyCategoryPseudoParam | — | `public static ForgeTypeId FamilyCategoryPseudoParam { get ; }` |
| Property | FamilyContentPartType | — | `public static ForgeTypeId FamilyContentPartType { get ; }` |
| Property | FamilyCurveAttachmentProportion | — | `public static ForgeTypeId FamilyCurveAttachmentProportion { get ; }` |
| Property | FamilyCurveGstyleFor2010Mass | — | `public static ForgeTypeId FamilyCurveGstyleFor2010Mass { get ; }` |
| Property | FamilyCurveGstylePlusInvisible | — | `public static ForgeTypeId FamilyCurveGstylePlusInvisible { get ; }` |
| Property | FamilyCurveGstylePlusInvisibleMinusAnalytical | — | `public static ForgeTypeId FamilyCurveGstylePlusInvisibleMinusAnalytical { get ; }` |
| Property | FamilyCurveGstylePlusInvisiblePlusStickSym | — | `public static ForgeTypeId FamilyCurveGstylePlusInvisiblePlusStickSym { get ; }` |
| Property | FamilyCurveGstylePlusInvisiblePlusStickSymMinusAnalytical | — | `public static ForgeTypeId FamilyCurveGstylePlusInvisiblePlusStickSymMinusAnalytical { get ; }` |
| Property | FamilyElectricalMaintainAnnotationOrientation | — | `public static ForgeTypeId FamilyElectricalMaintainAnnotationOrientation { get ; }` |
| Property | FamilyElemSubcategory | — | `public static ForgeTypeId FamilyElemSubcategory { get ; }` |
| Property | FamilyEnableCuttingInViews | — | `public static ForgeTypeId FamilyEnableCuttingInViews { get ; }` |
| Property | FamilyExportAsGeometry | — | `public static ForgeTypeId FamilyExportAsGeometry { get ; }` |
| Property | FamilyFreeinstDefaultElevation | — | `public static ForgeTypeId FamilyFreeinstDefaultElevation { get ; }` |
| Property | FamilyHeightParam | — | `public static ForgeTypeId FamilyHeightParam { get ; }` |
| Property | FamilyHostingBehavior | — | `public static ForgeTypeId FamilyHostingBehavior { get ; }` |
| Property | FamilyIsElevationMarkBody | — | `public static ForgeTypeId FamilyIsElevationMarkBody { get ; }` |
| Property | FamilyIsParametric | — | `public static ForgeTypeId FamilyIsParametric { get ; }` |
| Property | FamilyKeepTextReadable | — | `public static ForgeTypeId FamilyKeepTextReadable { get ; }` |
| Property | FamilyKeyExtParam | — | `public static ForgeTypeId FamilyKeyExtParam { get ; }` |
| Property | FamilyKeywordProtected | — | `public static ForgeTypeId FamilyKeywordProtected { get ; }` |
| Property | FamilyLevelParam | — | `public static ForgeTypeId FamilyLevelParam { get ; }` |
| Property | FamilyLineLengthParam | — | `public static ForgeTypeId FamilyLineLengthParam { get ; }` |
| Property | FamilyNamePseudoParam | — | `public static ForgeTypeId FamilyNamePseudoParam { get ; }` |
| Property | FamilyRenderingType | — | `public static ForgeTypeId FamilyRenderingType { get ; }` |
| Property | FamilyRfaPathPseudoParam | — | `public static ForgeTypeId FamilyRfaPathPseudoParam { get ; }` |
| Property | FamilyRotateTextWithComponent | — | `public static ForgeTypeId FamilyRotateTextWithComponent { get ; }` |
| Property | FamilyRotateWithComponent | — | `public static ForgeTypeId FamilyRotateWithComponent { get ; }` |
| Property | FamilyRoughHeightParam | — | `public static ForgeTypeId FamilyRoughHeightParam { get ; }` |
| Property | FamilyRoughWidthParam | — | `public static ForgeTypeId FamilyRoughWidthParam { get ; }` |
| Property | FamilyRoundconnectorDimensiontype | — | `public static ForgeTypeId FamilyRoundconnectorDimensiontype { get ; }` |
| Property | FamilySelfOrienting | — | `public static ForgeTypeId FamilySelfOrienting { get ; }` |
| Property | FamilyShared | — | `public static ForgeTypeId FamilyShared { get ; }` |
| Property | FamilyStructFootingUseCapTop | — | `public static ForgeTypeId FamilyStructFootingUseCapTop { get ; }` |
| Property | FamilyStructMaterialType | — | `public static ForgeTypeId FamilyStructMaterialType { get ; }` |
| Property | FamilySymbolicRep | — | `public static ForgeTypeId FamilySymbolicRep { get ; }` |
| Property | FamilyThicknessParam | — | `public static ForgeTypeId FamilyThicknessParam { get ; }` |
| Property | FamilyTopLevelOffsetParam | — | `public static ForgeTypeId FamilyTopLevelOffsetParam { get ; }` |
| Property | FamilyTopLevelParam | — | `public static ForgeTypeId FamilyTopLevelParam { get ; }` |
| Property | FamilyUsagePseudoParam | — | `public static ForgeTypeId FamilyUsagePseudoParam { get ; }` |
| Property | FamilyUsePrecutShape | — | `public static ForgeTypeId FamilyUsePrecutShape { get ; }` |
| Property | FamilyWidthParam | — | `public static ForgeTypeId FamilyWidthParam { get ; }` |
| Property | FamilyWindowInsetParam | — | `public static ForgeTypeId FamilyWindowInsetParam { get ; }` |
| Property | FamilyWorkPlaneBased | — | `public static ForgeTypeId FamilyWorkPlaneBased { get ; }` |
| Property | FamilyWpbDefaultElevation | — | `public static ForgeTypeId FamilyWpbDefaultElevation { get ; }` |
| Property | FasciaDepthParam | — | `public static ForgeTypeId FasciaDepthParam { get ; }` |
| Property | FasciaMaterialParam | — | `public static ForgeTypeId FasciaMaterialParam { get ; }` |
| Property | FasciaProfileParam | — | `public static ForgeTypeId FasciaProfileParam { get ; }` |
| Property | FbxAssetType | — | `public static ForgeTypeId FbxAssetType { get ; }` |
| Property | FbxLightAtADistance | — | `public static ForgeTypeId FbxLightAtADistance { get ; }` |
| Property | FbxLightBallastLoss | — | `public static ForgeTypeId FbxLightBallastLoss { get ; }` |
| Property | FbxLightColorFilter | — | `public static ForgeTypeId FbxLightColorFilter { get ; }` |
| Property | FbxLightDimmingLightColor | — | `public static ForgeTypeId FbxLightDimmingLightColor { get ; }` |
| Property | FbxLightEfficacy | — | `public static ForgeTypeId FbxLightEfficacy { get ; }` |
| Property | FbxLightEmitCircleDiameter | — | `public static ForgeTypeId FbxLightEmitCircleDiameter { get ; }` |
| Property | FbxLightEmitLineLength | — | `public static ForgeTypeId FbxLightEmitLineLength { get ; }` |
| Property | FbxLightEmitRectangleLength | — | `public static ForgeTypeId FbxLightEmitRectangleLength { get ; }` |
| Property | FbxLightEmitRectangleWidth | — | `public static ForgeTypeId FbxLightEmitRectangleWidth { get ; }` |
| Property | FbxLightEmitShapeVisible | — | `public static ForgeTypeId FbxLightEmitShapeVisible { get ; }` |
| Property | FbxLightIlluminance | — | `public static ForgeTypeId FbxLightIlluminance { get ; }` |
| Property | FbxLightInitialColorCtrl | — | `public static ForgeTypeId FbxLightInitialColorCtrl { get ; }` |
| Property | FbxLightInitialColorName | — | `public static ForgeTypeId FbxLightInitialColorName { get ; }` |
| Property | FbxLightInitialColorTemperature | — | `public static ForgeTypeId FbxLightInitialColorTemperature { get ; }` |
| Property | FbxLightInitialIntensity | — | `public static ForgeTypeId FbxLightInitialIntensity { get ; }` |
| Property | FbxLightInitialIntensityInputMethod | — | `public static ForgeTypeId FbxLightInitialIntensityInputMethod { get ; }` |
| Property | FbxLightLampLumenDepr | — | `public static ForgeTypeId FbxLightLampLumenDepr { get ; }` |
| Property | FbxLightLampTiltLoss | — | `public static ForgeTypeId FbxLightLampTiltLoss { get ; }` |
| Property | FbxLightLimunousFlux | — | `public static ForgeTypeId FbxLightLimunousFlux { get ; }` |
| Property | FbxLightLimunousIntensity | — | `public static ForgeTypeId FbxLightLimunousIntensity { get ; }` |
| Property | FbxLightLossFactorCtrl | — | `public static ForgeTypeId FbxLightLossFactorCtrl { get ; }` |
| Property | FbxLightLossFactorMethod | — | `public static ForgeTypeId FbxLightLossFactorMethod { get ; }` |
| Property | FbxLightLumenaireDirt | — | `public static ForgeTypeId FbxLightLumenaireDirt { get ; }` |
| Property | FbxLightPhotometricFile | — | `public static ForgeTypeId FbxLightPhotometricFile { get ; }` |
| Property | FbxLightPhotometricFileCache | — | `public static ForgeTypeId FbxLightPhotometricFileCache { get ; }` |
| Property | FbxLightPhotometrics | — | `public static ForgeTypeId FbxLightPhotometrics { get ; }` |
| Property | FbxLightPhotometricsFam | — | `public static ForgeTypeId FbxLightPhotometricsFam { get ; }` |
| Property | FbxLightSourceDiameter | — | `public static ForgeTypeId FbxLightSourceDiameter { get ; }` |
| Property | FbxLightSourceLength | — | `public static ForgeTypeId FbxLightSourceLength { get ; }` |
| Property | FbxLightSpotBeamAngle | — | `public static ForgeTypeId FbxLightSpotBeamAngle { get ; }` |
| Property | FbxLightSpotFieldAngle | — | `public static ForgeTypeId FbxLightSpotFieldAngle { get ; }` |
| Property | FbxLightSpotTiltAngle | — | `public static ForgeTypeId FbxLightSpotTiltAngle { get ; }` |
| Property | FbxLightSurfaceLoss | — | `public static ForgeTypeId FbxLightSurfaceLoss { get ; }` |
| Property | FbxLightTemperatureLoss | — | `public static ForgeTypeId FbxLightTemperatureLoss { get ; }` |
| Property | FbxLightTotalLightLoss | — | `public static ForgeTypeId FbxLightTotalLightLoss { get ; }` |
| Property | FbxLightVoltageLoss | — | `public static ForgeTypeId FbxLightVoltageLoss { get ; }` |
| Property | FbxLightWattage | — | `public static ForgeTypeId FbxLightWattage { get ; }` |
| Property | FillPatternIdParam | — | `public static ForgeTypeId FillPatternIdParam { get ; }` |
| Property | FillPatternIdParamNoNo | — | `public static ForgeTypeId FillPatternIdParamNoNo { get ; }` |
| Property | FilledRegionMasking | — | `public static ForgeTypeId FilledRegionMasking { get ; }` |
| Property | FireRating | — | `public static ForgeTypeId FireRating { get ; }` |
| Property | FixedRotation | — | `public static ForgeTypeId FixedRotation { get ; }` |
| Property | FlexibleInstanceFlip | — | `public static ForgeTypeId FlexibleInstanceFlip { get ; }` |
| Property | FloorAttrDefaultHeightParam | — | `public static ForgeTypeId FloorAttrDefaultHeightParam { get ; }` |
| Property | FloorAttrDefaultThicknessParam | — | `public static ForgeTypeId FloorAttrDefaultThicknessParam { get ; }` |
| Property | FloorAttrThicknessParam | — | `public static ForgeTypeId FloorAttrThicknessParam { get ; }` |
| Property | FloorHeightabovelevelParam | — | `public static ForgeTypeId FloorHeightabovelevelParam { get ; }` |
| Property | FloorParamIsStructural | — | `public static ForgeTypeId FloorParamIsStructural { get ; }` |
| Property | FloorParamSpanDirection | — | `public static ForgeTypeId FloorParamSpanDirection { get ; }` |
| Property | FloorStructureIdParam | — | `public static ForgeTypeId FloorStructureIdParam { get ; }` |
| Property | FollowSurface | — | `public static ForgeTypeId FollowSurface { get ; }` |
| Property | ForegroundAnyPatternIdParam | — | `public static ForgeTypeId ForegroundAnyPatternIdParam { get ; }` |
| Property | ForegroundDraftPatternIdParam | — | `public static ForgeTypeId ForegroundDraftPatternIdParam { get ; }` |
| Property | ForegroundPatternColorParam | — | `public static ForgeTypeId ForegroundPatternColorParam { get ; }` |
| Property | FramingLengthRoundoff | — | `public static ForgeTypeId FramingLengthRoundoff { get ; }` |
| Property | FramingShapeClassification | — | `public static ForgeTypeId FramingShapeClassification { get ; }` |
| Property | FrictionFactor | — | `public static ForgeTypeId FrictionFactor { get ; }` |
| Property | FunctionParam | — | `public static ForgeTypeId FunctionParam { get ; }` |
| Property | GbxmlEditDataParam | — | `public static ForgeTypeId GbxmlEditDataParam { get ; }` |
| Property | GenericDepth | — | `public static ForgeTypeId GenericDepth { get ; }` |
| Property | GenericZoneName | — | `public static ForgeTypeId GenericZoneName { get ; }` |
| Property | GeoLocation | — | `public static ForgeTypeId GeoLocation { get ; }` |
| Property | GeomVisibilityParam | — | `public static ForgeTypeId GeomVisibilityParam { get ; }` |
| Property | GraphicDisplayOptions | — | `public static ForgeTypeId GraphicDisplayOptions { get ; }` |
| Property | GraphicDisplayOptionsBackground | — | `public static ForgeTypeId GraphicDisplayOptionsBackground { get ; }` |
| Property | GraphicDisplayOptionsFog | — | `public static ForgeTypeId GraphicDisplayOptionsFog { get ; }` |
| Property | GraphicDisplayOptionsLighting | — | `public static ForgeTypeId GraphicDisplayOptionsLighting { get ; }` |
| Property | GraphicDisplayOptionsModel | — | `public static ForgeTypeId GraphicDisplayOptionsModel { get ; }` |
| Property | GraphicDisplayOptionsPhotoExposure | — | `public static ForgeTypeId GraphicDisplayOptionsPhotoExposure { get ; }` |
| Property | GraphicDisplayOptionsShadows | — | `public static ForgeTypeId GraphicDisplayOptionsShadows { get ; }` |
| Property | GraphicDisplayOptionsSketchyLines | — | `public static ForgeTypeId GraphicDisplayOptionsSketchyLines { get ; }` |
| Property | GraphicDisplayOptionsSsIntensity | — | `public static ForgeTypeId GraphicDisplayOptionsSsIntensity { get ; }` |
| Property | GridBankColNum | — | `public static ForgeTypeId GridBankColNum { get ; }` |
| Property | GridBankColWidth | — | `public static ForgeTypeId GridBankColWidth { get ; }` |
| Property | GridBankRowHeight | — | `public static ForgeTypeId GridBankRowHeight { get ; }` |
| Property | GridBankRowNum | — | `public static ForgeTypeId GridBankRowNum { get ; }` |
| Property | GridBubbleEndn1 | — | `public static ForgeTypeId GridBubbleEndn1 { get ; }` |
| Property | GridBubbleEndn2 | — | `public static ForgeTypeId GridBubbleEndn2 { get ; }` |
| Property | GridBubbleLinePen | — | `public static ForgeTypeId GridBubbleLinePen { get ; }` |
| Property | GridCenterSegmentColor | — | `public static ForgeTypeId GridCenterSegmentColor { get ; }` |
| Property | GridCenterSegmentPattern | — | `public static ForgeTypeId GridCenterSegmentPattern { get ; }` |
| Property | GridCenterSegmentStyle | — | `public static ForgeTypeId GridCenterSegmentStyle { get ; }` |
| Property | GridCenterSegmentWeight | — | `public static ForgeTypeId GridCenterSegmentWeight { get ; }` |
| Property | GridEndSegmentColor | — | `public static ForgeTypeId GridEndSegmentColor { get ; }` |
| Property | GridEndSegmentPattern | — | `public static ForgeTypeId GridEndSegmentPattern { get ; }` |
| Property | GridEndSegmentWeight | — | `public static ForgeTypeId GridEndSegmentWeight { get ; }` |
| Property | GridEndSegmentsLength | — | `public static ForgeTypeId GridEndSegmentsLength { get ; }` |
| Property | GridHeadTag | — | `public static ForgeTypeId GridHeadTag { get ; }` |
| Property | GridNetLocationMark | — | `public static ForgeTypeId GridNetLocationMark { get ; }` |
| Property | GridlineSpecStatus | — | `public static ForgeTypeId GridlineSpecStatus { get ; }` |
| Property | GroupAllowedViewTypes | — | `public static ForgeTypeId GroupAllowedViewTypes { get ; }` |
| Property | GroupAttachedParentName | — | `public static ForgeTypeId GroupAttachedParentName { get ; }` |
| Property | GroupLevel | — | `public static ForgeTypeId GroupLevel { get ; }` |
| Property | GroupOffsetFromLevel | — | `public static ForgeTypeId GroupOffsetFromLevel { get ; }` |
| Property | GroupnameParam | — | `public static ForgeTypeId GroupnameParam { get ; }` |
| Property | GuideGridNameParam | — | `public static ForgeTypeId GuideGridNameParam { get ; }` |
| Property | GuideGridSpacingParam | — | `public static ForgeTypeId GuideGridSpacingParam { get ; }` |
| Property | GutterMaterialParam | — | `public static ForgeTypeId GutterMaterialParam { get ; }` |
| Property | GutterProfileParam | — | `public static ForgeTypeId GutterProfileParam { get ; }` |
| Property | HandrailHandClearanceParam | — | `public static ForgeTypeId HandrailHandClearanceParam { get ; }` |
| Property | HandrailHeightParam | — | `public static ForgeTypeId HandrailHeightParam { get ; }` |
| Property | HandrailProjectionParam | — | `public static ForgeTypeId HandrailProjectionParam { get ; }` |
| Property | HandrailSupportsJustificationParam | — | `public static ForgeTypeId HandrailSupportsJustificationParam { get ; }` |
| Property | HandrailSupportsLayoutParam | — | `public static ForgeTypeId HandrailSupportsLayoutParam { get ; }` |
| Property | HandrailSupportsNumberParam | — | `public static ForgeTypeId HandrailSupportsNumberParam { get ; }` |
| Property | HandrailSupportsSpacingParam | — | `public static ForgeTypeId HandrailSupportsSpacingParam { get ; }` |
| Property | HandrailSupportsTypeParam | — | `public static ForgeTypeId HandrailSupportsTypeParam { get ; }` |
| Property | HeadOnPlacementMethod | — | `public static ForgeTypeId HeadOnPlacementMethod { get ; }` |
| Property | HeavyEndPen | — | `public static ForgeTypeId HeavyEndPen { get ; }` |
| Property | HeavyTickMarkPen | — | `public static ForgeTypeId HeavyTickMarkPen { get ; }` |
| Property | HighestAssociatedLevel | — | `public static ForgeTypeId HighestAssociatedLevel { get ; }` |
| Property | HostAreaComputed | — | `public static ForgeTypeId HostAreaComputed { get ; }` |
| Property | HostIdParam | — | `public static ForgeTypeId HostIdParam { get ; }` |
| Property | HostPanelScheduleAsPanelParam | — | `public static ForgeTypeId HostPanelScheduleAsPanelParam { get ; }` |
| Property | HostPerimeterComputed | — | `public static ForgeTypeId HostPerimeterComputed { get ; }` |
| Property | HostSseCurvedEdgeConditionParam | — | `public static ForgeTypeId HostSseCurvedEdgeConditionParam { get ; }` |
| Property | HostVolumeComputed | — | `public static ForgeTypeId HostVolumeComputed { get ; }` |
| Property | IconIndexParam | — | `public static ForgeTypeId IconIndexParam { get ; }` |
| Property | IdParam | — | `public static ForgeTypeId IdParam { get ; }` |
| Property | IfcApplicationName | — | `public static ForgeTypeId IfcApplicationName { get ; }` |
| Property | IfcApplicationVersion | — | `public static ForgeTypeId IfcApplicationVersion { get ; }` |
| Property | IfcBuildingGuid | — | `public static ForgeTypeId IfcBuildingGuid { get ; }` |
| Property | IfcExportElement | — | `public static ForgeTypeId IfcExportElement { get ; }` |
| Property | IfcExportElementAs | — | `public static ForgeTypeId IfcExportElementAs { get ; }` |
| Property | IfcExportElementType | — | `public static ForgeTypeId IfcExportElementType { get ; }` |
| Property | IfcExportElementTypeAs | — | `public static ForgeTypeId IfcExportElementTypeAs { get ; }` |
| Property | IfcExportPredefinedtype | — | `public static ForgeTypeId IfcExportPredefinedtype { get ; }` |
| Property | IfcExportPredefinedtypeType | — | `public static ForgeTypeId IfcExportPredefinedtypeType { get ; }` |
| Property | IfcGuid | — | `public static ForgeTypeId IfcGuid { get ; }` |
| Property | IfcOrganization | — | `public static ForgeTypeId IfcOrganization { get ; }` |
| Property | IfcProjectGuid | — | `public static ForgeTypeId IfcProjectGuid { get ; }` |
| Property | IfcSiteGuid | — | `public static ForgeTypeId IfcSiteGuid { get ; }` |
| Property | IfcTypeGuid | — | `public static ForgeTypeId IfcTypeGuid { get ; }` |
| Property | ImportAdtComponentsDesc | — | `public static ForgeTypeId ImportAdtComponentsDesc { get ; }` |
| Property | ImportAdtEntityHeight | — | `public static ForgeTypeId ImportAdtEntityHeight { get ; }` |
| Property | ImportAdtEntityLength | — | `public static ForgeTypeId ImportAdtEntityLength { get ; }` |
| Property | ImportAdtEntityRoll | — | `public static ForgeTypeId ImportAdtEntityRoll { get ; }` |
| Property | ImportAdtEntityStructType | — | `public static ForgeTypeId ImportAdtEntityStructType { get ; }` |
| Property | ImportAdtEntityStyle | — | `public static ForgeTypeId ImportAdtEntityStyle { get ; }` |
| Property | ImportAdtEntityThickness | — | `public static ForgeTypeId ImportAdtEntityThickness { get ; }` |
| Property | ImportAdtEntityType | — | `public static ForgeTypeId ImportAdtEntityType { get ; }` |
| Property | ImportAdtEntityWidth | — | `public static ForgeTypeId ImportAdtEntityWidth { get ; }` |
| Property | ImportBackground | — | `public static ForgeTypeId ImportBackground { get ; }` |
| Property | ImportBaseLevel | — | `public static ForgeTypeId ImportBaseLevel { get ; }` |
| Property | ImportBaseLevelOffset | — | `public static ForgeTypeId ImportBaseLevelOffset { get ; }` |
| Property | ImportDisplayUnits | — | `public static ForgeTypeId ImportDisplayUnits { get ; }` |
| Property | ImportInstanceCuttingInView | — | `public static ForgeTypeId ImportInstanceCuttingInView { get ; }` |
| Property | ImportInstanceScale | — | `public static ForgeTypeId ImportInstanceScale { get ; }` |
| Property | ImportScale | — | `public static ForgeTypeId ImportScale { get ; }` |
| Property | ImportSymbolName | — | `public static ForgeTypeId ImportSymbolName { get ; }` |
| Property | InfrastructureAlignmentDescription | — | `public static ForgeTypeId InfrastructureAlignmentDescription { get ; }` |
| Property | InfrastructureAlignmentDisplayedEndStation | — | `public static ForgeTypeId InfrastructureAlignmentDisplayedEndStation { get ; }` |
| Property | InfrastructureAlignmentDisplayedStartStation | — | `public static ForgeTypeId InfrastructureAlignmentDisplayedStartStation { get ; }` |
| Property | InfrastructureAlignmentName | — | `public static ForgeTypeId InfrastructureAlignmentName { get ; }` |
| Property | InsertOrientation | — | `public static ForgeTypeId InsertOrientation { get ; }` |
| Property | InstanceElevationParam | — | `public static ForgeTypeId InstanceElevationParam { get ; }` |
| Property | InstanceFreeHostOffsetParam | — | `public static ForgeTypeId InstanceFreeHostOffsetParam { get ; }` |
| Property | InstanceFreeHostParam | — | `public static ForgeTypeId InstanceFreeHostParam { get ; }` |
| Property | InstanceHeadHeightParam | — | `public static ForgeTypeId InstanceHeadHeightParam { get ; }` |
| Property | InstanceLengthParam | — | `public static ForgeTypeId InstanceLengthParam { get ; }` |
| Property | InstanceMoveBaseWithGrids | — | `public static ForgeTypeId InstanceMoveBaseWithGrids { get ; }` |
| Property | InstanceMoveTopWithGrids | — | `public static ForgeTypeId InstanceMoveTopWithGrids { get ; }` |
| Property | InstanceMovesWithGridParam | — | `public static ForgeTypeId InstanceMovesWithGridParam { get ; }` |
| Property | InstanceOffsetPosParam | — | `public static ForgeTypeId InstanceOffsetPosParam { get ; }` |
| Property | InstanceReferenceLevelParam | — | `public static ForgeTypeId InstanceReferenceLevelParam { get ; }` |
| Property | InstanceScheduleOnlyLevelParam | — | `public static ForgeTypeId InstanceScheduleOnlyLevelParam { get ; }` |
| Property | InstanceSillHeightParam | — | `public static ForgeTypeId InstanceSillHeightParam { get ; }` |
| Property | InstanceStructUsageParam | — | `public static ForgeTypeId InstanceStructUsageParam { get ; }` |
| Property | InsulationScale | — | `public static ForgeTypeId InsulationScale { get ; }` |
| Property | InsulationWidth | — | `public static ForgeTypeId InsulationWidth { get ; }` |
| Property | InteriorTickDisplay | — | `public static ForgeTypeId InteriorTickDisplay { get ; }` |
| Property | IsVisibleParam | — | `public static ForgeTypeId IsVisibleParam { get ; }` |
| Property | JoinStrengthOrder | — | `public static ForgeTypeId JoinStrengthOrder { get ; }` |
| Property | JoistSystemClearSpacingParam | — | `public static ForgeTypeId JoistSystemClearSpacingParam { get ; }` |
| Property | JoistSystemElemTagNewMembersView | — | `public static ForgeTypeId JoistSystemElemTagNewMembersView { get ; }` |
| Property | JoistSystemFixedSpacingParam | — | `public static ForgeTypeId JoistSystemFixedSpacingParam { get ; }` |
| Property | JoistSystemJustificationParam | — | `public static ForgeTypeId JoistSystemJustificationParam { get ; }` |
| Property | JoistSystemLayoutRuleParam | — | `public static ForgeTypeId JoistSystemLayoutRuleParam { get ; }` |
| Property | JoistSystemMaximumSpacingParam | — | `public static ForgeTypeId JoistSystemMaximumSpacingParam { get ; }` |
| Property | JoistSystemNewBeamTypeNoFamNameParam | — | `public static ForgeTypeId JoistSystemNewBeamTypeNoFamNameParam { get ; }` |
| Property | JoistSystemNewBeamTypeParam | — | `public static ForgeTypeId JoistSystemNewBeamTypeParam { get ; }` |
| Property | JoistSystemNumBeamsSameType | — | `public static ForgeTypeId JoistSystemNumBeamsSameType { get ; }` |
| Property | JoistSystemNumberOfLinesParam | — | `public static ForgeTypeId JoistSystemNumberOfLinesParam { get ; }` |
| Property | JoistSystemSpacingParam | — | `public static ForgeTypeId JoistSystemSpacingParam { get ; }` |
| Property | KeepReadable | — | `public static ForgeTypeId KeepReadable { get ; }` |
| Property | KeySourceParam | — | `public static ForgeTypeId KeySourceParam { get ; }` |
| Property | KeyValue | — | `public static ForgeTypeId KeyValue { get ; }` |
| Property | KeynoteNumber | — | `public static ForgeTypeId KeynoteNumber { get ; }` |
| Property | KeynoteParam | — | `public static ForgeTypeId KeynoteParam { get ; }` |
| Property | KeynoteText | — | `public static ForgeTypeId KeynoteText { get ; }` |
| Property | LayerElemAreaComputed | — | `public static ForgeTypeId LayerElemAreaComputed { get ; }` |
| Property | LayerElemBaseConstraint | — | `public static ForgeTypeId LayerElemBaseConstraint { get ; }` |
| Property | LayerElemBaseExtensionDis | — | `public static ForgeTypeId LayerElemBaseExtensionDis { get ; }` |
| Property | LayerElemCompoundElemFamily | — | `public static ForgeTypeId LayerElemCompoundElemFamily { get ; }` |
| Property | LayerElemCompoundElemType | — | `public static ForgeTypeId LayerElemCompoundElemType { get ; }` |
| Property | LayerElemFunction | — | `public static ForgeTypeId LayerElemFunction { get ; }` |
| Property | LayerElemIsCoreLayer | — | `public static ForgeTypeId LayerElemIsCoreLayer { get ; }` |
| Property | LayerElemIsStructuralMaterial | — | `public static ForgeTypeId LayerElemIsStructuralMaterial { get ; }` |
| Property | LayerElemIsVariable | — | `public static ForgeTypeId LayerElemIsVariable { get ; }` |
| Property | LayerElemMaterials | — | `public static ForgeTypeId LayerElemMaterials { get ; }` |
| Property | LayerElemOffsetFromHost | — | `public static ForgeTypeId LayerElemOffsetFromHost { get ; }` |
| Property | LayerElemScheduleFamily | — | `public static ForgeTypeId LayerElemScheduleFamily { get ; }` |
| Property | LayerElemThickness | — | `public static ForgeTypeId LayerElemThickness { get ; }` |
| Property | LayerElemTopConstraint | — | `public static ForgeTypeId LayerElemTopConstraint { get ; }` |
| Property | LayerElemTopExtensionDis | — | `public static ForgeTypeId LayerElemTopExtensionDis { get ; }` |
| Property | LayerElemVolumeComputed | — | `public static ForgeTypeId LayerElemVolumeComputed { get ; }` |
| Property | LayerTypeMaterials | — | `public static ForgeTypeId LayerTypeMaterials { get ; }` |
| Property | LayerTypeThickness | — | `public static ForgeTypeId LayerTypeThickness { get ; }` |
| Property | LayoutnodeCurvetypeParam | — | `public static ForgeTypeId LayoutnodeCurvetypeParam { get ; }` |
| Property | LeaderArrowWidth | — | `public static ForgeTypeId LeaderArrowWidth { get ; }` |
| Property | LeaderArrowhead | — | `public static ForgeTypeId LeaderArrowhead { get ; }` |
| Property | LeaderLeftAttachment | — | `public static ForgeTypeId LeaderLeftAttachment { get ; }` |
| Property | LeaderLine | — | `public static ForgeTypeId LeaderLine { get ; }` |
| Property | LeaderOffsetSheet | — | `public static ForgeTypeId LeaderOffsetSheet { get ; }` |
| Property | LeaderRightAttachment | — | `public static ForgeTypeId LeaderRightAttachment { get ; }` |
| Property | LegendComponent | — | `public static ForgeTypeId LegendComponent { get ; }` |
| Property | LegendComponentDetailLevel | — | `public static ForgeTypeId LegendComponentDetailLevel { get ; }` |
| Property | LegendComponentLength | — | `public static ForgeTypeId LegendComponentLength { get ; }` |
| Property | LegendComponentView | — | `public static ForgeTypeId LegendComponentView { get ; }` |
| Property | LevelAttrRoomComputationAutomatic | — | `public static ForgeTypeId LevelAttrRoomComputationAutomatic { get ; }` |
| Property | LevelAttrRoomComputationHeight | — | `public static ForgeTypeId LevelAttrRoomComputationHeight { get ; }` |
| Property | LevelDataFloorArea | — | `public static ForgeTypeId LevelDataFloorArea { get ; }` |
| Property | LevelDataFloorPerimeter | — | `public static ForgeTypeId LevelDataFloorPerimeter { get ; }` |
| Property | LevelDataMassFamilyAndTypeParam | — | `public static ForgeTypeId LevelDataMassFamilyAndTypeParam { get ; }` |
| Property | LevelDataMassFamilyParam | — | `public static ForgeTypeId LevelDataMassFamilyParam { get ; }` |
| Property | LevelDataMassInstanceComments | — | `public static ForgeTypeId LevelDataMassInstanceComments { get ; }` |
| Property | LevelDataMassTypeComments | — | `public static ForgeTypeId LevelDataMassTypeComments { get ; }` |
| Property | LevelDataMassTypeDescription | — | `public static ForgeTypeId LevelDataMassTypeDescription { get ; }` |
| Property | LevelDataMassTypeParam | — | `public static ForgeTypeId LevelDataMassTypeParam { get ; }` |
| Property | LevelDataOwningLevel | — | `public static ForgeTypeId LevelDataOwningLevel { get ; }` |
| Property | LevelDataSpaceUsage | — | `public static ForgeTypeId LevelDataSpaceUsage { get ; }` |
| Property | LevelDataSurfaceArea | — | `public static ForgeTypeId LevelDataSurfaceArea { get ; }` |
| Property | LevelDataVolume | — | `public static ForgeTypeId LevelDataVolume { get ; }` |
| Property | LevelElev | — | `public static ForgeTypeId LevelElev { get ; }` |
| Property | LevelHeadTag | — | `public static ForgeTypeId LevelHeadTag { get ; }` |
| Property | LevelIsBuildingStory | — | `public static ForgeTypeId LevelIsBuildingStory { get ; }` |
| Property | LevelIsGroundPlane | — | `public static ForgeTypeId LevelIsGroundPlane { get ; }` |
| Property | LevelIsStructural | — | `public static ForgeTypeId LevelIsStructural { get ; }` |
| Property | LevelName | — | `public static ForgeTypeId LevelName { get ; }` |
| Property | LevelParam | — | `public static ForgeTypeId LevelParam { get ; }` |
| Property | LevelRelativeBaseType | — | `public static ForgeTypeId LevelRelativeBaseType { get ; }` |
| Property | LevelRoomComputationHeight | — | `public static ForgeTypeId LevelRoomComputationHeight { get ; }` |
| Property | LevelUpToLevel | — | `public static ForgeTypeId LevelUpToLevel { get ; }` |
| Property | LightingFixtureLamp | — | `public static ForgeTypeId LightingFixtureLamp { get ; }` |
| Property | LightingFixtureLightEmitter | — | `public static ForgeTypeId LightingFixtureLightEmitter { get ; }` |
| Property | LightingFixtureWattage | — | `public static ForgeTypeId LightingFixtureWattage { get ; }` |
| Property | LineColor | — | `public static ForgeTypeId LineColor { get ; }` |
| Property | LinePattern | — | `public static ForgeTypeId LinePattern { get ; }` |
| Property | LinePen | — | `public static ForgeTypeId LinePen { get ; }` |
| Property | LineShapeAtCorner | — | `public static ForgeTypeId LineShapeAtCorner { get ; }` |
| Property | LinearDimType | — | `public static ForgeTypeId LinearDimType { get ; }` |
| Property | LinearFramingLength | — | `public static ForgeTypeId LinearFramingLength { get ; }` |
| Property | LoadAllNon0Loads | — | `public static ForgeTypeId LoadAllNon0Loads { get ; }` |
| Property | LoadAreaArea | — | `public static ForgeTypeId LoadAreaArea { get ; }` |
| Property | LoadAreaForceFx1 | — | `public static ForgeTypeId LoadAreaForceFx1 { get ; }` |
| Property | LoadAreaForceFx2 | — | `public static ForgeTypeId LoadAreaForceFx2 { get ; }` |
| Property | LoadAreaForceFx3 | — | `public static ForgeTypeId LoadAreaForceFx3 { get ; }` |
| Property | LoadAreaForceFy1 | — | `public static ForgeTypeId LoadAreaForceFy1 { get ; }` |
| Property | LoadAreaForceFy2 | — | `public static ForgeTypeId LoadAreaForceFy2 { get ; }` |
| Property | LoadAreaForceFy3 | — | `public static ForgeTypeId LoadAreaForceFy3 { get ; }` |
| Property | LoadAreaForceFz1 | — | `public static ForgeTypeId LoadAreaForceFz1 { get ; }` |
| Property | LoadAreaForceFz2 | — | `public static ForgeTypeId LoadAreaForceFz2 { get ; }` |
| Property | LoadAreaForceFz3 | — | `public static ForgeTypeId LoadAreaForceFz3 { get ; }` |
| Property | LoadAreaIsProjected | — | `public static ForgeTypeId LoadAreaIsProjected { get ; }` |
| Property | LoadArrowSeparation | — | `public static ForgeTypeId LoadArrowSeparation { get ; }` |
| Property | LoadAttrAreaForceScaleFactor | — | `public static ForgeTypeId LoadAttrAreaForceScaleFactor { get ; }` |
| Property | LoadAttrForceArrowType | — | `public static ForgeTypeId LoadAttrForceArrowType { get ; }` |
| Property | LoadAttrForceScaleFactor | — | `public static ForgeTypeId LoadAttrForceScaleFactor { get ; }` |
| Property | LoadAttrLinearForceScaleFactor | — | `public static ForgeTypeId LoadAttrLinearForceScaleFactor { get ; }` |
| Property | LoadAttrMomentArrowArc | — | `public static ForgeTypeId LoadAttrMomentArrowArc { get ; }` |
| Property | LoadAttrMomentArrowLine | — | `public static ForgeTypeId LoadAttrMomentArrowLine { get ; }` |
| Property | LoadAttrMomentScaleFactor | — | `public static ForgeTypeId LoadAttrMomentScaleFactor { get ; }` |
| Property | LoadCaseId | — | `public static ForgeTypeId LoadCaseId { get ; }` |
| Property | LoadCaseName | — | `public static ForgeTypeId LoadCaseName { get ; }` |
| Property | LoadCaseNature | — | `public static ForgeTypeId LoadCaseNature { get ; }` |
| Property | LoadCaseNatureText | — | `public static ForgeTypeId LoadCaseNatureText { get ; }` |
| Property | LoadCaseNumber | — | `public static ForgeTypeId LoadCaseNumber { get ; }` |
| Property | LoadCaseSubcategory | — | `public static ForgeTypeId LoadCaseSubcategory { get ; }` |
| Property | LoadCombinationFactor | — | `public static ForgeTypeId LoadCombinationFactor { get ; }` |
| Property | LoadCombinationName | — | `public static ForgeTypeId LoadCombinationName { get ; }` |
| Property | LoadComments | — | `public static ForgeTypeId LoadComments { get ; }` |
| Property | LoadDescription | — | `public static ForgeTypeId LoadDescription { get ; }` |
| Property | LoadForceFx | — | `public static ForgeTypeId LoadForceFx { get ; }` |
| Property | LoadForceFy | — | `public static ForgeTypeId LoadForceFy { get ; }` |
| Property | LoadForceFz | — | `public static ForgeTypeId LoadForceFz { get ; }` |
| Property | LoadIsConstrainedOnHost | — | `public static ForgeTypeId LoadIsConstrainedOnHost { get ; }` |
| Property | LoadIsHosted | — | `public static ForgeTypeId LoadIsHosted { get ; }` |
| Property | LoadIsProjected | — | `public static ForgeTypeId LoadIsProjected { get ; }` |
| Property | LoadIsReaction | — | `public static ForgeTypeId LoadIsReaction { get ; }` |
| Property | LoadIsUniform | — | `public static ForgeTypeId LoadIsUniform { get ; }` |
| Property | LoadLinearForceFx1 | — | `public static ForgeTypeId LoadLinearForceFx1 { get ; }` |
| Property | LoadLinearForceFx2 | — | `public static ForgeTypeId LoadLinearForceFx2 { get ; }` |
| Property | LoadLinearForceFy1 | — | `public static ForgeTypeId LoadLinearForceFy1 { get ; }` |
| Property | LoadLinearForceFy2 | — | `public static ForgeTypeId LoadLinearForceFy2 { get ; }` |
| Property | LoadLinearForceFz1 | — | `public static ForgeTypeId LoadLinearForceFz1 { get ; }` |
| Property | LoadLinearForceFz2 | — | `public static ForgeTypeId LoadLinearForceFz2 { get ; }` |
| Property | LoadLinearLength | — | `public static ForgeTypeId LoadLinearLength { get ; }` |
| Property | LoadMomentMx | — | `public static ForgeTypeId LoadMomentMx { get ; }` |
| Property | LoadMomentMx1 | — | `public static ForgeTypeId LoadMomentMx1 { get ; }` |
| Property | LoadMomentMx2 | — | `public static ForgeTypeId LoadMomentMx2 { get ; }` |
| Property | LoadMomentMy | — | `public static ForgeTypeId LoadMomentMy { get ; }` |
| Property | LoadMomentMy1 | — | `public static ForgeTypeId LoadMomentMy1 { get ; }` |
| Property | LoadMomentMy2 | — | `public static ForgeTypeId LoadMomentMy2 { get ; }` |
| Property | LoadMomentMz | — | `public static ForgeTypeId LoadMomentMz { get ; }` |
| Property | LoadMomentMz1 | — | `public static ForgeTypeId LoadMomentMz1 { get ; }` |
| Property | LoadMomentMz2 | — | `public static ForgeTypeId LoadMomentMz2 { get ; }` |
| Property | LoadNatureName | — | `public static ForgeTypeId LoadNatureName { get ; }` |
| Property | LoadUsageName | — | `public static ForgeTypeId LoadUsageName { get ; }` |
| Property | LoadUseLocalCoordinateSystem | — | `public static ForgeTypeId LoadUseLocalCoordinateSystem { get ; }` |
| Property | LockAlignmentUiToggle | — | `public static ForgeTypeId LockAlignmentUiToggle { get ; }` |
| Property | LockedBaseOffset | — | `public static ForgeTypeId LockedBaseOffset { get ; }` |
| Property | LockedEndOffset | — | `public static ForgeTypeId LockedEndOffset { get ; }` |
| Property | LockedStartOffset | — | `public static ForgeTypeId LockedStartOffset { get ; }` |
| Property | LockedTopOffset | — | `public static ForgeTypeId LockedTopOffset { get ; }` |
| Property | LowestAssociatedLevel | — | `public static ForgeTypeId LowestAssociatedLevel { get ; }` |
| Property | LvMullionLeg1 | — | `public static ForgeTypeId LvMullionLeg1 { get ; }` |
| Property | LvMullionLeg2 | — | `public static ForgeTypeId LvMullionLeg2 { get ; }` |
| Property | MarkupsCreated | — | `public static ForgeTypeId MarkupsCreated { get ; }` |
| Property | MarkupsCreator | — | `public static ForgeTypeId MarkupsCreator { get ; }` |
| Property | MarkupsHistory | — | `public static ForgeTypeId MarkupsHistory { get ; }` |
| Property | MarkupsLabel | — | `public static ForgeTypeId MarkupsLabel { get ; }` |
| Property | MarkupsModified | — | `public static ForgeTypeId MarkupsModified { get ; }` |
| Property | MarkupsNotes | — | `public static ForgeTypeId MarkupsNotes { get ; }` |
| Property | MarkupsPrivate | — | `public static ForgeTypeId MarkupsPrivate { get ; }` |
| Property | MarkupsStatus | — | `public static ForgeTypeId MarkupsStatus { get ; }` |
| Property | MassDataConceptualConstruction | — | `public static ForgeTypeId MassDataConceptualConstruction { get ; }` |
| Property | MassDataGlazingIsShaded | — | `public static ForgeTypeId MassDataGlazingIsShaded { get ; }` |
| Property | MassDataMassExteriorWallArea | — | `public static ForgeTypeId MassDataMassExteriorWallArea { get ; }` |
| Property | MassDataMassInteriorWallArea | — | `public static ForgeTypeId MassDataMassInteriorWallArea { get ; }` |
| Property | MassDataMassOpeningArea | — | `public static ForgeTypeId MassDataMassOpeningArea { get ; }` |
| Property | MassDataMassRoofArea | — | `public static ForgeTypeId MassDataMassRoofArea { get ; }` |
| Property | MassDataMassSkylightArea | — | `public static ForgeTypeId MassDataMassSkylightArea { get ; }` |
| Property | MassDataMassWindowArea | — | `public static ForgeTypeId MassDataMassWindowArea { get ; }` |
| Property | MassDataPercentageGlazing | — | `public static ForgeTypeId MassDataPercentageGlazing { get ; }` |
| Property | MassDataPercentageSkylights | — | `public static ForgeTypeId MassDataPercentageSkylights { get ; }` |
| Property | MassDataShadeDepth | — | `public static ForgeTypeId MassDataShadeDepth { get ; }` |
| Property | MassDataSillHeight | — | `public static ForgeTypeId MassDataSillHeight { get ; }` |
| Property | MassDataSkylightWidth | — | `public static ForgeTypeId MassDataSkylightWidth { get ; }` |
| Property | MassDataSlab | — | `public static ForgeTypeId MassDataSlab { get ; }` |
| Property | MassDataSubcategory | — | `public static ForgeTypeId MassDataSubcategory { get ; }` |
| Property | MassDataSurfaceDataSource | — | `public static ForgeTypeId MassDataSurfaceDataSource { get ; }` |
| Property | MassDataUnderground | — | `public static ForgeTypeId MassDataUnderground { get ; }` |
| Property | MassFloorAreaLevels | — | `public static ForgeTypeId MassFloorAreaLevels { get ; }` |
| Property | MassGrossArea | — | `public static ForgeTypeId MassGrossArea { get ; }` |
| Property | MassGrossSurfaceArea | — | `public static ForgeTypeId MassGrossSurfaceArea { get ; }` |
| Property | MassGrossVolume | — | `public static ForgeTypeId MassGrossVolume { get ; }` |
| Property | MassSurfacedataMaterial | — | `public static ForgeTypeId MassSurfacedataMaterial { get ; }` |
| Property | MassZoneConditionTypeParam | — | `public static ForgeTypeId MassZoneConditionTypeParam { get ; }` |
| Property | MassZoneFloorArea | — | `public static ForgeTypeId MassZoneFloorArea { get ; }` |
| Property | MassZoneMaterial | — | `public static ForgeTypeId MassZoneMaterial { get ; }` |
| Property | MassZoneSpaceTypeParam | — | `public static ForgeTypeId MassZoneSpaceTypeParam { get ; }` |
| Property | MassZoneVolume | — | `public static ForgeTypeId MassZoneVolume { get ; }` |
| Property | MassingIntegrationLevel | — | `public static ForgeTypeId MassingIntegrationLevel { get ; }` |
| Property | MatchlineBottomOffset | — | `public static ForgeTypeId MatchlineBottomOffset { get ; }` |
| Property | MatchlineBottomPlane | — | `public static ForgeTypeId MatchlineBottomPlane { get ; }` |
| Property | MatchlineTopOffset | — | `public static ForgeTypeId MatchlineTopOffset { get ; }` |
| Property | MatchlineTopPlane | — | `public static ForgeTypeId MatchlineTopPlane { get ; }` |
| Property | MaterialArea | — | `public static ForgeTypeId MaterialArea { get ; }` |
| Property | MaterialAspaint | — | `public static ForgeTypeId MaterialAspaint { get ; }` |
| Property | MaterialAssetParamAssetLibId | — | `public static ForgeTypeId MaterialAssetParamAssetLibId { get ; }` |
| Property | MaterialAssetParamCommonSharedAsset | — | `public static ForgeTypeId MaterialAssetParamCommonSharedAsset { get ; }` |
| Property | MaterialAssetParamExternalMaterialId | — | `public static ForgeTypeId MaterialAssetParamExternalMaterialId { get ; }` |
| Property | MaterialAssetParamSource | — | `public static ForgeTypeId MaterialAssetParamSource { get ; }` |
| Property | MaterialAssetParamSourceUrl | — | `public static ForgeTypeId MaterialAssetParamSourceUrl { get ; }` |
| Property | MaterialIdParam | — | `public static ForgeTypeId MaterialIdParam { get ; }` |
| Property | MaterialName | — | `public static ForgeTypeId MaterialName { get ; }` |
| Property | MaterialParamColor | — | `public static ForgeTypeId MaterialParamColor { get ; }` |
| Property | MaterialParamGlow | — | `public static ForgeTypeId MaterialParamGlow { get ; }` |
| Property | MaterialParamShininess | — | `public static ForgeTypeId MaterialParamShininess { get ; }` |
| Property | MaterialParamSmoothness | — | `public static ForgeTypeId MaterialParamSmoothness { get ; }` |
| Property | MaterialParamTransparency | — | `public static ForgeTypeId MaterialParamTransparency { get ; }` |
| Property | MaterialVolume | — | `public static ForgeTypeId MaterialVolume { get ; }` |
| Property | MeasureFromStructure | — | `public static ForgeTypeId MeasureFromStructure { get ; }` |
| Property | MechanicalEquipmentSetIdParam | — | `public static ForgeTypeId MechanicalEquipmentSetIdParam { get ; }` |
| Property | MechanicalEquipmentSetName | — | `public static ForgeTypeId MechanicalEquipmentSetName { get ; }` |
| Property | MechanicalEquipmentSetOnDuty | — | `public static ForgeTypeId MechanicalEquipmentSetOnDuty { get ; }` |
| Property | MechanicalEquipmentSetOnStandby | — | `public static ForgeTypeId MechanicalEquipmentSetOnStandby { get ; }` |
| Property | MepAirloopFantype | — | `public static ForgeTypeId MepAirloopFantype { get ; }` |
| Property | MepAirloopHeatexchangerType | — | `public static ForgeTypeId MepAirloopHeatexchangerType { get ; }` |
| Property | MepAirloopPreheatCoiltype | — | `public static ForgeTypeId MepAirloopPreheatCoiltype { get ; }` |
| Property | MepAnalyticalCriticalpathParam | — | `public static ForgeTypeId MepAnalyticalCriticalpathParam { get ; }` |
| Property | MepAnalyticalElecCurrent | — | `public static ForgeTypeId MepAnalyticalElecCurrent { get ; }` |
| Property | MepAnalyticalElecCurrentRating | — | `public static ForgeTypeId MepAnalyticalElecCurrentRating { get ; }` |
| Property | MepAnalyticalElecVoltage | — | `public static ForgeTypeId MepAnalyticalElecVoltage { get ; }` |
| Property | MepAnalyticalEquipmentName | — | `public static ForgeTypeId MepAnalyticalEquipmentName { get ; }` |
| Property | MepAnalyticalLoopBoundaryParam | — | `public static ForgeTypeId MepAnalyticalLoopBoundaryParam { get ; }` |
| Property | MepAnalyticalLoopName | — | `public static ForgeTypeId MepAnalyticalLoopName { get ; }` |
| Property | MepAnalyticalPipeDesignflow | — | `public static ForgeTypeId MepAnalyticalPipeDesignflow { get ; }` |
| Property | MepChilledWaterLoop | — | `public static ForgeTypeId MepChilledWaterLoop { get ; }` |
| Property | MepCondenserWaterLoop | — | `public static ForgeTypeId MepCondenserWaterLoop { get ; }` |
| Property | MepCoolingCoilType | — | `public static ForgeTypeId MepCoolingCoilType { get ; }` |
| Property | MepElecZoneEquipmentType | — | `public static ForgeTypeId MepElecZoneEquipmentType { get ; }` |
| Property | MepEquipmentCalcPipingflowParam | — | `public static ForgeTypeId MepEquipmentCalcPipingflowParam { get ; }` |
| Property | MepEquipmentCalcPipingpressuredropParam | — | `public static ForgeTypeId MepEquipmentCalcPipingpressuredropParam { get ; }` |
| Property | MepEquipmentClassification | — | `public static ForgeTypeId MepEquipmentClassification { get ; }` |
| Property | MepHeatingCoilType | — | `public static ForgeTypeId MepHeatingCoilType { get ; }` |
| Property | MepHeatingHotwaterLoop | — | `public static ForgeTypeId MepHeatingHotwaterLoop { get ; }` |
| Property | MepIgnoreFlowAnalysis | — | `public static ForgeTypeId MepIgnoreFlowAnalysis { get ; }` |
| Property | MepLowerBottomElevation | — | `public static ForgeTypeId MepLowerBottomElevation { get ; }` |
| Property | MepLowerBottomElevationIncludeInsulation | — | `public static ForgeTypeId MepLowerBottomElevationIncludeInsulation { get ; }` |
| Property | MepLowerCenterlineElevation | — | `public static ForgeTypeId MepLowerCenterlineElevation { get ; }` |
| Property | MepLowerTopElevation | — | `public static ForgeTypeId MepLowerTopElevation { get ; }` |
| Property | MepLowerTopElevationIncludeInsulation | — | `public static ForgeTypeId MepLowerTopElevationIncludeInsulation { get ; }` |
| Property | MepPipeLowerInvertElevation | — | `public static ForgeTypeId MepPipeLowerInvertElevation { get ; }` |
| Property | MepPipeLowerObvertElevation | — | `public static ForgeTypeId MepPipeLowerObvertElevation { get ; }` |
| Property | MepPipeUpperInvertElevation | — | `public static ForgeTypeId MepPipeUpperInvertElevation { get ; }` |
| Property | MepPipeUpperObvertElevation | — | `public static ForgeTypeId MepPipeUpperObvertElevation { get ; }` |
| Property | MepPreheatHotwaterLoop | — | `public static ForgeTypeId MepPreheatHotwaterLoop { get ; }` |
| Property | MepProfileTypeParam | — | `public static ForgeTypeId MepProfileTypeParam { get ; }` |
| Property | MepReheatCoilType | — | `public static ForgeTypeId MepReheatCoilType { get ; }` |
| Property | MepReheatHotwaterLoop | — | `public static ForgeTypeId MepReheatHotwaterLoop { get ; }` |
| Property | MepSpotBottomElevation | — | `public static ForgeTypeId MepSpotBottomElevation { get ; }` |
| Property | MepSpotBottomElevationIncludeInsulation | — | `public static ForgeTypeId MepSpotBottomElevationIncludeInsulation { get ; }` |
| Property | MepSpotCenterlineElevation | — | `public static ForgeTypeId MepSpotCenterlineElevation { get ; }` |
| Property | MepSpotTopElevation | — | `public static ForgeTypeId MepSpotTopElevation { get ; }` |
| Property | MepSpotTopElevationIncludeInsulation | — | `public static ForgeTypeId MepSpotTopElevationIncludeInsulation { get ; }` |
| Property | MepSystemFillGraphicsOverridesParam | — | `public static ForgeTypeId MepSystemFillGraphicsOverridesParam { get ; }` |
| Property | MepSystemLineGraphicsOverridesParam | — | `public static ForgeTypeId MepSystemLineGraphicsOverridesParam { get ; }` |
| Property | MepUpperBottomElevation | — | `public static ForgeTypeId MepUpperBottomElevation { get ; }` |
| Property | MepUpperBottomElevationIncludeInsulation | — | `public static ForgeTypeId MepUpperBottomElevationIncludeInsulation { get ; }` |
| Property | MepUpperCenterlineElevation | — | `public static ForgeTypeId MepUpperCenterlineElevation { get ; }` |
| Property | MepUpperTopElevation | — | `public static ForgeTypeId MepUpperTopElevation { get ; }` |
| Property | MepUpperTopElevationIncludeInsulation | — | `public static ForgeTypeId MepUpperTopElevationIncludeInsulation { get ; }` |
| Property | MepVrfLoop | — | `public static ForgeTypeId MepVrfLoop { get ; }` |
| Property | MepWaterloopChillertype | — | `public static ForgeTypeId MepWaterloopChillertype { get ; }` |
| Property | MepWaterloopType | — | `public static ForgeTypeId MepWaterloopType { get ; }` |
| Property | MepZoneAirLoop | — | `public static ForgeTypeId MepZoneAirLoop { get ; }` |
| Property | MepZoneEquipment | — | `public static ForgeTypeId MepZoneEquipment { get ; }` |
| Property | MepZoneEquipmentBehavior | — | `public static ForgeTypeId MepZoneEquipmentBehavior { get ; }` |
| Property | MepZoneEquipmentDrawVentilation | — | `public static ForgeTypeId MepZoneEquipmentDrawVentilation { get ; }` |
| Property | MepZoneEquipmentType | — | `public static ForgeTypeId MepZoneEquipmentType { get ; }` |
| Property | MepZoneHotwaterLoop | — | `public static ForgeTypeId MepZoneHotwaterLoop { get ; }` |
| Property | ModelCategoryIdParam | — | `public static ForgeTypeId ModelCategoryIdParam { get ; }` |
| Property | ModelGraphicsStyle | — | `public static ForgeTypeId ModelGraphicsStyle { get ; }` |
| Property | ModelGraphicsStyleAnonDraft | — | `public static ForgeTypeId ModelGraphicsStyleAnonDraft { get ; }` |
| Property | ModelOrSymbolic | — | `public static ForgeTypeId ModelOrSymbolic { get ; }` |
| Property | ModelTextSize | — | `public static ForgeTypeId ModelTextSize { get ; }` |
| Property | MovesWithGridParam | — | `public static ForgeTypeId MovesWithGridParam { get ; }` |
| Property | MullionAngle | — | `public static ForgeTypeId MullionAngle { get ; }` |
| Property | MullionCornerType | — | `public static ForgeTypeId MullionCornerType { get ; }` |
| Property | MullionDepth | — | `public static ForgeTypeId MullionDepth { get ; }` |
| Property | MullionDepth1 | — | `public static ForgeTypeId MullionDepth1 { get ; }` |
| Property | MullionDepth2 | — | `public static ForgeTypeId MullionDepth2 { get ; }` |
| Property | MullionFamType | — | `public static ForgeTypeId MullionFamType { get ; }` |
| Property | MullionOffset | — | `public static ForgeTypeId MullionOffset { get ; }` |
| Property | MullionPosition | — | `public static ForgeTypeId MullionPosition { get ; }` |
| Property | MullionProfile | — | `public static ForgeTypeId MullionProfile { get ; }` |
| Property | MultiReferenceAnnotationDimensionStyle | — | `public static ForgeTypeId MultiReferenceAnnotationDimensionStyle { get ; }` |
| Property | MultiReferenceAnnotationGroupTagHeads | — | `public static ForgeTypeId MultiReferenceAnnotationGroupTagHeads { get ; }` |
| Property | MultiReferenceAnnotationReferenceCategory | — | `public static ForgeTypeId MultiReferenceAnnotationReferenceCategory { get ; }` |
| Property | MultiReferenceAnnotationShowDimensionText | — | `public static ForgeTypeId MultiReferenceAnnotationShowDimensionText { get ; }` |
| Property | MultiReferenceAnnotationTagType | — | `public static ForgeTypeId MultiReferenceAnnotationTagType { get ; }` |
| Property | MultipleAlignmentUiToggle | — | `public static ForgeTypeId MultipleAlignmentUiToggle { get ; }` |
| Property | MultistoryStairsActualTreadDepth | — | `public static ForgeTypeId MultistoryStairsActualTreadDepth { get ; }` |
| Property | MultistoryStairsRefLevel | — | `public static ForgeTypeId MultistoryStairsRefLevel { get ; }` |
| Property | NodeConnectionStatus | — | `public static ForgeTypeId NodeConnectionStatus { get ; }` |
| Property | NumberPartitionParam | — | `public static ForgeTypeId NumberPartitionParam { get ; }` |
| Property | NumberSystemDisplayRule | — | `public static ForgeTypeId NumberSystemDisplayRule { get ; }` |
| Property | NumberSystemJustify | — | `public static ForgeTypeId NumberSystemJustify { get ; }` |
| Property | NumberSystemJustifyOffset | — | `public static ForgeTypeId NumberSystemJustifyOffset { get ; }` |
| Property | NumberSystemOrientation | — | `public static ForgeTypeId NumberSystemOrientation { get ; }` |
| Property | NumberSystemReference | — | `public static ForgeTypeId NumberSystemReference { get ; }` |
| Property | NumberSystemReferenceOffset | — | `public static ForgeTypeId NumberSystemReferenceOffset { get ; }` |
| Property | NumberSystemTagType | — | `public static ForgeTypeId NumberSystemTagType { get ; }` |
| Property | NumberSystemTextSize | — | `public static ForgeTypeId NumberSystemTextSize { get ; }` |
| Property | ObjectStyleMaterialIdParam | — | `public static ForgeTypeId ObjectStyleMaterialIdParam { get ; }` |
| Property | OffsetFromReferenceBase | — | `public static ForgeTypeId OffsetFromReferenceBase { get ; }` |
| Property | OffsetfacesShowShapeHandles | — | `public static ForgeTypeId OffsetfacesShowShapeHandles { get ; }` |
| Property | OmniclassCode | — | `public static ForgeTypeId OmniclassCode { get ; }` |
| Property | OmniclassDescription | — | `public static ForgeTypeId OmniclassDescription { get ; }` |
| Property | OptionName | — | `public static ForgeTypeId OptionName { get ; }` |
| Property | OptionSetId | — | `public static ForgeTypeId OptionSetId { get ; }` |
| Property | OptionSetName | — | `public static ForgeTypeId OptionSetName { get ; }` |
| Property | OrdinateDimSetting | — | `public static ForgeTypeId OrdinateDimSetting { get ; }` |
| Property | OrientByView | — | `public static ForgeTypeId OrientByView { get ; }` |
| Property | OriginatingElementName | — | `public static ForgeTypeId OriginatingElementName { get ; }` |
| Property | OvalFramingHeight | — | `public static ForgeTypeId OvalFramingHeight { get ; }` |
| Property | OvalFramingWidth | — | `public static ForgeTypeId OvalFramingWidth { get ; }` |
| Property | PaddingLength | — | `public static ForgeTypeId PaddingLength { get ; }` |
| Property | PanelScheduleName | — | `public static ForgeTypeId PanelScheduleName { get ; }` |
| Property | PartMakerDivisionProfileOffset | — | `public static ForgeTypeId PartMakerDivisionProfileOffset { get ; }` |
| Property | PartMakerSplitterProfile | — | `public static ForgeTypeId PartMakerSplitterProfile { get ; }` |
| Property | PartMakerSplitterProfileEdgeMatch | — | `public static ForgeTypeId PartMakerSplitterProfileEdgeMatch { get ; }` |
| Property | PartMakerSplitterProfileFlipAcross | — | `public static ForgeTypeId PartMakerSplitterProfileFlipAcross { get ; }` |
| Property | PartMakerSplitterProfileFlipAlong | — | `public static ForgeTypeId PartMakerSplitterProfileFlipAlong { get ; }` |
| Property | PartmakerParamDivisionGap | — | `public static ForgeTypeId PartmakerParamDivisionGap { get ; }` |
| Property | PathOfTravelFromRoom | — | `public static ForgeTypeId PathOfTravelFromRoom { get ; }` |
| Property | PathOfTravelLevelName | — | `public static ForgeTypeId PathOfTravelLevelName { get ; }` |
| Property | PathOfTravelSpeed | — | `public static ForgeTypeId PathOfTravelSpeed { get ; }` |
| Property | PathOfTravelTime | — | `public static ForgeTypeId PathOfTravelTime { get ; }` |
| Property | PathOfTravelToRoom | — | `public static ForgeTypeId PathOfTravelToRoom { get ; }` |
| Property | PathOfTravelViewName | — | `public static ForgeTypeId PathOfTravelViewName { get ; }` |
| Property | PathReinAddlOffset | — | `public static ForgeTypeId PathReinAddlOffset { get ; }` |
| Property | PathReinAltOffset | — | `public static ForgeTypeId PathReinAltOffset { get ; }` |
| Property | PathReinAlternating | — | `public static ForgeTypeId PathReinAlternating { get ; }` |
| Property | PathReinEndHookOrient1Slab | — | `public static ForgeTypeId PathReinEndHookOrient1Slab { get ; }` |
| Property | PathReinEndHookOrient1Wall | — | `public static ForgeTypeId PathReinEndHookOrient1Wall { get ; }` |
| Property | PathReinEndHookOrient2Slab | — | `public static ForgeTypeId PathReinEndHookOrient2Slab { get ; }` |
| Property | PathReinEndHookOrient2Wall | — | `public static ForgeTypeId PathReinEndHookOrient2Wall { get ; }` |
| Property | PathReinEndHookTypen1 | — | `public static ForgeTypeId PathReinEndHookTypen1 { get ; }` |
| Property | PathReinEndHookTypen2 | — | `public static ForgeTypeId PathReinEndHookTypen2 { get ; }` |
| Property | PathReinEndSpanhookAlt | — | `public static ForgeTypeId PathReinEndSpanhookAlt { get ; }` |
| Property | PathReinEndSpanhookPrim | — | `public static ForgeTypeId PathReinEndSpanhookPrim { get ; }` |
| Property | PathReinFaceSlab | — | `public static ForgeTypeId PathReinFaceSlab { get ; }` |
| Property | PathReinFaceWall | — | `public static ForgeTypeId PathReinFaceWall { get ; }` |
| Property | PathReinHookOrient1Slab | — | `public static ForgeTypeId PathReinHookOrient1Slab { get ; }` |
| Property | PathReinHookOrient1Wall | — | `public static ForgeTypeId PathReinHookOrient1Wall { get ; }` |
| Property | PathReinHookOrient2Slab | — | `public static ForgeTypeId PathReinHookOrient2Slab { get ; }` |
| Property | PathReinHookOrient2Wall | — | `public static ForgeTypeId PathReinHookOrient2Wall { get ; }` |
| Property | PathReinHookTypen1 | — | `public static ForgeTypeId PathReinHookTypen1 { get ; }` |
| Property | PathReinHookTypen2 | — | `public static ForgeTypeId PathReinHookTypen2 { get ; }` |
| Property | PathReinLengthn1 | — | `public static ForgeTypeId PathReinLengthn1 { get ; }` |
| Property | PathReinLengthn2 | — | `public static ForgeTypeId PathReinLengthn2 { get ; }` |
| Property | PathReinNumberOfBars | — | `public static ForgeTypeId PathReinNumberOfBars { get ; }` |
| Property | PathReinShapen1 | — | `public static ForgeTypeId PathReinShapen1 { get ; }` |
| Property | PathReinShapen2 | — | `public static ForgeTypeId PathReinShapen2 { get ; }` |
| Property | PathReinSpacing | — | `public static ForgeTypeId PathReinSpacing { get ; }` |
| Property | PathReinSpanhookAlt | — | `public static ForgeTypeId PathReinSpanhookAlt { get ; }` |
| Property | PathReinSpanhookPrim | — | `public static ForgeTypeId PathReinSpanhookPrim { get ; }` |
| Property | PathReinSpanlengthAltOffset | — | `public static ForgeTypeId PathReinSpanlengthAltOffset { get ; }` |
| Property | PathReinSpanlengthBarlengthAlt | — | `public static ForgeTypeId PathReinSpanlengthBarlengthAlt { get ; }` |
| Property | PathReinSpanlengthBarlengthPrim | — | `public static ForgeTypeId PathReinSpanlengthBarlengthPrim { get ; }` |
| Property | PathReinSpanlengthBottomAlt | — | `public static ForgeTypeId PathReinSpanlengthBottomAlt { get ; }` |
| Property | PathReinSpanlengthBottomPrim | — | `public static ForgeTypeId PathReinSpanlengthBottomPrim { get ; }` |
| Property | PathReinSpanlengthTopAlt | — | `public static ForgeTypeId PathReinSpanlengthTopAlt { get ; }` |
| Property | PathReinSummary | — | `public static ForgeTypeId PathReinSummary { get ; }` |
| Property | PathReinTypen1 | — | `public static ForgeTypeId PathReinTypen1 { get ; }` |
| Property | PathReinTypen2 | — | `public static ForgeTypeId PathReinTypen2 { get ; }` |
| Property | PatternIndent1ForDivisionRule | — | `public static ForgeTypeId PatternIndent1ForDivisionRule { get ; }` |
| Property | PatternIndent2ForDivisionRule | — | `public static ForgeTypeId PatternIndent2ForDivisionRule { get ; }` |
| Property | PatternMirrorForDivisionRule | — | `public static ForgeTypeId PatternMirrorForDivisionRule { get ; }` |
| Property | PeakAirflowParam | — | `public static ForgeTypeId PeakAirflowParam { get ; }` |
| Property | PeakCoolingLoadParam | — | `public static ForgeTypeId PeakCoolingLoadParam { get ; }` |
| Property | PeakHeatingLoadParam | — | `public static ForgeTypeId PeakHeatingLoadParam { get ; }` |
| Property | PeakLatentCoolingLoad | — | `public static ForgeTypeId PeakLatentCoolingLoad { get ; }` |
| Property | PhaseCreated | — | `public static ForgeTypeId PhaseCreated { get ; }` |
| Property | PhaseDemolished | — | `public static ForgeTypeId PhaseDemolished { get ; }` |
| Property | PhaseName | — | `public static ForgeTypeId PhaseName { get ; }` |
| Property | PhaseSequenceNumber | — | `public static ForgeTypeId PhaseSequenceNumber { get ; }` |
| Property | PhyMaterialParamAverageModulus | — | `public static ForgeTypeId PhyMaterialParamAverageModulus { get ; }` |
| Property | PhyMaterialParamBehavior | — | `public static ForgeTypeId PhyMaterialParamBehavior { get ; }` |
| Property | PhyMaterialParamBending | — | `public static ForgeTypeId PhyMaterialParamBending { get ; }` |
| Property | PhyMaterialParamBendingReinforcement | — | `public static ForgeTypeId PhyMaterialParamBendingReinforcement { get ; }` |
| Property | PhyMaterialParamClass | — | `public static ForgeTypeId PhyMaterialParamClass { get ; }` |
| Property | PhyMaterialParamCompressionParallel | — | `public static ForgeTypeId PhyMaterialParamCompressionParallel { get ; }` |
| Property | PhyMaterialParamCompressionPerpendicular | — | `public static ForgeTypeId PhyMaterialParamCompressionPerpendicular { get ; }` |
| Property | PhyMaterialParamConcreteCompression | — | `public static ForgeTypeId PhyMaterialParamConcreteCompression { get ; }` |
| Property | PhyMaterialParamExpCoeff | — | `public static ForgeTypeId PhyMaterialParamExpCoeff { get ; }` |
| Property | PhyMaterialParamExpCoeff1 | — | `public static ForgeTypeId PhyMaterialParamExpCoeff1 { get ; }` |
| Property | PhyMaterialParamExpCoeff2 | — | `public static ForgeTypeId PhyMaterialParamExpCoeff2 { get ; }` |
| Property | PhyMaterialParamExpCoeff3 | — | `public static ForgeTypeId PhyMaterialParamExpCoeff3 { get ; }` |
| Property | PhyMaterialParamExpCoeffn1 | — | `public static ForgeTypeId PhyMaterialParamExpCoeffn1 { get ; }` |
| Property | PhyMaterialParamExpCoeffn2 | — | `public static ForgeTypeId PhyMaterialParamExpCoeffn2 { get ; }` |
| Property | PhyMaterialParamFivepercentModulusOfElacticity | — | `public static ForgeTypeId PhyMaterialParamFivepercentModulusOfElacticity { get ; }` |
| Property | PhyMaterialParamGrade | — | `public static ForgeTypeId PhyMaterialParamGrade { get ; }` |
| Property | PhyMaterialParamLightWeight | — | `public static ForgeTypeId PhyMaterialParamLightWeight { get ; }` |
| Property | PhyMaterialParamMinimumTensileStrength | — | `public static ForgeTypeId PhyMaterialParamMinimumTensileStrength { get ; }` |
| Property | PhyMaterialParamMinimumYieldStress | — | `public static ForgeTypeId PhyMaterialParamMinimumYieldStress { get ; }` |
| Property | PhyMaterialParamPoissonMod | — | `public static ForgeTypeId PhyMaterialParamPoissonMod { get ; }` |
| Property | PhyMaterialParamPoissonMod1 | — | `public static ForgeTypeId PhyMaterialParamPoissonMod1 { get ; }` |
| Property | PhyMaterialParamPoissonMod12 | — | `public static ForgeTypeId PhyMaterialParamPoissonMod12 { get ; }` |
| Property | PhyMaterialParamPoissonMod2 | — | `public static ForgeTypeId PhyMaterialParamPoissonMod2 { get ; }` |
| Property | PhyMaterialParamPoissonMod23 | — | `public static ForgeTypeId PhyMaterialParamPoissonMod23 { get ; }` |
| Property | PhyMaterialParamPoissonMod3 | — | `public static ForgeTypeId PhyMaterialParamPoissonMod3 { get ; }` |
| Property | PhyMaterialParamReductionFactor | — | `public static ForgeTypeId PhyMaterialParamReductionFactor { get ; }` |
| Property | PhyMaterialParamResistanceCalcStrength | — | `public static ForgeTypeId PhyMaterialParamResistanceCalcStrength { get ; }` |
| Property | PhyMaterialParamShearMod | — | `public static ForgeTypeId PhyMaterialParamShearMod { get ; }` |
| Property | PhyMaterialParamShearMod1 | — | `public static ForgeTypeId PhyMaterialParamShearMod1 { get ; }` |
| Property | PhyMaterialParamShearMod12 | — | `public static ForgeTypeId PhyMaterialParamShearMod12 { get ; }` |
| Property | PhyMaterialParamShearMod2 | — | `public static ForgeTypeId PhyMaterialParamShearMod2 { get ; }` |
| Property | PhyMaterialParamShearMod3 | — | `public static ForgeTypeId PhyMaterialParamShearMod3 { get ; }` |
| Property | PhyMaterialParamShearParallel | — | `public static ForgeTypeId PhyMaterialParamShearParallel { get ; }` |
| Property | PhyMaterialParamShearPerpendicular | — | `public static ForgeTypeId PhyMaterialParamShearPerpendicular { get ; }` |
| Property | PhyMaterialParamShearReinforcement | — | `public static ForgeTypeId PhyMaterialParamShearReinforcement { get ; }` |
| Property | PhyMaterialParamShearStrengthReduction | — | `public static ForgeTypeId PhyMaterialParamShearStrengthReduction { get ; }` |
| Property | PhyMaterialParamSpecies | — | `public static ForgeTypeId PhyMaterialParamSpecies { get ; }` |
| Property | PhyMaterialParamStructuralDensity | — | `public static ForgeTypeId PhyMaterialParamStructuralDensity { get ; }` |
| Property | PhyMaterialParamStructuralSpecificHeat | — | `public static ForgeTypeId PhyMaterialParamStructuralSpecificHeat { get ; }` |
| Property | PhyMaterialParamStructuralThermalTreated | — | `public static ForgeTypeId PhyMaterialParamStructuralThermalTreated { get ; }` |
| Property | PhyMaterialParamSubclass | — | `public static ForgeTypeId PhyMaterialParamSubclass { get ; }` |
| Property | PhyMaterialParamTensionParallel | — | `public static ForgeTypeId PhyMaterialParamTensionParallel { get ; }` |
| Property | PhyMaterialParamTensionPerpendicular | — | `public static ForgeTypeId PhyMaterialParamTensionPerpendicular { get ; }` |
| Property | PhyMaterialParamThermalConductivity | — | `public static ForgeTypeId PhyMaterialParamThermalConductivity { get ; }` |
| Property | PhyMaterialParamThermalConductivityX | — | `public static ForgeTypeId PhyMaterialParamThermalConductivityX { get ; }` |
| Property | PhyMaterialParamThermalConductivityY | — | `public static ForgeTypeId PhyMaterialParamThermalConductivityY { get ; }` |
| Property | PhyMaterialParamThermalConductivityZ | — | `public static ForgeTypeId PhyMaterialParamThermalConductivityZ { get ; }` |
| Property | PhyMaterialParamType | — | `public static ForgeTypeId PhyMaterialParamType { get ; }` |
| Property | PhyMaterialParamUnitWeight | — | `public static ForgeTypeId PhyMaterialParamUnitWeight { get ; }` |
| Property | PhyMaterialParamWoodConstruction | — | `public static ForgeTypeId PhyMaterialParamWoodConstruction { get ; }` |
| Property | PhyMaterialParamYoungMod | — | `public static ForgeTypeId PhyMaterialParamYoungMod { get ; }` |
| Property | PhyMaterialParamYoungMod1 | — | `public static ForgeTypeId PhyMaterialParamYoungMod1 { get ; }` |
| Property | PhyMaterialParamYoungMod2 | — | `public static ForgeTypeId PhyMaterialParamYoungMod2 { get ; }` |
| Property | PhyMaterialParamYoungMod3 | — | `public static ForgeTypeId PhyMaterialParamYoungMod3 { get ; }` |
| Property | PhyMaterialParamYoungModn1 | — | `public static ForgeTypeId PhyMaterialParamYoungModn1 { get ; }` |
| Property | PhyMaterialParamYoungModn2 | — | `public static ForgeTypeId PhyMaterialParamYoungModn2 { get ; }` |
| Property | PhyMaterialProperties | — | `public static ForgeTypeId PhyMaterialProperties { get ; }` |
| Property | PipeRoughness | — | `public static ForgeTypeId PipeRoughness { get ; }` |
| Property | PipeVelocityPressure | — | `public static ForgeTypeId PipeVelocityPressure { get ; }` |
| Property | PipingConnectionType | — | `public static ForgeTypeId PipingConnectionType { get ; }` |
| Property | PipingGenderType | — | `public static ForgeTypeId PipingGenderType { get ; }` |
| Property | PlacementBottom | — | `public static ForgeTypeId PlacementBottom { get ; }` |
| Property | PlacementCenterX | — | `public static ForgeTypeId PlacementCenterX { get ; }` |
| Property | PlacementCenterY | — | `public static ForgeTypeId PlacementCenterY { get ; }` |
| Property | PlacementLeft | — | `public static ForgeTypeId PlacementLeft { get ; }` |
| Property | PlacementParamsShow | — | `public static ForgeTypeId PlacementParamsShow { get ; }` |
| Property | PlacementRight | — | `public static ForgeTypeId PlacementRight { get ; }` |
| Property | PlacementTop | — | `public static ForgeTypeId PlacementTop { get ; }` |
| Property | PlanRegionViewRange | — | `public static ForgeTypeId PlanRegionViewRange { get ; }` |
| Property | PlanViewCutPlaneHeight | — | `public static ForgeTypeId PlanViewCutPlaneHeight { get ; }` |
| Property | PlanViewLevel | — | `public static ForgeTypeId PlanViewLevel { get ; }` |
| Property | PlanViewNorth | — | `public static ForgeTypeId PlanViewNorth { get ; }` |
| Property | PlanViewRange | — | `public static ForgeTypeId PlanViewRange { get ; }` |
| Property | PlanViewTopClipHeight | — | `public static ForgeTypeId PlanViewTopClipHeight { get ; }` |
| Property | PlanViewViewDir | — | `public static ForgeTypeId PlanViewViewDir { get ; }` |
| Property | PlumbingFixturesCwConnection | — | `public static ForgeTypeId PlumbingFixturesCwConnection { get ; }` |
| Property | PlumbingFixturesDrain | — | `public static ForgeTypeId PlumbingFixturesDrain { get ; }` |
| Property | PlumbingFixturesHwConnection | — | `public static ForgeTypeId PlumbingFixturesHwConnection { get ; }` |
| Property | PlumbingFixturesSupplyFitting | — | `public static ForgeTypeId PlumbingFixturesSupplyFitting { get ; }` |
| Property | PlumbingFixturesSupplyPipe | — | `public static ForgeTypeId PlumbingFixturesSupplyPipe { get ; }` |
| Property | PlumbingFixturesTrap | — | `public static ForgeTypeId PlumbingFixturesTrap { get ; }` |
| Property | PlumbingFixturesVentConnection | — | `public static ForgeTypeId PlumbingFixturesVentConnection { get ; }` |
| Property | PlumbingFixturesWasteConnection | — | `public static ForgeTypeId PlumbingFixturesWasteConnection { get ; }` |
| Property | PocheMatId | — | `public static ForgeTypeId PocheMatId { get ; }` |
| Property | PointAdaptiveConstrained | — | `public static ForgeTypeId PointAdaptiveConstrained { get ; }` |
| Property | PointAdaptiveNumParam | — | `public static ForgeTypeId PointAdaptiveNumParam { get ; }` |
| Property | PointAdaptiveOrientationType | — | `public static ForgeTypeId PointAdaptiveOrientationType { get ; }` |
| Property | PointAdaptiveShowNumber | — | `public static ForgeTypeId PointAdaptiveShowNumber { get ; }` |
| Property | PointAdaptiveTypeParam | — | `public static ForgeTypeId PointAdaptiveTypeParam { get ; }` |
| Property | PointElementAngle | — | `public static ForgeTypeId PointElementAngle { get ; }` |
| Property | PointElementChordLength | — | `public static ForgeTypeId PointElementChordLength { get ; }` |
| Property | PointElementDriven | — | `public static ForgeTypeId PointElementDriven { get ; }` |
| Property | PointElementDriving | — | `public static ForgeTypeId PointElementDriving { get ; }` |
| Property | PointElementHostedOnFaceUParam | — | `public static ForgeTypeId PointElementHostedOnFaceUParam { get ; }` |
| Property | PointElementHostedOnFaceVParam | — | `public static ForgeTypeId PointElementHostedOnFaceVParam { get ; }` |
| Property | PointElementHostedParam | — | `public static ForgeTypeId PointElementHostedParam { get ; }` |
| Property | PointElementMeasureFrom | — | `public static ForgeTypeId PointElementMeasureFrom { get ; }` |
| Property | PointElementMeasurementType | — | `public static ForgeTypeId PointElementMeasurementType { get ; }` |
| Property | PointElementMirrored | — | `public static ForgeTypeId PointElementMirrored { get ; }` |
| Property | PointElementNonNormalizedCurveParamater | — | `public static ForgeTypeId PointElementNonNormalizedCurveParamater { get ; }` |
| Property | PointElementNormalizedCurveParamater | — | `public static ForgeTypeId PointElementNormalizedCurveParamater { get ; }` |
| Property | PointElementNormalizedSegmentLength | — | `public static ForgeTypeId PointElementNormalizedSegmentLength { get ; }` |
| Property | PointElementOffset | — | `public static ForgeTypeId PointElementOffset { get ; }` |
| Property | PointElementRotationAngle | — | `public static ForgeTypeId PointElementRotationAngle { get ; }` |
| Property | PointElementSegmentLength | — | `public static ForgeTypeId PointElementSegmentLength { get ; }` |
| Property | PointElementShowNormalPlaneOnly | — | `public static ForgeTypeId PointElementShowNormalPlaneOnly { get ; }` |
| Property | PointElementShowPlanes | — | `public static ForgeTypeId PointElementShowPlanes { get ; }` |
| Property | PointElementZflipped | — | `public static ForgeTypeId PointElementZflipped { get ; }` |
| Property | PointElevation | — | `public static ForgeTypeId PointElevation { get ; }` |
| Property | PointFlexibleConstrained | — | `public static ForgeTypeId PointFlexibleConstrained { get ; }` |
| Property | PointFlexibleNumParam | — | `public static ForgeTypeId PointFlexibleNumParam { get ; }` |
| Property | PointFlexibleOrientationType | — | `public static ForgeTypeId PointFlexibleOrientationType { get ; }` |
| Property | PointFlexibleShowNumber | — | `public static ForgeTypeId PointFlexibleShowNumber { get ; }` |
| Property | PointNameParam | — | `public static ForgeTypeId PointNameParam { get ; }` |
| Property | PointVisibilityParam | — | `public static ForgeTypeId PointVisibilityParam { get ; }` |
| Property | PointcloudinstanceName | — | `public static ForgeTypeId PointcloudinstanceName { get ; }` |
| Property | PointcloudtypeScale | — | `public static ForgeTypeId PointcloudtypeScale { get ; }` |
| Property | PreferDimSideUiFilter | — | `public static ForgeTypeId PreferDimSideUiFilter { get ; }` |
| Property | PreferPatternAlignUiFilter | — | `public static ForgeTypeId PreferPatternAlignUiFilter { get ; }` |
| Property | PrimaryOptionId | — | `public static ForgeTypeId PrimaryOptionId { get ; }` |
| Property | Profile1Angle | — | `public static ForgeTypeId Profile1Angle { get ; }` |
| Property | Profile1FamType | — | `public static ForgeTypeId Profile1FamType { get ; }` |
| Property | Profile1FlippedHor | — | `public static ForgeTypeId Profile1FlippedHor { get ; }` |
| Property | Profile1OffsetX | — | `public static ForgeTypeId Profile1OffsetX { get ; }` |
| Property | Profile1OffsetY | — | `public static ForgeTypeId Profile1OffsetY { get ; }` |
| Property | Profile2Angle | — | `public static ForgeTypeId Profile2Angle { get ; }` |
| Property | Profile2FamType | — | `public static ForgeTypeId Profile2FamType { get ; }` |
| Property | Profile2FlippedHor | — | `public static ForgeTypeId Profile2FlippedHor { get ; }` |
| Property | Profile2OffsetX | — | `public static ForgeTypeId Profile2OffsetX { get ; }` |
| Property | Profile2OffsetY | — | `public static ForgeTypeId Profile2OffsetY { get ; }` |
| Property | ProfileAngle | — | `public static ForgeTypeId ProfileAngle { get ; }` |
| Property | ProfileFamType | — | `public static ForgeTypeId ProfileFamType { get ; }` |
| Property | ProfileFamTypePlusNone | — | `public static ForgeTypeId ProfileFamTypePlusNone { get ; }` |
| Property | ProfileFlippedHor | — | `public static ForgeTypeId ProfileFlippedHor { get ; }` |
| Property | ProfileOffsetX | — | `public static ForgeTypeId ProfileOffsetX { get ; }` |
| Property | ProfileOffsetY | — | `public static ForgeTypeId ProfileOffsetY { get ; }` |
| Property | ProfileParamAlongPath | — | `public static ForgeTypeId ProfileParamAlongPath { get ; }` |
| Property | ProjectAddress | — | `public static ForgeTypeId ProjectAddress { get ; }` |
| Property | ProjectAuthor | — | `public static ForgeTypeId ProjectAuthor { get ; }` |
| Property | ProjectBuildingName | — | `public static ForgeTypeId ProjectBuildingName { get ; }` |
| Property | ProjectBuildingType | — | `public static ForgeTypeId ProjectBuildingType { get ; }` |
| Property | ProjectIssueDate | — | `public static ForgeTypeId ProjectIssueDate { get ; }` |
| Property | ProjectName | — | `public static ForgeTypeId ProjectName { get ; }` |
| Property | ProjectNumber | — | `public static ForgeTypeId ProjectNumber { get ; }` |
| Property | ProjectOrganizationDescription | — | `public static ForgeTypeId ProjectOrganizationDescription { get ; }` |
| Property | ProjectOrganizationName | — | `public static ForgeTypeId ProjectOrganizationName { get ; }` |
| Property | ProjectPostalCode | — | `public static ForgeTypeId ProjectPostalCode { get ; }` |
| Property | ProjectRevisionEnumeration | — | `public static ForgeTypeId ProjectRevisionEnumeration { get ; }` |
| Property | ProjectRevisionRevisionDate | — | `public static ForgeTypeId ProjectRevisionRevisionDate { get ; }` |
| Property | ProjectRevisionRevisionDescription | — | `public static ForgeTypeId ProjectRevisionRevisionDescription { get ; }` |
| Property | ProjectRevisionRevisionIssued | — | `public static ForgeTypeId ProjectRevisionRevisionIssued { get ; }` |
| Property | ProjectRevisionRevisionIssuedBy | — | `public static ForgeTypeId ProjectRevisionRevisionIssuedBy { get ; }` |
| Property | ProjectRevisionRevisionIssuedTo | — | `public static ForgeTypeId ProjectRevisionRevisionIssuedTo { get ; }` |
| Property | ProjectRevisionRevisionNum | — | `public static ForgeTypeId ProjectRevisionRevisionNum { get ; }` |
| Property | ProjectRevisionSequenceNum | — | `public static ForgeTypeId ProjectRevisionSequenceNum { get ; }` |
| Property | ProjectStatus | — | `public static ForgeTypeId ProjectStatus { get ; }` |
| Property | ProjectedSurfaceArea | — | `public static ForgeTypeId ProjectedSurfaceArea { get ; }` |
| Property | PropertyArea | — | `public static ForgeTypeId PropertyArea { get ; }` |
| Property | PropertyAreaOpen | — | `public static ForgeTypeId PropertyAreaOpen { get ; }` |
| Property | PropertyAreaUnits | — | `public static ForgeTypeId PropertyAreaUnits { get ; }` |
| Property | PropertyLengthUnits | — | `public static ForgeTypeId PropertyLengthUnits { get ; }` |
| Property | PropertySegmentBearing | — | `public static ForgeTypeId PropertySegmentBearing { get ; }` |
| Property | PropertySegmentDistance | — | `public static ForgeTypeId PropertySegmentDistance { get ; }` |
| Property | PropertySegmentEW | — | `public static ForgeTypeId PropertySegmentEW { get ; }` |
| Property | PropertySegmentLR | — | `public static ForgeTypeId PropertySegmentLR { get ; }` |
| Property | PropertySegmentNS | — | `public static ForgeTypeId PropertySegmentNS { get ; }` |
| Property | PropertySegmentRadius | — | `public static ForgeTypeId PropertySegmentRadius { get ; }` |
| Property | PropertySegmentSubcategoryId | — | `public static ForgeTypeId PropertySegmentSubcategoryId { get ; }` |
| Property | PropertySetDescription | — | `public static ForgeTypeId PropertySetDescription { get ; }` |
| Property | PropertySetKeywords | — | `public static ForgeTypeId PropertySetKeywords { get ; }` |
| Property | PropertySetMaterialAspect | — | `public static ForgeTypeId PropertySetMaterialAspect { get ; }` |
| Property | PropertySetName | — | `public static ForgeTypeId PropertySetName { get ; }` |
| Property | PropertySubcategoryId | — | `public static ForgeTypeId PropertySubcategoryId { get ; }` |
| Property | RadialArrayArcRadius | — | `public static ForgeTypeId RadialArrayArcRadius { get ; }` |
| Property | RadiusSymbolLocation | — | `public static ForgeTypeId RadiusSymbolLocation { get ; }` |
| Property | RadiusSymbolText | — | `public static ForgeTypeId RadiusSymbolText { get ; }` |
| Property | RailingSystemHandrailsHeightParam | — | `public static ForgeTypeId RailingSystemHandrailsHeightParam { get ; }` |
| Property | RailingSystemHandrailsLatteralOffset | — | `public static ForgeTypeId RailingSystemHandrailsLatteralOffset { get ; }` |
| Property | RailingSystemHandrailsPositionParam | — | `public static ForgeTypeId RailingSystemHandrailsPositionParam { get ; }` |
| Property | RailingSystemHandrailsTypesParam | — | `public static ForgeTypeId RailingSystemHandrailsTypesParam { get ; }` |
| Property | RailingSystemHasTopRail | — | `public static ForgeTypeId RailingSystemHasTopRail { get ; }` |
| Property | RailingSystemSecondaryHandrailsHeightParam | — | `public static ForgeTypeId RailingSystemSecondaryHandrailsHeightParam { get ; }` |
| Property | RailingSystemSecondaryHandrailsLatteralOffset | — | `public static ForgeTypeId RailingSystemSecondaryHandrailsLatteralOffset { get ; }` |
| Property | RailingSystemSecondaryHandrailsPositionParam | — | `public static ForgeTypeId RailingSystemSecondaryHandrailsPositionParam { get ; }` |
| Property | RailingSystemSecondaryHandrailsTypesParam | — | `public static ForgeTypeId RailingSystemSecondaryHandrailsTypesParam { get ; }` |
| Property | RailingSystemTopRailHeightParam | — | `public static ForgeTypeId RailingSystemTopRailHeightParam { get ; }` |
| Property | RailingSystemTopRailTypesParam | — | `public static ForgeTypeId RailingSystemTopRailTypesParam { get ; }` |
| Property | RampAttrLeftBalusterAttachPt | — | `public static ForgeTypeId RampAttrLeftBalusterAttachPt { get ; }` |
| Property | RampAttrMaterial | — | `public static ForgeTypeId RampAttrMaterial { get ; }` |
| Property | RampAttrMinInvSlope | — | `public static ForgeTypeId RampAttrMinInvSlope { get ; }` |
| Property | RampAttrRightBalusterAttachPt | — | `public static ForgeTypeId RampAttrRightBalusterAttachPt { get ; }` |
| Property | RampAttrShape | — | `public static ForgeTypeId RampAttrShape { get ; }` |
| Property | RampAttrTextFont | — | `public static ForgeTypeId RampAttrTextFont { get ; }` |
| Property | RampAttrTextSize | — | `public static ForgeTypeId RampAttrTextSize { get ; }` |
| Property | RampAttrThickness | — | `public static ForgeTypeId RampAttrThickness { get ; }` |
| Property | RampMaxRunLength | — | `public static ForgeTypeId RampMaxRunLength { get ; }` |
| Property | RasterEnableSnaps | — | `public static ForgeTypeId RasterEnableSnaps { get ; }` |
| Property | RasterHorizontalScale | — | `public static ForgeTypeId RasterHorizontalScale { get ; }` |
| Property | RasterLockProportions | — | `public static ForgeTypeId RasterLockProportions { get ; }` |
| Property | RasterSheetheight | — | `public static ForgeTypeId RasterSheetheight { get ; }` |
| Property | RasterSheetwidth | — | `public static ForgeTypeId RasterSheetwidth { get ; }` |
| Property | RasterSymbolFilename | — | `public static ForgeTypeId RasterSymbolFilename { get ; }` |
| Property | RasterSymbolHeight | — | `public static ForgeTypeId RasterSymbolHeight { get ; }` |
| Property | RasterSymbolLinkloadStatus | — | `public static ForgeTypeId RasterSymbolLinkloadStatus { get ; }` |
| Property | RasterSymbolPagenumber | — | `public static ForgeTypeId RasterSymbolPagenumber { get ; }` |
| Property | RasterSymbolPixelheight | — | `public static ForgeTypeId RasterSymbolPixelheight { get ; }` |
| Property | RasterSymbolPixelwidth | — | `public static ForgeTypeId RasterSymbolPixelwidth { get ; }` |
| Property | RasterSymbolResolution | — | `public static ForgeTypeId RasterSymbolResolution { get ; }` |
| Property | RasterSymbolViewname | — | `public static ForgeTypeId RasterSymbolViewname { get ; }` |
| Property | RasterSymbolWidth | — | `public static ForgeTypeId RasterSymbolWidth { get ; }` |
| Property | RasterVerticalScale | — | `public static ForgeTypeId RasterVerticalScale { get ; }` |
| Property | RbsAdditionalFlow | — | `public static ForgeTypeId RbsAdditionalFlow { get ; }` |
| Property | RbsAdjustableConnector | — | `public static ForgeTypeId RbsAdjustableConnector { get ; }` |
| Property | RbsAreaBasedLoadType | — | `public static ForgeTypeId RbsAreaBasedLoadType { get ; }` |
| Property | RbsBuildingConstructionclass | — | `public static ForgeTypeId RbsBuildingConstructionclass { get ; }` |
| Property | RbsBuildingUseloadcredits | — | `public static ForgeTypeId RbsBuildingUseloadcredits { get ; }` |
| Property | RbsCabletrayBendradius | — | `public static ForgeTypeId RbsCabletrayBendradius { get ; }` |
| Property | RbsCabletrayHeightParam | — | `public static ForgeTypeId RbsCabletrayHeightParam { get ; }` |
| Property | RbsCabletrayRungheight | — | `public static ForgeTypeId RbsCabletrayRungheight { get ; }` |
| Property | RbsCabletrayRungspace | — | `public static ForgeTypeId RbsCabletrayRungspace { get ; }` |
| Property | RbsCabletrayRungwidth | — | `public static ForgeTypeId RbsCabletrayRungwidth { get ; }` |
| Property | RbsCabletrayShapetype | — | `public static ForgeTypeId RbsCabletrayShapetype { get ; }` |
| Property | RbsCabletrayThickness | — | `public static ForgeTypeId RbsCabletrayThickness { get ; }` |
| Property | RbsCabletrayWidthParam | — | `public static ForgeTypeId RbsCabletrayWidthParam { get ; }` |
| Property | RbsCabletrayconduitBendorfitting | — | `public static ForgeTypeId RbsCabletrayconduitBendorfitting { get ; }` |
| Property | RbsCabletrayconduitConnectorelemType | — | `public static ForgeTypeId RbsCabletrayconduitConnectorelemType { get ; }` |
| Property | RbsCabletrayconduitSystemType | — | `public static ForgeTypeId RbsCabletrayconduitSystemType { get ; }` |
| Property | RbsCabletrayconduitrunLengthParam | — | `public static ForgeTypeId RbsCabletrayconduitrunLengthParam { get ; }` |
| Property | RbsCabletrayrunHeightParam | — | `public static ForgeTypeId RbsCabletrayrunHeightParam { get ; }` |
| Property | RbsCabletrayrunWidthParam | — | `public static ForgeTypeId RbsCabletrayrunWidthParam { get ; }` |
| Property | RbsCalculatedSize | — | `public static ForgeTypeId RbsCalculatedSize { get ; }` |
| Property | RbsComponentClassificationParam | — | `public static ForgeTypeId RbsComponentClassificationParam { get ; }` |
| Property | RbsConduitBendradius | — | `public static ForgeTypeId RbsConduitBendradius { get ; }` |
| Property | RbsConduitDiameterParam | — | `public static ForgeTypeId RbsConduitDiameterParam { get ; }` |
| Property | RbsConduitInnerDiamParam | — | `public static ForgeTypeId RbsConduitInnerDiamParam { get ; }` |
| Property | RbsConduitOuterDiamParam | — | `public static ForgeTypeId RbsConduitOuterDiamParam { get ; }` |
| Property | RbsConduitTradesize | — | `public static ForgeTypeId RbsConduitTradesize { get ; }` |
| Property | RbsConduitrunDiameterParam | — | `public static ForgeTypeId RbsConduitrunDiameterParam { get ; }` |
| Property | RbsConduitrunInnerDiamParam | — | `public static ForgeTypeId RbsConduitrunInnerDiamParam { get ; }` |
| Property | RbsConduitrunOuterDiamParam | — | `public static ForgeTypeId RbsConduitrunOuterDiamParam { get ; }` |
| Property | RbsConnectorDescription | — | `public static ForgeTypeId RbsConnectorDescription { get ; }` |
| Property | RbsConnectorIsprimary | — | `public static ForgeTypeId RbsConnectorIsprimary { get ; }` |
| Property | RbsConnectorOffsetObsolete | — | `public static ForgeTypeId RbsConnectorOffsetObsolete { get ; }` |
| Property | RbsConstructionSetParam | — | `public static ForgeTypeId RbsConstructionSetParam { get ; }` |
| Property | RbsConstructionTypeShadingfactorParam | — | `public static ForgeTypeId RbsConstructionTypeShadingfactorParam { get ; }` |
| Property | RbsCtcBottomElevation | — | `public static ForgeTypeId RbsCtcBottomElevation { get ; }` |
| Property | RbsCtcServiceType | — | `public static ForgeTypeId RbsCtcServiceType { get ; }` |
| Property | RbsCtcTopElevation | — | `public static ForgeTypeId RbsCtcTopElevation { get ; }` |
| Property | RbsCurveDiameterParam | — | `public static ForgeTypeId RbsCurveDiameterParam { get ; }` |
| Property | RbsCurveHeightParam | — | `public static ForgeTypeId RbsCurveHeightParam { get ; }` |
| Property | RbsCurveHorOffsetParam | — | `public static ForgeTypeId RbsCurveHorOffsetParam { get ; }` |
| Property | RbsCurveSlope | — | `public static ForgeTypeId RbsCurveSlope { get ; }` |
| Property | RbsCurveSurfaceArea | — | `public static ForgeTypeId RbsCurveSurfaceArea { get ; }` |
| Property | RbsCurveUtslope | — | `public static ForgeTypeId RbsCurveUtslope { get ; }` |
| Property | RbsCurveVertOffsetParam | — | `public static ForgeTypeId RbsCurveVertOffsetParam { get ; }` |
| Property | RbsCurveWidthParam | — | `public static ForgeTypeId RbsCurveWidthParam { get ; }` |
| Property | RbsCurvetypeDefaultBendParam | — | `public static ForgeTypeId RbsCurvetypeDefaultBendParam { get ; }` |
| Property | RbsCurvetypeDefaultCapParam | — | `public static ForgeTypeId RbsCurvetypeDefaultCapParam { get ; }` |
| Property | RbsCurvetypeDefaultCrossParam | — | `public static ForgeTypeId RbsCurvetypeDefaultCrossParam { get ; }` |
| Property | RbsCurvetypeDefaultElbowParam | — | `public static ForgeTypeId RbsCurvetypeDefaultElbowParam { get ; }` |
| Property | RbsCurvetypeDefaultElbowdownParam | — | `public static ForgeTypeId RbsCurvetypeDefaultElbowdownParam { get ; }` |
| Property | RbsCurvetypeDefaultElbowupParam | — | `public static ForgeTypeId RbsCurvetypeDefaultElbowupParam { get ; }` |
| Property | RbsCurvetypeDefaultHorizontalBendParam | — | `public static ForgeTypeId RbsCurvetypeDefaultHorizontalBendParam { get ; }` |
| Property | RbsCurvetypeDefaultMechjointParam | — | `public static ForgeTypeId RbsCurvetypeDefaultMechjointParam { get ; }` |
| Property | RbsCurvetypeDefaultTakeoffParam | — | `public static ForgeTypeId RbsCurvetypeDefaultTakeoffParam { get ; }` |
| Property | RbsCurvetypeDefaultTeeParam | — | `public static ForgeTypeId RbsCurvetypeDefaultTeeParam { get ; }` |
| Property | RbsCurvetypeDefaultTeedownParam | — | `public static ForgeTypeId RbsCurvetypeDefaultTeedownParam { get ; }` |
| Property | RbsCurvetypeDefaultTeeupParam | — | `public static ForgeTypeId RbsCurvetypeDefaultTeeupParam { get ; }` |
| Property | RbsCurvetypeDefaultTransitionParam | — | `public static ForgeTypeId RbsCurvetypeDefaultTransitionParam { get ; }` |
| Property | RbsCurvetypeDefaultUnionParam | — | `public static ForgeTypeId RbsCurvetypeDefaultUnionParam { get ; }` |
| Property | RbsCurvetypeMaxHeightParam | — | `public static ForgeTypeId RbsCurvetypeMaxHeightParam { get ; }` |
| Property | RbsCurvetypeMaxWidthParam | — | `public static ForgeTypeId RbsCurvetypeMaxWidthParam { get ; }` |
| Property | RbsCurvetypeMultishapeTransitionOvalroundParam | — | `public static ForgeTypeId RbsCurvetypeMultishapeTransitionOvalroundParam { get ; }` |
| Property | RbsCurvetypeMultishapeTransitionParam | — | `public static ForgeTypeId RbsCurvetypeMultishapeTransitionParam { get ; }` |
| Property | RbsCurvetypeMultishapeTransitionRectovalParam | — | `public static ForgeTypeId RbsCurvetypeMultishapeTransitionRectovalParam { get ; }` |
| Property | RbsCurvetypePreferredBranchParam | — | `public static ForgeTypeId RbsCurvetypePreferredBranchParam { get ; }` |
| Property | RbsDistributionsysConfigParam | — | `public static ForgeTypeId RbsDistributionsysConfigParam { get ; }` |
| Property | RbsDistributionsysNumwiresParam | — | `public static ForgeTypeId RbsDistributionsysNumwiresParam { get ; }` |
| Property | RbsDistributionsysPhaseParam | — | `public static ForgeTypeId RbsDistributionsysPhaseParam { get ; }` |
| Property | RbsDistributionsysVlgParam | — | `public static ForgeTypeId RbsDistributionsysVlgParam { get ; }` |
| Property | RbsDistributionsysVllParam | — | `public static ForgeTypeId RbsDistributionsysVllParam { get ; }` |
| Property | RbsDuctBottomElevation | — | `public static ForgeTypeId RbsDuctBottomElevation { get ; }` |
| Property | RbsDuctCalculatedSize | — | `public static ForgeTypeId RbsDuctCalculatedSize { get ; }` |
| Property | RbsDuctConnectorSystemClassificationParam | — | `public static ForgeTypeId RbsDuctConnectorSystemClassificationParam { get ; }` |
| Property | RbsDuctFittingLossMethodParam | — | `public static ForgeTypeId RbsDuctFittingLossMethodParam { get ; }` |
| Property | RbsDuctFittingLossMethodServerParam | — | `public static ForgeTypeId RbsDuctFittingLossMethodServerParam { get ; }` |
| Property | RbsDuctFittingLossMethodSettings | — | `public static ForgeTypeId RbsDuctFittingLossMethodSettings { get ; }` |
| Property | RbsDuctFittingLossTableParam | — | `public static ForgeTypeId RbsDuctFittingLossTableParam { get ; }` |
| Property | RbsDuctFlowConfigurationParam | — | `public static ForgeTypeId RbsDuctFlowConfigurationParam { get ; }` |
| Property | RbsDuctFlowDirectionParam | — | `public static ForgeTypeId RbsDuctFlowDirectionParam { get ; }` |
| Property | RbsDuctFlowParam | — | `public static ForgeTypeId RbsDuctFlowParam { get ; }` |
| Property | RbsDuctPipeSystemAbbreviationParam | — | `public static ForgeTypeId RbsDuctPipeSystemAbbreviationParam { get ; }` |
| Property | RbsDuctPressureDrop | — | `public static ForgeTypeId RbsDuctPressureDrop { get ; }` |
| Property | RbsDuctRoutingPreferenceParam | — | `public static ForgeTypeId RbsDuctRoutingPreferenceParam { get ; }` |
| Property | RbsDuctSizeFormattedParam | — | `public static ForgeTypeId RbsDuctSizeFormattedParam { get ; }` |
| Property | RbsDuctSlope | — | `public static ForgeTypeId RbsDuctSlope { get ; }` |
| Property | RbsDuctStaticPressure | — | `public static ForgeTypeId RbsDuctStaticPressure { get ; }` |
| Property | RbsDuctSystemCalculationParam | — | `public static ForgeTypeId RbsDuctSystemCalculationParam { get ; }` |
| Property | RbsDuctSystemTypeParam | — | `public static ForgeTypeId RbsDuctSystemTypeParam { get ; }` |
| Property | RbsDuctTopElevation | — | `public static ForgeTypeId RbsDuctTopElevation { get ; }` |
| Property | RbsDuctTypeParam | — | `public static ForgeTypeId RbsDuctTypeParam { get ; }` |
| Property | RbsElecAmbientTemperature | — | `public static ForgeTypeId RbsElecAmbientTemperature { get ; }` |
| Property | RbsElecAnalyticalArea | — | `public static ForgeTypeId RbsElecAnalyticalArea { get ; }` |
| Property | RbsElecAnalyticalFeederLength | — | `public static ForgeTypeId RbsElecAnalyticalFeederLength { get ; }` |
| Property | RbsElecAnalyticalLevelId | — | `public static ForgeTypeId RbsElecAnalyticalLevelId { get ; }` |
| Property | RbsElecAnalyticalLoadDensity | — | `public static ForgeTypeId RbsElecAnalyticalLoadDensity { get ; }` |
| Property | RbsElecAnalyticalLoadNameParam | — | `public static ForgeTypeId RbsElecAnalyticalLoadNameParam { get ; }` |
| Property | RbsElecAnalyticalLoadSetOnDuty | — | `public static ForgeTypeId RbsElecAnalyticalLoadSetOnDuty { get ; }` |
| Property | RbsElecAnalyticalLoadSetOnStandby | — | `public static ForgeTypeId RbsElecAnalyticalLoadSetOnStandby { get ; }` |
| Property | RbsElecAnalyticalLoadSetOnTotal | — | `public static ForgeTypeId RbsElecAnalyticalLoadSetOnTotal { get ; }` |
| Property | RbsElecAnalyticalLoadTypeParam | — | `public static ForgeTypeId RbsElecAnalyticalLoadTypeParam { get ; }` |
| Property | RbsElecAnalyticalLoadsInSet | — | `public static ForgeTypeId RbsElecAnalyticalLoadsInSet { get ; }` |
| Property | RbsElecAnalyticalTotalCoincidentLoad | — | `public static ForgeTypeId RbsElecAnalyticalTotalCoincidentLoad { get ; }` |
| Property | RbsElecApparentCurrentParam | — | `public static ForgeTypeId RbsElecApparentCurrentParam { get ; }` |
| Property | RbsElecApparentCurrentPhaseaParam | — | `public static ForgeTypeId RbsElecApparentCurrentPhaseaParam { get ; }` |
| Property | RbsElecApparentCurrentPhasebParam | — | `public static ForgeTypeId RbsElecApparentCurrentPhasebParam { get ; }` |
| Property | RbsElecApparentCurrentPhasecParam | — | `public static ForgeTypeId RbsElecApparentCurrentPhasecParam { get ; }` |
| Property | RbsElecApparentLoad | — | `public static ForgeTypeId RbsElecApparentLoad { get ; }` |
| Property | RbsElecApparentLoadPhase1 | — | `public static ForgeTypeId RbsElecApparentLoadPhase1 { get ; }` |
| Property | RbsElecApparentLoadPhase2 | — | `public static ForgeTypeId RbsElecApparentLoadPhase2 { get ; }` |
| Property | RbsElecApparentLoadPhase3 | — | `public static ForgeTypeId RbsElecApparentLoadPhase3 { get ; }` |
| Property | RbsElecApparentLoadPhasea | — | `public static ForgeTypeId RbsElecApparentLoadPhasea { get ; }` |
| Property | RbsElecApparentLoadPhaseb | — | `public static ForgeTypeId RbsElecApparentLoadPhaseb { get ; }` |
| Property | RbsElecApparentLoadPhasec | — | `public static ForgeTypeId RbsElecApparentLoadPhasec { get ; }` |
| Property | RbsElecApparentPowerDensity | — | `public static ForgeTypeId RbsElecApparentPowerDensity { get ; }` |
| Property | RbsElecBalancedLoad | — | `public static ForgeTypeId RbsElecBalancedLoad { get ; }` |
| Property | RbsElecCalcCoefficientUtilization | — | `public static ForgeTypeId RbsElecCalcCoefficientUtilization { get ; }` |
| Property | RbsElecCircuitConnectionTypeParam | — | `public static ForgeTypeId RbsElecCircuitConnectionTypeParam { get ; }` |
| Property | RbsElecCircuitFrameParam | — | `public static ForgeTypeId RbsElecCircuitFrameParam { get ; }` |
| Property | RbsElecCircuitLengthParam | — | `public static ForgeTypeId RbsElecCircuitLengthParam { get ; }` |
| Property | RbsElecCircuitName | — | `public static ForgeTypeId RbsElecCircuitName { get ; }` |
| Property | RbsElecCircuitNaming | — | `public static ForgeTypeId RbsElecCircuitNaming { get ; }` |
| Property | RbsElecCircuitNamingIndex | — | `public static ForgeTypeId RbsElecCircuitNamingIndex { get ; }` |
| Property | RbsElecCircuitNotesParam | — | `public static ForgeTypeId RbsElecCircuitNotesParam { get ; }` |
| Property | RbsElecCircuitNumber | — | `public static ForgeTypeId RbsElecCircuitNumber { get ; }` |
| Property | RbsElecCircuitNumberOfElementsParam | — | `public static ForgeTypeId RbsElecCircuitNumberOfElementsParam { get ; }` |
| Property | RbsElecCircuitNumberingType | — | `public static ForgeTypeId RbsElecCircuitNumberingType { get ; }` |
| Property | RbsElecCircuitPanelParam | — | `public static ForgeTypeId RbsElecCircuitPanelParam { get ; }` |
| Property | RbsElecCircuitPathModeParam | — | `public static ForgeTypeId RbsElecCircuitPathModeParam { get ; }` |
| Property | RbsElecCircuitPathOffsetParam | — | `public static ForgeTypeId RbsElecCircuitPathOffsetParam { get ; }` |
| Property | RbsElecCircuitPrefix | — | `public static ForgeTypeId RbsElecCircuitPrefix { get ; }` |
| Property | RbsElecCircuitPrefixSeparator | — | `public static ForgeTypeId RbsElecCircuitPrefixSeparator { get ; }` |
| Property | RbsElecCircuitRatingParam | — | `public static ForgeTypeId RbsElecCircuitRatingParam { get ; }` |
| Property | RbsElecCircuitSlotIndex | — | `public static ForgeTypeId RbsElecCircuitSlotIndex { get ; }` |
| Property | RbsElecCircuitStartSlot | — | `public static ForgeTypeId RbsElecCircuitStartSlot { get ; }` |
| Property | RbsElecCircuitType | — | `public static ForgeTypeId RbsElecCircuitType { get ; }` |
| Property | RbsElecCircuitWireNumGroundsParam | — | `public static ForgeTypeId RbsElecCircuitWireNumGroundsParam { get ; }` |
| Property | RbsElecCircuitWireNumHotsParam | — | `public static ForgeTypeId RbsElecCircuitWireNumHotsParam { get ; }` |
| Property | RbsElecCircuitWireNumNeutralsParam | — | `public static ForgeTypeId RbsElecCircuitWireNumNeutralsParam { get ; }` |
| Property | RbsElecCircuitWireNumRunsParam | — | `public static ForgeTypeId RbsElecCircuitWireNumRunsParam { get ; }` |
| Property | RbsElecCircuitWireSizeParam | — | `public static ForgeTypeId RbsElecCircuitWireSizeParam { get ; }` |
| Property | RbsElecCircuitWireTypeParam | — | `public static ForgeTypeId RbsElecCircuitWireTypeParam { get ; }` |
| Property | RbsElecDemandfactorDemandloadParam | — | `public static ForgeTypeId RbsElecDemandfactorDemandloadParam { get ; }` |
| Property | RbsElecDemandfactorLoadParam | — | `public static ForgeTypeId RbsElecDemandfactorLoadParam { get ; }` |
| Property | RbsElecDemandfactorLoadclassificationParam | — | `public static ForgeTypeId RbsElecDemandfactorLoadclassificationParam { get ; }` |
| Property | RbsElecDistributionNodeLoadSet | — | `public static ForgeTypeId RbsElecDistributionNodeLoadSet { get ; }` |
| Property | RbsElecDistributionNodeSupplyFrom | — | `public static ForgeTypeId RbsElecDistributionNodeSupplyFrom { get ; }` |
| Property | RbsElecDistributionNodeSupplyFrom1 | — | `public static ForgeTypeId RbsElecDistributionNodeSupplyFrom1 { get ; }` |
| Property | RbsElecDistributionNodeSupplyFrom2 | — | `public static ForgeTypeId RbsElecDistributionNodeSupplyFrom2 { get ; }` |
| Property | RbsElecDistributionNodeSupplyTo | — | `public static ForgeTypeId RbsElecDistributionNodeSupplyTo { get ; }` |
| Property | RbsElecEditCircuitNamingSettingsParam | — | `public static ForgeTypeId RbsElecEditCircuitNamingSettingsParam { get ; }` |
| Property | RbsElecEnclosure | — | `public static ForgeTypeId RbsElecEnclosure { get ; }` |
| Property | RbsElecLoadClassification | — | `public static ForgeTypeId RbsElecLoadClassification { get ; }` |
| Property | RbsElecLoadsummaryConnectedCurrentParam | — | `public static ForgeTypeId RbsElecLoadsummaryConnectedCurrentParam { get ; }` |
| Property | RbsElecLoadsummaryConnectedLoadParam | — | `public static ForgeTypeId RbsElecLoadsummaryConnectedLoadParam { get ; }` |
| Property | RbsElecLoadsummaryDemandCurrentParam | — | `public static ForgeTypeId RbsElecLoadsummaryDemandCurrentParam { get ; }` |
| Property | RbsElecLoadsummaryDemandFactorParam | — | `public static ForgeTypeId RbsElecLoadsummaryDemandFactorParam { get ; }` |
| Property | RbsElecLoadsummaryDemandFactorRuleParam | — | `public static ForgeTypeId RbsElecLoadsummaryDemandFactorRuleParam { get ; }` |
| Property | RbsElecLoadsummaryDemandLoadParam | — | `public static ForgeTypeId RbsElecLoadsummaryDemandLoadParam { get ; }` |
| Property | RbsElecLoadsummaryLoadclassificationParam | — | `public static ForgeTypeId RbsElecLoadsummaryLoadclassificationParam { get ; }` |
| Property | RbsElecMains | — | `public static ForgeTypeId RbsElecMains { get ; }` |
| Property | RbsElecMaxPoleBreakers | — | `public static ForgeTypeId RbsElecMaxPoleBreakers { get ; }` |
| Property | RbsElecModifications | — | `public static ForgeTypeId RbsElecModifications { get ; }` |
| Property | RbsElecMounting | — | `public static ForgeTypeId RbsElecMounting { get ; }` |
| Property | RbsElecNumberOfCircuits | — | `public static ForgeTypeId RbsElecNumberOfCircuits { get ; }` |
| Property | RbsElecNumberOfPoles | — | `public static ForgeTypeId RbsElecNumberOfPoles { get ; }` |
| Property | RbsElecPanelBranchCircuitApparentLoadPhasea | — | `public static ForgeTypeId RbsElecPanelBranchCircuitApparentLoadPhasea { get ; }` |
| Property | RbsElecPanelBranchCircuitApparentLoadPhaseb | — | `public static ForgeTypeId RbsElecPanelBranchCircuitApparentLoadPhaseb { get ; }` |
| Property | RbsElecPanelBranchCircuitApparentLoadPhasec | — | `public static ForgeTypeId RbsElecPanelBranchCircuitApparentLoadPhasec { get ; }` |
| Property | RbsElecPanelBranchCircuitCurrentPhasea | — | `public static ForgeTypeId RbsElecPanelBranchCircuitCurrentPhasea { get ; }` |
| Property | RbsElecPanelBranchCircuitCurrentPhaseb | — | `public static ForgeTypeId RbsElecPanelBranchCircuitCurrentPhaseb { get ; }` |
| Property | RbsElecPanelBranchCircuitCurrentPhasec | — | `public static ForgeTypeId RbsElecPanelBranchCircuitCurrentPhasec { get ; }` |
| Property | RbsElecPanelBussingParam | — | `public static ForgeTypeId RbsElecPanelBussingParam { get ; }` |
| Property | RbsElecPanelConfigurationParam | — | `public static ForgeTypeId RbsElecPanelConfigurationParam { get ; }` |
| Property | RbsElecPanelCurrentPhaseaParam | — | `public static ForgeTypeId RbsElecPanelCurrentPhaseaParam { get ; }` |
| Property | RbsElecPanelCurrentPhasebParam | — | `public static ForgeTypeId RbsElecPanelCurrentPhasebParam { get ; }` |
| Property | RbsElecPanelCurrentPhasecParam | — | `public static ForgeTypeId RbsElecPanelCurrentPhasecParam { get ; }` |
| Property | RbsElecPanelFeedParam | — | `public static ForgeTypeId RbsElecPanelFeedParam { get ; }` |
| Property | RbsElecPanelFeedThruLugsApparentLoadPhasea | — | `public static ForgeTypeId RbsElecPanelFeedThruLugsApparentLoadPhasea { get ; }` |
| Property | RbsElecPanelFeedThruLugsApparentLoadPhaseb | — | `public static ForgeTypeId RbsElecPanelFeedThruLugsApparentLoadPhaseb { get ; }` |
| Property | RbsElecPanelFeedThruLugsApparentLoadPhasec | — | `public static ForgeTypeId RbsElecPanelFeedThruLugsApparentLoadPhasec { get ; }` |
| Property | RbsElecPanelFeedThruLugsCurrentPhasea | — | `public static ForgeTypeId RbsElecPanelFeedThruLugsCurrentPhasea { get ; }` |
| Property | RbsElecPanelFeedThruLugsCurrentPhaseb | — | `public static ForgeTypeId RbsElecPanelFeedThruLugsCurrentPhaseb { get ; }` |
| Property | RbsElecPanelFeedThruLugsCurrentPhasec | — | `public static ForgeTypeId RbsElecPanelFeedThruLugsCurrentPhasec { get ; }` |
| Property | RbsElecPanelFeedThruLugsParam | — | `public static ForgeTypeId RbsElecPanelFeedThruLugsParam { get ; }` |
| Property | RbsElecPanelGroundBusParam | — | `public static ForgeTypeId RbsElecPanelGroundBusParam { get ; }` |
| Property | RbsElecPanelLocationParam | — | `public static ForgeTypeId RbsElecPanelLocationParam { get ; }` |
| Property | RbsElecPanelMainstypeParam | — | `public static ForgeTypeId RbsElecPanelMainstypeParam { get ; }` |
| Property | RbsElecPanelMcbRatingParam | — | `public static ForgeTypeId RbsElecPanelMcbRatingParam { get ; }` |
| Property | RbsElecPanelName | — | `public static ForgeTypeId RbsElecPanelName { get ; }` |
| Property | RbsElecPanelNeutralBusParam | — | `public static ForgeTypeId RbsElecPanelNeutralBusParam { get ; }` |
| Property | RbsElecPanelNeutralRatingParam | — | `public static ForgeTypeId RbsElecPanelNeutralRatingParam { get ; }` |
| Property | RbsElecPanelNumphasesParam | — | `public static ForgeTypeId RbsElecPanelNumphasesParam { get ; }` |
| Property | RbsElecPanelNumwiresParam | — | `public static ForgeTypeId RbsElecPanelNumwiresParam { get ; }` |
| Property | RbsElecPanelScheduleFooterNotesParam | — | `public static ForgeTypeId RbsElecPanelScheduleFooterNotesParam { get ; }` |
| Property | RbsElecPanelScheduleHeaderNotesParam | — | `public static ForgeTypeId RbsElecPanelScheduleHeaderNotesParam { get ; }` |
| Property | RbsElecPanelSubfeedLugsParam | — | `public static ForgeTypeId RbsElecPanelSubfeedLugsParam { get ; }` |
| Property | RbsElecPanelSupplyFromParam | — | `public static ForgeTypeId RbsElecPanelSupplyFromParam { get ; }` |
| Property | RbsElecPanelTotalConnectedCurrentParam | — | `public static ForgeTypeId RbsElecPanelTotalConnectedCurrentParam { get ; }` |
| Property | RbsElecPanelTotalDemandCurrentParam | — | `public static ForgeTypeId RbsElecPanelTotalDemandCurrentParam { get ; }` |
| Property | RbsElecPanelTotalDemandFactorParam | — | `public static ForgeTypeId RbsElecPanelTotalDemandFactorParam { get ; }` |
| Property | RbsElecPanelTotalestloadHvacParam | — | `public static ForgeTypeId RbsElecPanelTotalestloadHvacParam { get ; }` |
| Property | RbsElecPanelTotalestloadLightParam | — | `public static ForgeTypeId RbsElecPanelTotalestloadLightParam { get ; }` |
| Property | RbsElecPanelTotalestloadOtherParam | — | `public static ForgeTypeId RbsElecPanelTotalestloadOtherParam { get ; }` |
| Property | RbsElecPanelTotalestloadParam | — | `public static ForgeTypeId RbsElecPanelTotalestloadParam { get ; }` |
| Property | RbsElecPanelTotalestloadPowerParam | — | `public static ForgeTypeId RbsElecPanelTotalestloadPowerParam { get ; }` |
| Property | RbsElecPanelTotalloadHvacParam | — | `public static ForgeTypeId RbsElecPanelTotalloadHvacParam { get ; }` |
| Property | RbsElecPanelTotalloadLightParam | — | `public static ForgeTypeId RbsElecPanelTotalloadLightParam { get ; }` |
| Property | RbsElecPanelTotalloadOtherParam | — | `public static ForgeTypeId RbsElecPanelTotalloadOtherParam { get ; }` |
| Property | RbsElecPanelTotalloadParam | — | `public static ForgeTypeId RbsElecPanelTotalloadParam { get ; }` |
| Property | RbsElecPanelTotalloadPowerParam | — | `public static ForgeTypeId RbsElecPanelTotalloadPowerParam { get ; }` |
| Property | RbsElecPowerFactor | — | `public static ForgeTypeId RbsElecPowerFactor { get ; }` |
| Property | RbsElecPowerFactorState | — | `public static ForgeTypeId RbsElecPowerFactorState { get ; }` |
| Property | RbsElecRoomAverageIllumination | — | `public static ForgeTypeId RbsElecRoomAverageIllumination { get ; }` |
| Property | RbsElecRoomCavityRatio | — | `public static ForgeTypeId RbsElecRoomCavityRatio { get ; }` |
| Property | RbsElecRoomLightingCalcLuminaireplane | — | `public static ForgeTypeId RbsElecRoomLightingCalcLuminaireplane { get ; }` |
| Property | RbsElecRoomLightingCalcWorkplane | — | `public static ForgeTypeId RbsElecRoomLightingCalcWorkplane { get ; }` |
| Property | RbsElecRoomReflectivityCeiling | — | `public static ForgeTypeId RbsElecRoomReflectivityCeiling { get ; }` |
| Property | RbsElecRoomReflectivityFloor | — | `public static ForgeTypeId RbsElecRoomReflectivityFloor { get ; }` |
| Property | RbsElecRoomReflectivityWalls | — | `public static ForgeTypeId RbsElecRoomReflectivityWalls { get ; }` |
| Property | RbsElecShortCircuitRating | — | `public static ForgeTypeId RbsElecShortCircuitRating { get ; }` |
| Property | RbsElecSwitchIdParam | — | `public static ForgeTypeId RbsElecSwitchIdParam { get ; }` |
| Property | RbsElecTrueCurrentParam | — | `public static ForgeTypeId RbsElecTrueCurrentParam { get ; }` |
| Property | RbsElecTrueCurrentPhaseaParam | — | `public static ForgeTypeId RbsElecTrueCurrentPhaseaParam { get ; }` |
| Property | RbsElecTrueCurrentPhasebParam | — | `public static ForgeTypeId RbsElecTrueCurrentPhasebParam { get ; }` |
| Property | RbsElecTrueCurrentPhasecParam | — | `public static ForgeTypeId RbsElecTrueCurrentPhasecParam { get ; }` |
| Property | RbsElecTrueLoad | — | `public static ForgeTypeId RbsElecTrueLoad { get ; }` |
| Property | RbsElecTrueLoadPhase1 | — | `public static ForgeTypeId RbsElecTrueLoadPhase1 { get ; }` |
| Property | RbsElecTrueLoadPhase2 | — | `public static ForgeTypeId RbsElecTrueLoadPhase2 { get ; }` |
| Property | RbsElecTrueLoadPhase3 | — | `public static ForgeTypeId RbsElecTrueLoadPhase3 { get ; }` |
| Property | RbsElecTrueLoadPhasea | — | `public static ForgeTypeId RbsElecTrueLoadPhasea { get ; }` |
| Property | RbsElecTrueLoadPhaseb | — | `public static ForgeTypeId RbsElecTrueLoadPhaseb { get ; }` |
| Property | RbsElecTrueLoadPhasec | — | `public static ForgeTypeId RbsElecTrueLoadPhasec { get ; }` |
| Property | RbsElecVoltage | — | `public static ForgeTypeId RbsElecVoltage { get ; }` |
| Property | RbsElecVoltageDropParam | — | `public static ForgeTypeId RbsElecVoltageDropParam { get ; }` |
| Property | RbsElecWireCircuits | — | `public static ForgeTypeId RbsElecWireCircuits { get ; }` |
| Property | RbsElecWireElevation | — | `public static ForgeTypeId RbsElecWireElevation { get ; }` |
| Property | RbsElecWireGroundAdjustment | — | `public static ForgeTypeId RbsElecWireGroundAdjustment { get ; }` |
| Property | RbsElecWireHotAdjustment | — | `public static ForgeTypeId RbsElecWireHotAdjustment { get ; }` |
| Property | RbsElecWireNeutralAdjustment | — | `public static ForgeTypeId RbsElecWireNeutralAdjustment { get ; }` |
| Property | RbsElecWireShareGround | — | `public static ForgeTypeId RbsElecWireShareGround { get ; }` |
| Property | RbsElecWireShareNeutral | — | `public static ForgeTypeId RbsElecWireShareNeutral { get ; }` |
| Property | RbsElecWireTickmarkState | — | `public static ForgeTypeId RbsElecWireTickmarkState { get ; }` |
| Property | RbsElecWireType | — | `public static ForgeTypeId RbsElecWireType { get ; }` |
| Property | RbsElectricalData | — | `public static ForgeTypeId RbsElectricalData { get ; }` |
| Property | RbsEndLevelParam | — | `public static ForgeTypeId RbsEndLevelParam { get ; }` |
| Property | RbsEndOffsetParam | — | `public static ForgeTypeId RbsEndOffsetParam { get ; }` |
| Property | RbsEnergyAnalysisBuildingEnvelopeAnalyticalGridCellSize | — | `public static ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeAnalyticalGridCellSize { get ; }` |
| Property | RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution | — | `public static ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution { get ; }` |
| Property | RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution | — | `public static ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution { get ; }` |
| Property | RbsEnergyAnalysisBuildingEnvelopeDeterminationParam | — | `public static ForgeTypeId RbsEnergyAnalysisBuildingEnvelopeDeterminationParam { get ; }` |
| Property | RbsEnergyAnalysisExportCategoryParam | — | `public static ForgeTypeId RbsEnergyAnalysisExportCategoryParam { get ; }` |
| Property | RbsEnergyAnalysisExportComplexityParam | — | `public static ForgeTypeId RbsEnergyAnalysisExportComplexityParam { get ; }` |
| Property | RbsEnergyAnalysisExportGbxmlDefaultsParam | — | `public static ForgeTypeId RbsEnergyAnalysisExportGbxmlDefaultsParam { get ; }` |
| Property | RbsEnergyAnalysisGroundPlaneParam | — | `public static ForgeTypeId RbsEnergyAnalysisGroundPlaneParam { get ; }` |
| Property | RbsEnergyAnalysisIncludeThermalProperties | — | `public static ForgeTypeId RbsEnergyAnalysisIncludeThermalProperties { get ; }` |
| Property | RbsEnergyAnalysisMode | — | `public static ForgeTypeId RbsEnergyAnalysisMode { get ; }` |
| Property | RbsEnergyAnalysisProjectPhaseParam | — | `public static ForgeTypeId RbsEnergyAnalysisProjectPhaseParam { get ; }` |
| Property | RbsEnergyAnalysisSliverSpaceTolerance | — | `public static ForgeTypeId RbsEnergyAnalysisSliverSpaceTolerance { get ; }` |
| Property | RbsEnergyAnalysisSurfaceAdjacentSpaceId1 | — | `public static ForgeTypeId RbsEnergyAnalysisSurfaceAdjacentSpaceId1 { get ; }` |
| Property | RbsEnergyAnalysisSurfaceAdjacentSpaceId2 | — | `public static ForgeTypeId RbsEnergyAnalysisSurfaceAdjacentSpaceId2 { get ; }` |
| Property | RbsEnergyAnalysisSurfaceAzimuth | — | `public static ForgeTypeId RbsEnergyAnalysisSurfaceAzimuth { get ; }` |
| Property | RbsEnergyAnalysisSurfaceCadobjectid | — | `public static ForgeTypeId RbsEnergyAnalysisSurfaceCadobjectid { get ; }` |
| Property | RbsEnergyAnalysisSurfaceOriginX | — | `public static ForgeTypeId RbsEnergyAnalysisSurfaceOriginX { get ; }` |
| Property | RbsEnergyAnalysisSurfaceOriginY | — | `public static ForgeTypeId RbsEnergyAnalysisSurfaceOriginY { get ; }` |
| Property | RbsEnergyAnalysisSurfaceOriginZ | — | `public static ForgeTypeId RbsEnergyAnalysisSurfaceOriginZ { get ; }` |
| Property | RbsEnergyAnalysisSurfaceTilt | — | `public static ForgeTypeId RbsEnergyAnalysisSurfaceTilt { get ; }` |
| Property | RbsEnergyAnalysisViewBuildingShellMode | — | `public static ForgeTypeId RbsEnergyAnalysisViewBuildingShellMode { get ; }` |
| Property | RbsEnergyAnalysisViewCoordAxisMode | — | `public static ForgeTypeId RbsEnergyAnalysisViewCoordAxisMode { get ; }` |
| Property | RbsEnergyAnalysisViewInnerShellMode | — | `public static ForgeTypeId RbsEnergyAnalysisViewInnerShellMode { get ; }` |
| Property | RbsEnergyAnalysisViewOuterShellMode | — | `public static ForgeTypeId RbsEnergyAnalysisViewOuterShellMode { get ; }` |
| Property | RbsEnergyAnalysisViewRbeMode | — | `public static ForgeTypeId RbsEnergyAnalysisViewRbeMode { get ; }` |
| Property | RbsEnergyAnalysisViewShadingSurfacesMode | — | `public static ForgeTypeId RbsEnergyAnalysisViewShadingSurfacesMode { get ; }` |
| Property | RbsEnergyAnalysisViewSurfacesMode | — | `public static ForgeTypeId RbsEnergyAnalysisViewSurfacesMode { get ; }` |
| Property | RbsEnergyAnalysisViewTransparentMode | — | `public static ForgeTypeId RbsEnergyAnalysisViewTransparentMode { get ; }` |
| Property | RbsEnergyAnalysisViewUpdateSurfaces | — | `public static ForgeTypeId RbsEnergyAnalysisViewUpdateSurfaces { get ; }` |
| Property | RbsEqDiameterParam | — | `public static ForgeTypeId RbsEqDiameterParam { get ; }` |
| Property | RbsFamilyContentAnnotationDisplay | — | `public static ForgeTypeId RbsFamilyContentAnnotationDisplay { get ; }` |
| Property | RbsFamilyContentDistributionSystem | — | `public static ForgeTypeId RbsFamilyContentDistributionSystem { get ; }` |
| Property | RbsFamilyContentOffsetHeight | — | `public static ForgeTypeId RbsFamilyContentOffsetHeight { get ; }` |
| Property | RbsFamilyContentOffsetWidth | — | `public static ForgeTypeId RbsFamilyContentOffsetWidth { get ; }` |
| Property | RbsFamilyContentSecondaryDistribsys | — | `public static ForgeTypeId RbsFamilyContentSecondaryDistribsys { get ; }` |
| Property | RbsFamilyContentTakeoffFixedLength | — | `public static ForgeTypeId RbsFamilyContentTakeoffFixedLength { get ; }` |
| Property | RbsFamilyContentTakeoffLength | — | `public static ForgeTypeId RbsFamilyContentTakeoffLength { get ; }` |
| Property | RbsFamilyContentTakeoffProjlength | — | `public static ForgeTypeId RbsFamilyContentTakeoffProjlength { get ; }` |
| Property | RbsFlexDuctTypeParam | — | `public static ForgeTypeId RbsFlexDuctTypeParam { get ; }` |
| Property | RbsFlexPatternParam | — | `public static ForgeTypeId RbsFlexPatternParam { get ; }` |
| Property | RbsFlexPipeTypeParam | — | `public static ForgeTypeId RbsFlexPipeTypeParam { get ; }` |
| Property | RbsFlexductRoundtypeParam | — | `public static ForgeTypeId RbsFlexductRoundtypeParam { get ; }` |
| Property | RbsFlowFactorParam | — | `public static ForgeTypeId RbsFlowFactorParam { get ; }` |
| Property | RbsFlowObsolete | — | `public static ForgeTypeId RbsFlowObsolete { get ; }` |
| Property | RbsFpSprinklerCoverageParam | — | `public static ForgeTypeId RbsFpSprinklerCoverageParam { get ; }` |
| Property | RbsFpSprinklerKFactorParam | — | `public static ForgeTypeId RbsFpSprinklerKFactorParam { get ; }` |
| Property | RbsFpSprinklerOrificeParam | — | `public static ForgeTypeId RbsFpSprinklerOrificeParam { get ; }` |
| Property | RbsFpSprinklerOrificeSizeParam | — | `public static ForgeTypeId RbsFpSprinklerOrificeSizeParam { get ; }` |
| Property | RbsFpSprinklerPressureClassParam | — | `public static ForgeTypeId RbsFpSprinklerPressureClassParam { get ; }` |
| Property | RbsFpSprinklerResponseParam | — | `public static ForgeTypeId RbsFpSprinklerResponseParam { get ; }` |
| Property | RbsFpSprinklerTemperatureRatingParam | — | `public static ForgeTypeId RbsFpSprinklerTemperatureRatingParam { get ; }` |
| Property | RbsFriction | — | `public static ForgeTypeId RbsFriction { get ; }` |
| Property | RbsGbxmlOpeningType | — | `public static ForgeTypeId RbsGbxmlOpeningType { get ; }` |
| Property | RbsGbxmlSurfaceArea | — | `public static ForgeTypeId RbsGbxmlSurfaceArea { get ; }` |
| Property | RbsGbxmlSurfaceName | — | `public static ForgeTypeId RbsGbxmlSurfaceName { get ; }` |
| Property | RbsGbxmlSurfaceType | — | `public static ForgeTypeId RbsGbxmlSurfaceType { get ; }` |
| Property | RbsHvacloadDoorAreaParam | — | `public static ForgeTypeId RbsHvacloadDoorAreaParam { get ; }` |
| Property | RbsHvacloadDoorCoolingLoadParam | — | `public static ForgeTypeId RbsHvacloadDoorCoolingLoadParam { get ; }` |
| Property | RbsHvacloadFloorAreaParam | — | `public static ForgeTypeId RbsHvacloadFloorAreaParam { get ; }` |
| Property | RbsHvacloadPartitionAreaParam | — | `public static ForgeTypeId RbsHvacloadPartitionAreaParam { get ; }` |
| Property | RbsHvacloadPartitionCoolingLoadParam | — | `public static ForgeTypeId RbsHvacloadPartitionCoolingLoadParam { get ; }` |
| Property | RbsHvacloadPlenumCoolingLoadParam | — | `public static ForgeTypeId RbsHvacloadPlenumCoolingLoadParam { get ; }` |
| Property | RbsHvacloadRoofAreaParam | — | `public static ForgeTypeId RbsHvacloadRoofAreaParam { get ; }` |
| Property | RbsHvacloadRoofCoolingLoadParam | — | `public static ForgeTypeId RbsHvacloadRoofCoolingLoadParam { get ; }` |
| Property | RbsHvacloadSkylightAreaParam | — | `public static ForgeTypeId RbsHvacloadSkylightAreaParam { get ; }` |
| Property | RbsHvacloadSkylightCoolingLoadParam | — | `public static ForgeTypeId RbsHvacloadSkylightCoolingLoadParam { get ; }` |
| Property | RbsHvacloadWallAreaParam | — | `public static ForgeTypeId RbsHvacloadWallAreaParam { get ; }` |
| Property | RbsHvacloadWallCoolingLoadParam | — | `public static ForgeTypeId RbsHvacloadWallCoolingLoadParam { get ; }` |
| Property | RbsHvacloadWindowAreaParam | — | `public static ForgeTypeId RbsHvacloadWindowAreaParam { get ; }` |
| Property | RbsHvacloadWindowCoolingLoadParam | — | `public static ForgeTypeId RbsHvacloadWindowCoolingLoadParam { get ; }` |
| Property | RbsHydraulicDiameterParam | — | `public static ForgeTypeId RbsHydraulicDiameterParam { get ; }` |
| Property | RbsInsulationLiningVolume | — | `public static ForgeTypeId RbsInsulationLiningVolume { get ; }` |
| Property | RbsInsulationThickness | — | `public static ForgeTypeId RbsInsulationThickness { get ; }` |
| Property | RbsInsulationThicknessForDuct | — | `public static ForgeTypeId RbsInsulationThicknessForDuct { get ; }` |
| Property | RbsInsulationThicknessForPipe | — | `public static ForgeTypeId RbsInsulationThicknessForPipe { get ; }` |
| Property | RbsIsCustomFitting | — | `public static ForgeTypeId RbsIsCustomFitting { get ; }` |
| Property | RbsLiningThickness | — | `public static ForgeTypeId RbsLiningThickness { get ; }` |
| Property | RbsLiningThicknessForDuct | — | `public static ForgeTypeId RbsLiningThicknessForDuct { get ; }` |
| Property | RbsLoadSubClassificationMotor | — | `public static ForgeTypeId RbsLoadSubClassificationMotor { get ; }` |
| Property | RbsLookupTableName | — | `public static ForgeTypeId RbsLookupTableName { get ; }` |
| Property | RbsLossCoefficient | — | `public static ForgeTypeId RbsLossCoefficient { get ; }` |
| Property | RbsMaxFlow | — | `public static ForgeTypeId RbsMaxFlow { get ; }` |
| Property | RbsMinFlow | — | `public static ForgeTypeId RbsMinFlow { get ; }` |
| Property | RbsOffsetParam | — | `public static ForgeTypeId RbsOffsetParam { get ; }` |
| Property | RbsPanelScheduleSheetAppearanceInstParam | — | `public static ForgeTypeId RbsPanelScheduleSheetAppearanceInstParam { get ; }` |
| Property | RbsPanelScheduleSheetAppearanceParam | — | `public static ForgeTypeId RbsPanelScheduleSheetAppearanceParam { get ; }` |
| Property | RbsParallelconduitsHorizontalNumber | — | `public static ForgeTypeId RbsParallelconduitsHorizontalNumber { get ; }` |
| Property | RbsParallelconduitsHorizontalOffsetValue | — | `public static ForgeTypeId RbsParallelconduitsHorizontalOffsetValue { get ; }` |
| Property | RbsParallelconduitsVerticalNumber | — | `public static ForgeTypeId RbsParallelconduitsVerticalNumber { get ; }` |
| Property | RbsParallelconduitsVerticalOffsetValue | — | `public static ForgeTypeId RbsParallelconduitsVerticalOffsetValue { get ; }` |
| Property | RbsParallelpipesHorizontalNumber | — | `public static ForgeTypeId RbsParallelpipesHorizontalNumber { get ; }` |
| Property | RbsParallelpipesHorizontalOffsetValue | — | `public static ForgeTypeId RbsParallelpipesHorizontalOffsetValue { get ; }` |
| Property | RbsParallelpipesVerticalNumber | — | `public static ForgeTypeId RbsParallelpipesVerticalNumber { get ; }` |
| Property | RbsParallelpipesVerticalOffsetValue | — | `public static ForgeTypeId RbsParallelpipesVerticalOffsetValue { get ; }` |
| Property | RbsPartType | — | `public static ForgeTypeId RbsPartType { get ; }` |
| Property | RbsPipeAdditionalFlowParam | — | `public static ForgeTypeId RbsPipeAdditionalFlowParam { get ; }` |
| Property | RbsPipeBottomElevation | — | `public static ForgeTypeId RbsPipeBottomElevation { get ; }` |
| Property | RbsPipeCalculatedSize | — | `public static ForgeTypeId RbsPipeCalculatedSize { get ; }` |
| Property | RbsPipeClassParam | — | `public static ForgeTypeId RbsPipeClassParam { get ; }` |
| Property | RbsPipeConnectiontypeParam | — | `public static ForgeTypeId RbsPipeConnectiontypeParam { get ; }` |
| Property | RbsPipeConnectorSystemClassificationParam | — | `public static ForgeTypeId RbsPipeConnectorSystemClassificationParam { get ; }` |
| Property | RbsPipeCwfuParam | — | `public static ForgeTypeId RbsPipeCwfuParam { get ; }` |
| Property | RbsPipeDiameterParam | — | `public static ForgeTypeId RbsPipeDiameterParam { get ; }` |
| Property | RbsPipeFittingLossKfactorParam | — | `public static ForgeTypeId RbsPipeFittingLossKfactorParam { get ; }` |
| Property | RbsPipeFittingLossMethodParam | — | `public static ForgeTypeId RbsPipeFittingLossMethodParam { get ; }` |
| Property | RbsPipeFittingLossMethodServerParam | — | `public static ForgeTypeId RbsPipeFittingLossMethodServerParam { get ; }` |
| Property | RbsPipeFittingLossMethodSettings | — | `public static ForgeTypeId RbsPipeFittingLossMethodSettings { get ; }` |
| Property | RbsPipeFittingLossTableParam | — | `public static ForgeTypeId RbsPipeFittingLossTableParam { get ; }` |
| Property | RbsPipeFixtureUnitsParam | — | `public static ForgeTypeId RbsPipeFixtureUnitsParam { get ; }` |
| Property | RbsPipeFlowConfigurationParam | — | `public static ForgeTypeId RbsPipeFlowConfigurationParam { get ; }` |
| Property | RbsPipeFlowDirectionParam | — | `public static ForgeTypeId RbsPipeFlowDirectionParam { get ; }` |
| Property | RbsPipeFlowParam | — | `public static ForgeTypeId RbsPipeFlowParam { get ; }` |
| Property | RbsPipeFlowStateParam | — | `public static ForgeTypeId RbsPipeFlowStateParam { get ; }` |
| Property | RbsPipeFluidDensityParam | — | `public static ForgeTypeId RbsPipeFluidDensityParam { get ; }` |
| Property | RbsPipeFluidTemperatureParam | — | `public static ForgeTypeId RbsPipeFluidTemperatureParam { get ; }` |
| Property | RbsPipeFluidTypeParam | — | `public static ForgeTypeId RbsPipeFluidTypeParam { get ; }` |
| Property | RbsPipeFluidViscosityParam | — | `public static ForgeTypeId RbsPipeFluidViscosityParam { get ; }` |
| Property | RbsPipeFrictionParam | — | `public static ForgeTypeId RbsPipeFrictionParam { get ; }` |
| Property | RbsPipeHwfuParam | — | `public static ForgeTypeId RbsPipeHwfuParam { get ; }` |
| Property | RbsPipeInnerDiamParam | — | `public static ForgeTypeId RbsPipeInnerDiamParam { get ; }` |
| Property | RbsPipeInsulationThickness | — | `public static ForgeTypeId RbsPipeInsulationThickness { get ; }` |
| Property | RbsPipeInvertElevation | — | `public static ForgeTypeId RbsPipeInvertElevation { get ; }` |
| Property | RbsPipeJointtypeParam | — | `public static ForgeTypeId RbsPipeJointtypeParam { get ; }` |
| Property | RbsPipeMaterialParam | — | `public static ForgeTypeId RbsPipeMaterialParam { get ; }` |
| Property | RbsPipeOuterDiameter | — | `public static ForgeTypeId RbsPipeOuterDiameter { get ; }` |
| Property | RbsPipePressuredropParam | — | `public static ForgeTypeId RbsPipePressuredropParam { get ; }` |
| Property | RbsPipeReynoldsNumberParam | — | `public static ForgeTypeId RbsPipeReynoldsNumberParam { get ; }` |
| Property | RbsPipeSegmentParam | — | `public static ForgeTypeId RbsPipeSegmentParam { get ; }` |
| Property | RbsPipeSizeFormattedParam | — | `public static ForgeTypeId RbsPipeSizeFormattedParam { get ; }` |
| Property | RbsPipeSizeMaximum | — | `public static ForgeTypeId RbsPipeSizeMaximum { get ; }` |
| Property | RbsPipeSizeMinimum | — | `public static ForgeTypeId RbsPipeSizeMinimum { get ; }` |
| Property | RbsPipeSlope | — | `public static ForgeTypeId RbsPipeSlope { get ; }` |
| Property | RbsPipeSlopeDefParam | — | `public static ForgeTypeId RbsPipeSlopeDefParam { get ; }` |
| Property | RbsPipeSlopeOptionsDefParam | — | `public static ForgeTypeId RbsPipeSlopeOptionsDefParam { get ; }` |
| Property | RbsPipeStaticPressure | — | `public static ForgeTypeId RbsPipeStaticPressure { get ; }` |
| Property | RbsPipeSystemCalculationParam | — | `public static ForgeTypeId RbsPipeSystemCalculationParam { get ; }` |
| Property | RbsPipeSystemFixtureUnitParam | — | `public static ForgeTypeId RbsPipeSystemFixtureUnitParam { get ; }` |
| Property | RbsPipeTopElevation | — | `public static ForgeTypeId RbsPipeTopElevation { get ; }` |
| Property | RbsPipeTypeFittingLossKfactorParam | — | `public static ForgeTypeId RbsPipeTypeFittingLossKfactorParam { get ; }` |
| Property | RbsPipeTypeFittingLossMethodParam | — | `public static ForgeTypeId RbsPipeTypeFittingLossMethodParam { get ; }` |
| Property | RbsPipeTypeFittingLossTableParam | — | `public static ForgeTypeId RbsPipeTypeFittingLossTableParam { get ; }` |
| Property | RbsPipeTypeParam | — | `public static ForgeTypeId RbsPipeTypeParam { get ; }` |
| Property | RbsPipeTypeValveLossCvfactorParam | — | `public static ForgeTypeId RbsPipeTypeValveLossCvfactorParam { get ; }` |
| Property | RbsPipeValveLossCvfactorParam | — | `public static ForgeTypeId RbsPipeValveLossCvfactorParam { get ; }` |
| Property | RbsPipeVelocityParam | — | `public static ForgeTypeId RbsPipeVelocityParam { get ; }` |
| Property | RbsPipeVolumeParam | — | `public static ForgeTypeId RbsPipeVolumeParam { get ; }` |
| Property | RbsPipeWallThickness | — | `public static ForgeTypeId RbsPipeWallThickness { get ; }` |
| Property | RbsPipeWfuParam | — | `public static ForgeTypeId RbsPipeWfuParam { get ; }` |
| Property | RbsPipingSystemTypeParam | — | `public static ForgeTypeId RbsPipingSystemTypeParam { get ; }` |
| Property | RbsPressureDrop | — | `public static ForgeTypeId RbsPressureDrop { get ; }` |
| Property | RbsProjectConstructionTypeShadingfactorParam | — | `public static ForgeTypeId RbsProjectConstructionTypeShadingfactorParam { get ; }` |
| Property | RbsProjectLocationParam | — | `public static ForgeTypeId RbsProjectLocationParam { get ; }` |
| Property | RbsProjectReporttypeParam | — | `public static ForgeTypeId RbsProjectReporttypeParam { get ; }` |
| Property | RbsReferenceFreesize | — | `public static ForgeTypeId RbsReferenceFreesize { get ; }` |
| Property | RbsReferenceInsulationThickness | — | `public static ForgeTypeId RbsReferenceInsulationThickness { get ; }` |
| Property | RbsReferenceInsulationType | — | `public static ForgeTypeId RbsReferenceInsulationType { get ; }` |
| Property | RbsReferenceLiningThickness | — | `public static ForgeTypeId RbsReferenceLiningThickness { get ; }` |
| Property | RbsReferenceLiningType | — | `public static ForgeTypeId RbsReferenceLiningType { get ; }` |
| Property | RbsReferenceOverallsize | — | `public static ForgeTypeId RbsReferenceOverallsize { get ; }` |
| Property | RbsReynoldsnumberParam | — | `public static ForgeTypeId RbsReynoldsnumberParam { get ; }` |
| Property | RbsRoomCoefficientUtilization | — | `public static ForgeTypeId RbsRoomCoefficientUtilization { get ; }` |
| Property | RbsRoutingPreferenceParam | — | `public static ForgeTypeId RbsRoutingPreferenceParam { get ; }` |
| Property | RbsSection | — | `public static ForgeTypeId RbsSection { get ; }` |
| Property | RbsSegmentDescriptionParam | — | `public static ForgeTypeId RbsSegmentDescriptionParam { get ; }` |
| Property | RbsServiceTypeParam | — | `public static ForgeTypeId RbsServiceTypeParam { get ; }` |
| Property | RbsShowProfileType | — | `public static ForgeTypeId RbsShowProfileType { get ; }` |
| Property | RbsSizeLock | — | `public static ForgeTypeId RbsSizeLock { get ; }` |
| Property | RbsStartLevelParam | — | `public static ForgeTypeId RbsStartLevelParam { get ; }` |
| Property | RbsStartOffsetParam | — | `public static ForgeTypeId RbsStartOffsetParam { get ; }` |
| Property | RbsSystemAbbreviationParam | — | `public static ForgeTypeId RbsSystemAbbreviationParam { get ; }` |
| Property | RbsSystemBaseElementParam | — | `public static ForgeTypeId RbsSystemBaseElementParam { get ; }` |
| Property | RbsSystemClassificationParam | — | `public static ForgeTypeId RbsSystemClassificationParam { get ; }` |
| Property | RbsSystemFlowConversionMethodParam | — | `public static ForgeTypeId RbsSystemFlowConversionMethodParam { get ; }` |
| Property | RbsSystemNameParam | — | `public static ForgeTypeId RbsSystemNameParam { get ; }` |
| Property | RbsSystemNumElementsParam | — | `public static ForgeTypeId RbsSystemNumElementsParam { get ; }` |
| Property | RbsSystemRisedrop1linedropsymbolParam | — | `public static ForgeTypeId RbsSystemRisedrop1linedropsymbolParam { get ; }` |
| Property | RbsSystemRisedrop1linerisesymbolParam | — | `public static ForgeTypeId RbsSystemRisedrop1linerisesymbolParam { get ; }` |
| Property | RbsSystemRisedrop1lineteedownsymbolParam | — | `public static ForgeTypeId RbsSystemRisedrop1lineteedownsymbolParam { get ; }` |
| Property | RbsSystemRisedrop1lineteeupsymbolParam | — | `public static ForgeTypeId RbsSystemRisedrop1lineteeupsymbolParam { get ; }` |
| Property | RbsSystemRisedrop2linedropsymbolParam | — | `public static ForgeTypeId RbsSystemRisedrop2linedropsymbolParam { get ; }` |
| Property | RbsSystemRisedrop2linerisesymbolParam | — | `public static ForgeTypeId RbsSystemRisedrop2linerisesymbolParam { get ; }` |
| Property | RbsSystemRisedropParam | — | `public static ForgeTypeId RbsSystemRisedropParam { get ; }` |
| Property | RbsVelocity | — | `public static ForgeTypeId RbsVelocity { get ; }` |
| Property | RbsVelocityPressure | — | `public static ForgeTypeId RbsVelocityPressure { get ; }` |
| Property | RbsVoltagetypeMaxvoltageParam | — | `public static ForgeTypeId RbsVoltagetypeMaxvoltageParam { get ; }` |
| Property | RbsVoltagetypeMinvoltageParam | — | `public static ForgeTypeId RbsVoltagetypeMinvoltageParam { get ; }` |
| Property | RbsVoltagetypeVoltageParam | — | `public static ForgeTypeId RbsVoltagetypeVoltageParam { get ; }` |
| Property | RbsWireCircuitDescription | — | `public static ForgeTypeId RbsWireCircuitDescription { get ; }` |
| Property | RbsWireCircuitLoadName | — | `public static ForgeTypeId RbsWireCircuitLoadName { get ; }` |
| Property | RbsWireConduitTypeParam | — | `public static ForgeTypeId RbsWireConduitTypeParam { get ; }` |
| Property | RbsWireInsulationParam | — | `public static ForgeTypeId RbsWireInsulationParam { get ; }` |
| Property | RbsWireMaterialParam | — | `public static ForgeTypeId RbsWireMaterialParam { get ; }` |
| Property | RbsWireMaxConductorSizeParam | — | `public static ForgeTypeId RbsWireMaxConductorSizeParam { get ; }` |
| Property | RbsWireNeutralIncludedInBalancedLoadParam | — | `public static ForgeTypeId RbsWireNeutralIncludedInBalancedLoadParam { get ; }` |
| Property | RbsWireNeutralModeParam | — | `public static ForgeTypeId RbsWireNeutralModeParam { get ; }` |
| Property | RbsWireNeutralMultiplierParam | — | `public static ForgeTypeId RbsWireNeutralMultiplierParam { get ; }` |
| Property | RbsWireNumConductorsParam | — | `public static ForgeTypeId RbsWireNumConductorsParam { get ; }` |
| Property | RbsWireTemperatureRatingParam | — | `public static ForgeTypeId RbsWireTemperatureRatingParam { get ; }` |
| Property | RebarAlignmentOptions | — | `public static ForgeTypeId RebarAlignmentOptions { get ; }` |
| Property | RebarBarDeformationType | — | `public static ForgeTypeId RebarBarDeformationType { get ; }` |
| Property | RebarBarDiameter | — | `public static ForgeTypeId RebarBarDiameter { get ; }` |
| Property | RebarBarHookLengths | — | `public static ForgeTypeId RebarBarHookLengths { get ; }` |
| Property | RebarBarMaximumBendRadius | — | `public static ForgeTypeId RebarBarMaximumBendRadius { get ; }` |
| Property | RebarBarStirrupBendDiameter | — | `public static ForgeTypeId RebarBarStirrupBendDiameter { get ; }` |
| Property | RebarBarStyle | — | `public static ForgeTypeId RebarBarStyle { get ; }` |
| Property | RebarContainerBarType | — | `public static ForgeTypeId RebarContainerBarType { get ; }` |
| Property | RebarDistributionType | — | `public static ForgeTypeId RebarDistributionType { get ; }` |
| Property | RebarElemBarSpacing | — | `public static ForgeTypeId RebarElemBarSpacing { get ; }` |
| Property | RebarElemEndtreatmentEnd | — | `public static ForgeTypeId RebarElemEndtreatmentEnd { get ; }` |
| Property | RebarElemEndtreatmentStart | — | `public static ForgeTypeId RebarElemEndtreatmentStart { get ; }` |
| Property | RebarElemHookEndOrient | — | `public static ForgeTypeId RebarElemHookEndOrient { get ; }` |
| Property | RebarElemHookEndType | — | `public static ForgeTypeId RebarElemHookEndType { get ; }` |
| Property | RebarElemHookStartOrient | — | `public static ForgeTypeId RebarElemHookStartOrient { get ; }` |
| Property | RebarElemHookStartType | — | `public static ForgeTypeId RebarElemHookStartType { get ; }` |
| Property | RebarElemHookStyle | — | `public static ForgeTypeId RebarElemHookStyle { get ; }` |
| Property | RebarElemHostMark | — | `public static ForgeTypeId RebarElemHostMark { get ; }` |
| Property | RebarElemLayoutRule | — | `public static ForgeTypeId RebarElemLayoutRule { get ; }` |
| Property | RebarElemLength | — | `public static ForgeTypeId RebarElemLength { get ; }` |
| Property | RebarElemQuantityOfBars | — | `public static ForgeTypeId RebarElemQuantityOfBars { get ; }` |
| Property | RebarElemScheduleMark | — | `public static ForgeTypeId RebarElemScheduleMark { get ; }` |
| Property | RebarElemTotalLength | — | `public static ForgeTypeId RebarElemTotalLength { get ; }` |
| Property | RebarElementRounding | — | `public static ForgeTypeId RebarElementRounding { get ; }` |
| Property | RebarElementVisibility | — | `public static ForgeTypeId RebarElementVisibility { get ; }` |
| Property | RebarFreeFormHookEndPlaneAngle | — | `public static ForgeTypeId RebarFreeFormHookEndPlaneAngle { get ; }` |
| Property | RebarFreeFormHookStartPlaneAngle | — | `public static ForgeTypeId RebarFreeFormHookStartPlaneAngle { get ; }` |
| Property | RebarGeometryType | — | `public static ForgeTypeId RebarGeometryType { get ; }` |
| Property | RebarHookAngle | — | `public static ForgeTypeId RebarHookAngle { get ; }` |
| Property | RebarHookLengthOverride | — | `public static ForgeTypeId RebarHookLengthOverride { get ; }` |
| Property | RebarHookLineLenFactor | — | `public static ForgeTypeId RebarHookLineLenFactor { get ; }` |
| Property | RebarHookRotationAtEnd | — | `public static ForgeTypeId RebarHookRotationAtEnd { get ; }` |
| Property | RebarHookRotationAtEndSchedulesTagsFilters | — | `public static ForgeTypeId RebarHookRotationAtEndSchedulesTagsFilters { get ; }` |
| Property | RebarHookRotationAtStart | — | `public static ForgeTypeId RebarHookRotationAtStart { get ; }` |
| Property | RebarHookRotationAtStartSchedulesTagsFilters | — | `public static ForgeTypeId RebarHookRotationAtStartSchedulesTagsFilters { get ; }` |
| Property | RebarHookStyle | — | `public static ForgeTypeId RebarHookStyle { get ; }` |
| Property | RebarHostCategory | — | `public static ForgeTypeId RebarHostCategory { get ; }` |
| Property | RebarIncludeFirstBar | — | `public static ForgeTypeId RebarIncludeFirstBar { get ; }` |
| Property | RebarIncludeLastBar | — | `public static ForgeTypeId RebarIncludeLastBar { get ; }` |
| Property | RebarInstanceBarDiameter | — | `public static ForgeTypeId RebarInstanceBarDiameter { get ; }` |
| Property | RebarInstanceBarModelDiameter | — | `public static ForgeTypeId RebarInstanceBarModelDiameter { get ; }` |
| Property | RebarInstanceBendDiameter | — | `public static ForgeTypeId RebarInstanceBendDiameter { get ; }` |
| Property | RebarInstanceStirrupTieAttachment | — | `public static ForgeTypeId RebarInstanceStirrupTieAttachment { get ; }` |
| Property | RebarInternalMultiplanar | — | `public static ForgeTypeId RebarInternalMultiplanar { get ; }` |
| Property | RebarInternalMultiplanarArcConnector | — | `public static ForgeTypeId RebarInternalMultiplanarArcConnector { get ; }` |
| Property | RebarInternalMultiplanarDuplicate | — | `public static ForgeTypeId RebarInternalMultiplanarDuplicate { get ; }` |
| Property | RebarInternalMultiplanarEndConnector | — | `public static ForgeTypeId RebarInternalMultiplanarEndConnector { get ; }` |
| Property | RebarInternalMultiplanarStartConnector | — | `public static ForgeTypeId RebarInternalMultiplanarStartConnector { get ; }` |
| Property | RebarMaxLength | — | `public static ForgeTypeId RebarMaxLength { get ; }` |
| Property | RebarMaximSuffix | — | `public static ForgeTypeId RebarMaximSuffix { get ; }` |
| Property | RebarMinLength | — | `public static ForgeTypeId RebarMinLength { get ; }` |
| Property | RebarMinimSuffix | — | `public static ForgeTypeId RebarMinimSuffix { get ; }` |
| Property | RebarModelBarDiameter | — | `public static ForgeTypeId RebarModelBarDiameter { get ; }` |
| Property | RebarModifiedSet | — | `public static ForgeTypeId RebarModifiedSet { get ; }` |
| Property | RebarNumber | — | `public static ForgeTypeId RebarNumber { get ; }` |
| Property | RebarNumberSuffix | — | `public static ForgeTypeId RebarNumberSuffix { get ; }` |
| Property | RebarQuanityByDistrib | — | `public static ForgeTypeId RebarQuanityByDistrib { get ; }` |
| Property | RebarShape | — | `public static ForgeTypeId RebarShape { get ; }` |
| Property | RebarShapeAllowedBarTypes | — | `public static ForgeTypeId RebarShapeAllowedBarTypes { get ; }` |
| Property | RebarShapeEndHookLength | — | `public static ForgeTypeId RebarShapeEndHookLength { get ; }` |
| Property | RebarShapeEndHookOffset | — | `public static ForgeTypeId RebarShapeEndHookOffset { get ; }` |
| Property | RebarShapeEndtreatmentEndType | — | `public static ForgeTypeId RebarShapeEndtreatmentEndType { get ; }` |
| Property | RebarShapeEndtreatmentStartType | — | `public static ForgeTypeId RebarShapeEndtreatmentStartType { get ; }` |
| Property | RebarShapeHookEndType | — | `public static ForgeTypeId RebarShapeHookEndType { get ; }` |
| Property | RebarShapeHookRotationAtEnd | — | `public static ForgeTypeId RebarShapeHookRotationAtEnd { get ; }` |
| Property | RebarShapeHookRotationAtStart | — | `public static ForgeTypeId RebarShapeHookRotationAtStart { get ; }` |
| Property | RebarShapeHookStartType | — | `public static ForgeTypeId RebarShapeHookStartType { get ; }` |
| Property | RebarShapeHookStyle | — | `public static ForgeTypeId RebarShapeHookStyle { get ; }` |
| Property | RebarShapeImage | — | `public static ForgeTypeId RebarShapeImage { get ; }` |
| Property | RebarShapeOutOfPlaneBendDiameter | — | `public static ForgeTypeId RebarShapeOutOfPlaneBendDiameter { get ; }` |
| Property | RebarShapeParamEndHookTanLen | — | `public static ForgeTypeId RebarShapeParamEndHookTanLen { get ; }` |
| Property | RebarShapeParamStartHookTanLen | — | `public static ForgeTypeId RebarShapeParamStartHookTanLen { get ; }` |
| Property | RebarShapeSpiralBaseFinishingTurns | — | `public static ForgeTypeId RebarShapeSpiralBaseFinishingTurns { get ; }` |
| Property | RebarShapeSpiralHeight | — | `public static ForgeTypeId RebarShapeSpiralHeight { get ; }` |
| Property | RebarShapeSpiralPitch | — | `public static ForgeTypeId RebarShapeSpiralPitch { get ; }` |
| Property | RebarShapeSpiralTopFinishingTurns | — | `public static ForgeTypeId RebarShapeSpiralTopFinishingTurns { get ; }` |
| Property | RebarShapeStartHookLength | — | `public static ForgeTypeId RebarShapeStartHookLength { get ; }` |
| Property | RebarShapeStartHookOffset | — | `public static ForgeTypeId RebarShapeStartHookOffset { get ; }` |
| Property | RebarShapeStirrupTieAttachment | — | `public static ForgeTypeId RebarShapeStirrupTieAttachment { get ; }` |
| Property | RebarStandardBendDiameter | — | `public static ForgeTypeId RebarStandardBendDiameter { get ; }` |
| Property | RebarStandardHookBendDiameter | — | `public static ForgeTypeId RebarStandardHookBendDiameter { get ; }` |
| Property | RebarSystemActiveBackDirn1 | — | `public static ForgeTypeId RebarSystemActiveBackDirn1 { get ; }` |
| Property | RebarSystemActiveBackDirn2 | — | `public static ForgeTypeId RebarSystemActiveBackDirn2 { get ; }` |
| Property | RebarSystemActiveBottomDir1Generic | — | `public static ForgeTypeId RebarSystemActiveBottomDir1Generic { get ; }` |
| Property | RebarSystemActiveBottomDir2Generic | — | `public static ForgeTypeId RebarSystemActiveBottomDir2Generic { get ; }` |
| Property | RebarSystemActiveBottomDirn1 | — | `public static ForgeTypeId RebarSystemActiveBottomDirn1 { get ; }` |
| Property | RebarSystemActiveBottomDirn2 | — | `public static ForgeTypeId RebarSystemActiveBottomDirn2 { get ; }` |
| Property | RebarSystemActiveFrontDirn1 | — | `public static ForgeTypeId RebarSystemActiveFrontDirn1 { get ; }` |
| Property | RebarSystemActiveFrontDirn2 | — | `public static ForgeTypeId RebarSystemActiveFrontDirn2 { get ; }` |
| Property | RebarSystemActiveTopDir1Generic | — | `public static ForgeTypeId RebarSystemActiveTopDir1Generic { get ; }` |
| Property | RebarSystemActiveTopDir2Generic | — | `public static ForgeTypeId RebarSystemActiveTopDir2Generic { get ; }` |
| Property | RebarSystemActiveTopDirn1 | — | `public static ForgeTypeId RebarSystemActiveTopDirn1 { get ; }` |
| Property | RebarSystemActiveTopDirn2 | — | `public static ForgeTypeId RebarSystemActiveTopDirn2 { get ; }` |
| Property | RebarSystemAddlBottomOffset | — | `public static ForgeTypeId RebarSystemAddlBottomOffset { get ; }` |
| Property | RebarSystemAddlExteriorOffset | — | `public static ForgeTypeId RebarSystemAddlExteriorOffset { get ; }` |
| Property | RebarSystemAddlInteriorOffset | — | `public static ForgeTypeId RebarSystemAddlInteriorOffset { get ; }` |
| Property | RebarSystemAddlTopOffset | — | `public static ForgeTypeId RebarSystemAddlTopOffset { get ; }` |
| Property | RebarSystemBarTypeBackDirn1 | — | `public static ForgeTypeId RebarSystemBarTypeBackDirn1 { get ; }` |
| Property | RebarSystemBarTypeBackDirn2 | — | `public static ForgeTypeId RebarSystemBarTypeBackDirn2 { get ; }` |
| Property | RebarSystemBarTypeBottomDir1Generic | — | `public static ForgeTypeId RebarSystemBarTypeBottomDir1Generic { get ; }` |
| Property | RebarSystemBarTypeBottomDir2Generic | — | `public static ForgeTypeId RebarSystemBarTypeBottomDir2Generic { get ; }` |
| Property | RebarSystemBarTypeBottomDirn1 | — | `public static ForgeTypeId RebarSystemBarTypeBottomDirn1 { get ; }` |
| Property | RebarSystemBarTypeBottomDirn2 | — | `public static ForgeTypeId RebarSystemBarTypeBottomDirn2 { get ; }` |
| Property | RebarSystemBarTypeFrontDirn1 | — | `public static ForgeTypeId RebarSystemBarTypeFrontDirn1 { get ; }` |
| Property | RebarSystemBarTypeFrontDirn2 | — | `public static ForgeTypeId RebarSystemBarTypeFrontDirn2 { get ; }` |
| Property | RebarSystemBarTypeTopDir1Generic | — | `public static ForgeTypeId RebarSystemBarTypeTopDir1Generic { get ; }` |
| Property | RebarSystemBarTypeTopDir2Generic | — | `public static ForgeTypeId RebarSystemBarTypeTopDir2Generic { get ; }` |
| Property | RebarSystemBarTypeTopDirn1 | — | `public static ForgeTypeId RebarSystemBarTypeTopDirn1 { get ; }` |
| Property | RebarSystemBarTypeTopDirn2 | — | `public static ForgeTypeId RebarSystemBarTypeTopDirn2 { get ; }` |
| Property | RebarSystemBottomMajorMatchesBottomMinor | — | `public static ForgeTypeId RebarSystemBottomMajorMatchesBottomMinor { get ; }` |
| Property | RebarSystemCoverBottom | — | `public static ForgeTypeId RebarSystemCoverBottom { get ; }` |
| Property | RebarSystemCoverSide | — | `public static ForgeTypeId RebarSystemCoverSide { get ; }` |
| Property | RebarSystemCoverTop | — | `public static ForgeTypeId RebarSystemCoverTop { get ; }` |
| Property | RebarSystemHookOrientBackDirn1 | — | `public static ForgeTypeId RebarSystemHookOrientBackDirn1 { get ; }` |
| Property | RebarSystemHookOrientBackDirn2 | — | `public static ForgeTypeId RebarSystemHookOrientBackDirn2 { get ; }` |
| Property | RebarSystemHookOrientBottomDirn1 | — | `public static ForgeTypeId RebarSystemHookOrientBottomDirn1 { get ; }` |
| Property | RebarSystemHookOrientBottomDirn2 | — | `public static ForgeTypeId RebarSystemHookOrientBottomDirn2 { get ; }` |
| Property | RebarSystemHookOrientFrontDirn1 | — | `public static ForgeTypeId RebarSystemHookOrientFrontDirn1 { get ; }` |
| Property | RebarSystemHookOrientFrontDirn2 | — | `public static ForgeTypeId RebarSystemHookOrientFrontDirn2 { get ; }` |
| Property | RebarSystemHookOrientTopDirn1 | — | `public static ForgeTypeId RebarSystemHookOrientTopDirn1 { get ; }` |
| Property | RebarSystemHookOrientTopDirn2 | — | `public static ForgeTypeId RebarSystemHookOrientTopDirn2 { get ; }` |
| Property | RebarSystemHookTypeBackDirn1 | — | `public static ForgeTypeId RebarSystemHookTypeBackDirn1 { get ; }` |
| Property | RebarSystemHookTypeBackDirn2 | — | `public static ForgeTypeId RebarSystemHookTypeBackDirn2 { get ; }` |
| Property | RebarSystemHookTypeBottomDirn1 | — | `public static ForgeTypeId RebarSystemHookTypeBottomDirn1 { get ; }` |
| Property | RebarSystemHookTypeBottomDirn2 | — | `public static ForgeTypeId RebarSystemHookTypeBottomDirn2 { get ; }` |
| Property | RebarSystemHookTypeFrontDirn1 | — | `public static ForgeTypeId RebarSystemHookTypeFrontDirn1 { get ; }` |
| Property | RebarSystemHookTypeFrontDirn2 | — | `public static ForgeTypeId RebarSystemHookTypeFrontDirn2 { get ; }` |
| Property | RebarSystemHookTypeTopDirn1 | — | `public static ForgeTypeId RebarSystemHookTypeTopDirn1 { get ; }` |
| Property | RebarSystemHookTypeTopDirn2 | — | `public static ForgeTypeId RebarSystemHookTypeTopDirn2 { get ; }` |
| Property | RebarSystemLayerSummaryBottomDir1NoSpacing | — | `public static ForgeTypeId RebarSystemLayerSummaryBottomDir1NoSpacing { get ; }` |
| Property | RebarSystemLayerSummaryBottomDir1WithSpacing | — | `public static ForgeTypeId RebarSystemLayerSummaryBottomDir1WithSpacing { get ; }` |
| Property | RebarSystemLayerSummaryBottomDir2NoSpacing | — | `public static ForgeTypeId RebarSystemLayerSummaryBottomDir2NoSpacing { get ; }` |
| Property | RebarSystemLayerSummaryBottomDir2WithSpacing | — | `public static ForgeTypeId RebarSystemLayerSummaryBottomDir2WithSpacing { get ; }` |
| Property | RebarSystemLayerSummaryDir1NoSpacing | — | `public static ForgeTypeId RebarSystemLayerSummaryDir1NoSpacing { get ; }` |
| Property | RebarSystemLayerSummaryDir1WithSpacing | — | `public static ForgeTypeId RebarSystemLayerSummaryDir1WithSpacing { get ; }` |
| Property | RebarSystemLayerSummaryDir2NoSpacing | — | `public static ForgeTypeId RebarSystemLayerSummaryDir2NoSpacing { get ; }` |
| Property | RebarSystemLayerSummaryDir2WithSpacing | — | `public static ForgeTypeId RebarSystemLayerSummaryDir2WithSpacing { get ; }` |
| Property | RebarSystemLayerSummaryNoSpacing | — | `public static ForgeTypeId RebarSystemLayerSummaryNoSpacing { get ; }` |
| Property | RebarSystemLayerSummaryTopDir1NoSpacing | — | `public static ForgeTypeId RebarSystemLayerSummaryTopDir1NoSpacing { get ; }` |
| Property | RebarSystemLayerSummaryTopDir1WithSpacing | — | `public static ForgeTypeId RebarSystemLayerSummaryTopDir1WithSpacing { get ; }` |
| Property | RebarSystemLayerSummaryTopDir2NoSpacing | — | `public static ForgeTypeId RebarSystemLayerSummaryTopDir2NoSpacing { get ; }` |
| Property | RebarSystemLayerSummaryTopDir2WithSpacing | — | `public static ForgeTypeId RebarSystemLayerSummaryTopDir2WithSpacing { get ; }` |
| Property | RebarSystemLayerSummaryWithSpacing | — | `public static ForgeTypeId RebarSystemLayerSummaryWithSpacing { get ; }` |
| Property | RebarSystemLayoutRule | — | `public static ForgeTypeId RebarSystemLayoutRule { get ; }` |
| Property | RebarSystemNumberOfLinesBackDirn1 | — | `public static ForgeTypeId RebarSystemNumberOfLinesBackDirn1 { get ; }` |
| Property | RebarSystemNumberOfLinesBackDirn2 | — | `public static ForgeTypeId RebarSystemNumberOfLinesBackDirn2 { get ; }` |
| Property | RebarSystemNumberOfLinesBottomDir1Generic | — | `public static ForgeTypeId RebarSystemNumberOfLinesBottomDir1Generic { get ; }` |
| Property | RebarSystemNumberOfLinesBottomDir2Generic | — | `public static ForgeTypeId RebarSystemNumberOfLinesBottomDir2Generic { get ; }` |
| Property | RebarSystemNumberOfLinesBottomDirn1 | — | `public static ForgeTypeId RebarSystemNumberOfLinesBottomDirn1 { get ; }` |
| Property | RebarSystemNumberOfLinesBottomDirn2 | — | `public static ForgeTypeId RebarSystemNumberOfLinesBottomDirn2 { get ; }` |
| Property | RebarSystemNumberOfLinesFrontDirn1 | — | `public static ForgeTypeId RebarSystemNumberOfLinesFrontDirn1 { get ; }` |
| Property | RebarSystemNumberOfLinesFrontDirn2 | — | `public static ForgeTypeId RebarSystemNumberOfLinesFrontDirn2 { get ; }` |
| Property | RebarSystemNumberOfLinesTopDir1Generic | — | `public static ForgeTypeId RebarSystemNumberOfLinesTopDir1Generic { get ; }` |
| Property | RebarSystemNumberOfLinesTopDir2Generic | — | `public static ForgeTypeId RebarSystemNumberOfLinesTopDir2Generic { get ; }` |
| Property | RebarSystemNumberOfLinesTopDirn1 | — | `public static ForgeTypeId RebarSystemNumberOfLinesTopDirn1 { get ; }` |
| Property | RebarSystemNumberOfLinesTopDirn2 | — | `public static ForgeTypeId RebarSystemNumberOfLinesTopDirn2 { get ; }` |
| Property | RebarSystemOverride | — | `public static ForgeTypeId RebarSystemOverride { get ; }` |
| Property | RebarSystemSpacingBackDirn1 | — | `public static ForgeTypeId RebarSystemSpacingBackDirn1 { get ; }` |
| Property | RebarSystemSpacingBackDirn2 | — | `public static ForgeTypeId RebarSystemSpacingBackDirn2 { get ; }` |
| Property | RebarSystemSpacingBottomDir1Generic | — | `public static ForgeTypeId RebarSystemSpacingBottomDir1Generic { get ; }` |
| Property | RebarSystemSpacingBottomDir2Generic | — | `public static ForgeTypeId RebarSystemSpacingBottomDir2Generic { get ; }` |
| Property | RebarSystemSpacingBottomDirn1 | — | `public static ForgeTypeId RebarSystemSpacingBottomDirn1 { get ; }` |
| Property | RebarSystemSpacingBottomDirn2 | — | `public static ForgeTypeId RebarSystemSpacingBottomDirn2 { get ; }` |
| Property | RebarSystemSpacingFrontDirn1 | — | `public static ForgeTypeId RebarSystemSpacingFrontDirn1 { get ; }` |
| Property | RebarSystemSpacingFrontDirn2 | — | `public static ForgeTypeId RebarSystemSpacingFrontDirn2 { get ; }` |
| Property | RebarSystemSpacingTopDir1Generic | — | `public static ForgeTypeId RebarSystemSpacingTopDir1Generic { get ; }` |
| Property | RebarSystemSpacingTopDir2Generic | — | `public static ForgeTypeId RebarSystemSpacingTopDir2Generic { get ; }` |
| Property | RebarSystemSpacingTopDirn1 | — | `public static ForgeTypeId RebarSystemSpacingTopDirn1 { get ; }` |
| Property | RebarSystemSpacingTopDirn2 | — | `public static ForgeTypeId RebarSystemSpacingTopDirn2 { get ; }` |
| Property | RebarSystemSpanactiveDirn1 | — | `public static ForgeTypeId RebarSystemSpanactiveDirn1 { get ; }` |
| Property | RebarSystemSpanactiveDirn2 | — | `public static ForgeTypeId RebarSystemSpanactiveDirn2 { get ; }` |
| Property | RebarSystemSpanhookBottomDirn2 | — | `public static ForgeTypeId RebarSystemSpanhookBottomDirn2 { get ; }` |
| Property | RebarSystemSpanhookLeftDirn1 | — | `public static ForgeTypeId RebarSystemSpanhookLeftDirn1 { get ; }` |
| Property | RebarSystemSpanhookRightDirn1 | — | `public static ForgeTypeId RebarSystemSpanhookRightDirn1 { get ; }` |
| Property | RebarSystemSpanhookTopDirn2 | — | `public static ForgeTypeId RebarSystemSpanhookTopDirn2 { get ; }` |
| Property | RebarSystemTopMajorMatchesBottomMajor | — | `public static ForgeTypeId RebarSystemTopMajorMatchesBottomMajor { get ; }` |
| Property | RebarSystemTopMajorMatchesTopMinor | — | `public static ForgeTypeId RebarSystemTopMajorMatchesTopMinor { get ; }` |
| Property | RebarSystemTopMinorMatchesBottomMinor | — | `public static ForgeTypeId RebarSystemTopMinorMatchesBottomMinor { get ; }` |
| Property | RebarWorkshopInstructions | — | `public static ForgeTypeId RebarWorkshopInstructions { get ; }` |
| Property | RectMullionThick | — | `public static ForgeTypeId RectMullionThick { get ; }` |
| Property | RectMullionWidth1 | — | `public static ForgeTypeId RectMullionWidth1 { get ; }` |
| Property | RectMullionWidth2 | — | `public static ForgeTypeId RectMullionWidth2 { get ; }` |
| Property | RefTableElemName | — | `public static ForgeTypeId RefTableElemName { get ; }` |
| Property | RefTableParamName | — | `public static ForgeTypeId RefTableParamName { get ; }` |
| Property | ReferenceBaseOnHost | — | `public static ForgeTypeId ReferenceBaseOnHost { get ; }` |
| Property | ReferenceLineSubcategory | — | `public static ForgeTypeId ReferenceLineSubcategory { get ; }` |
| Property | ReferenceOtherViewUiRefView | — | `public static ForgeTypeId ReferenceOtherViewUiRefView { get ; }` |
| Property | ReferenceOtherViewUiToggle | — | `public static ForgeTypeId ReferenceOtherViewUiToggle { get ; }` |
| Property | ReferenceViewerAttrTag | — | `public static ForgeTypeId ReferenceViewerAttrTag { get ; }` |
| Property | ReferenceViewerTargetView | — | `public static ForgeTypeId ReferenceViewerTargetView { get ; }` |
| Property | ReferenceViewerUiTargetFilter | — | `public static ForgeTypeId ReferenceViewerUiTargetFilter { get ; }` |
| Property | ReferenceViewerUiTargetView | — | `public static ForgeTypeId ReferenceViewerUiTargetView { get ; }` |
| Property | ReferencedView | — | `public static ForgeTypeId ReferencedView { get ; }` |
| Property | ReinEstBarLength | — | `public static ForgeTypeId ReinEstBarLength { get ; }` |
| Property | ReinEstBarVolume | — | `public static ForgeTypeId ReinEstBarVolume { get ; }` |
| Property | ReinEstNumberOfBars | — | `public static ForgeTypeId ReinEstNumberOfBars { get ; }` |
| Property | ReinforcementVolume | — | `public static ForgeTypeId ReinforcementVolume { get ; }` |
| Property | RelatedToMass | — | `public static ForgeTypeId RelatedToMass { get ; }` |
| Property | RelativeRoughness | — | `public static ForgeTypeId RelativeRoughness { get ; }` |
| Property | RenderPlantHeight | — | `public static ForgeTypeId RenderPlantHeight { get ; }` |
| Property | RenderPlantName | — | `public static ForgeTypeId RenderPlantName { get ; }` |
| Property | RenderPlantTrimHeight | — | `public static ForgeTypeId RenderPlantTrimHeight { get ; }` |
| Property | RenderRpcFilename | — | `public static ForgeTypeId RenderRpcFilename { get ; }` |
| Property | RenderRpcProperties | — | `public static ForgeTypeId RenderRpcProperties { get ; }` |
| Property | RepeatingDetailElement | — | `public static ForgeTypeId RepeatingDetailElement { get ; }` |
| Property | RepeatingDetailInside | — | `public static ForgeTypeId RepeatingDetailInside { get ; }` |
| Property | RepeatingDetailLayout | — | `public static ForgeTypeId RepeatingDetailLayout { get ; }` |
| Property | RepeatingDetailNumber | — | `public static ForgeTypeId RepeatingDetailNumber { get ; }` |
| Property | RepeatingDetailRotation | — | `public static ForgeTypeId RepeatingDetailRotation { get ; }` |
| Property | RepeatingDetailSpacing | — | `public static ForgeTypeId RepeatingDetailSpacing { get ; }` |
| Property | RevealProfileParam | — | `public static ForgeTypeId RevealProfileParam { get ; }` |
| Property | RevisionCloudRevision | — | `public static ForgeTypeId RevisionCloudRevision { get ; }` |
| Property | RevisionCloudRevisionDate | — | `public static ForgeTypeId RevisionCloudRevisionDate { get ; }` |
| Property | RevisionCloudRevisionDescription | — | `public static ForgeTypeId RevisionCloudRevisionDescription { get ; }` |
| Property | RevisionCloudRevisionIssuedBy | — | `public static ForgeTypeId RevisionCloudRevisionIssuedBy { get ; }` |
| Property | RevisionCloudRevisionIssuedTo | — | `public static ForgeTypeId RevisionCloudRevisionIssuedTo { get ; }` |
| Property | RevisionCloudRevisionNum | — | `public static ForgeTypeId RevisionCloudRevisionNum { get ; }` |
| Property | RevolutionEndAngle | — | `public static ForgeTypeId RevolutionEndAngle { get ; }` |
| Property | RevolutionStartAngle | — | `public static ForgeTypeId RevolutionStartAngle { get ; }` |
| Property | RgbBParam | — | `public static ForgeTypeId RgbBParam { get ; }` |
| Property | RgbGParam | — | `public static ForgeTypeId RgbGParam { get ; }` |
| Property | RgbRParam | — | `public static ForgeTypeId RgbRParam { get ; }` |
| Property | RoofAttrDefaultThicknessParam | — | `public static ForgeTypeId RoofAttrDefaultThicknessParam { get ; }` |
| Property | RoofAttrThicknessParam | — | `public static ForgeTypeId RoofAttrThicknessParam { get ; }` |
| Property | RoofBaseLevelParam | — | `public static ForgeTypeId RoofBaseLevelParam { get ; }` |
| Property | RoofConstraintLevelParam | — | `public static ForgeTypeId RoofConstraintLevelParam { get ; }` |
| Property | RoofConstraintOffsetParam | — | `public static ForgeTypeId RoofConstraintOffsetParam { get ; }` |
| Property | RoofCurveHeightAtWall | — | `public static ForgeTypeId RoofCurveHeightAtWall { get ; }` |
| Property | RoofCurveHeightOffset | — | `public static ForgeTypeId RoofCurveHeightOffset { get ; }` |
| Property | RoofCurveIsSlopeDefining | — | `public static ForgeTypeId RoofCurveIsSlopeDefining { get ; }` |
| Property | RoofEaveCutParam | — | `public static ForgeTypeId RoofEaveCutParam { get ; }` |
| Property | RoofFacesLocation | — | `public static ForgeTypeId RoofFacesLocation { get ; }` |
| Property | RoofLevelOffsetParam | — | `public static ForgeTypeId RoofLevelOffsetParam { get ; }` |
| Property | RoofRafterOrTrussParam | — | `public static ForgeTypeId RoofRafterOrTrussParam { get ; }` |
| Property | RoofSlope | — | `public static ForgeTypeId RoofSlope { get ; }` |
| Property | RoofStructureIdParam | — | `public static ForgeTypeId RoofStructureIdParam { get ; }` |
| Property | RoofUptoLevelOffsetParam | — | `public static ForgeTypeId RoofUptoLevelOffsetParam { get ; }` |
| Property | RoofUptoLevelParam | — | `public static ForgeTypeId RoofUptoLevelParam { get ; }` |
| Property | RoomActualExhaustAirflowParam | — | `public static ForgeTypeId RoomActualExhaustAirflowParam { get ; }` |
| Property | RoomActualLightingLoadParam | — | `public static ForgeTypeId RoomActualLightingLoadParam { get ; }` |
| Property | RoomActualLightingLoadPerAreaParam | — | `public static ForgeTypeId RoomActualLightingLoadPerAreaParam { get ; }` |
| Property | RoomActualPowerLoadParam | — | `public static ForgeTypeId RoomActualPowerLoadParam { get ; }` |
| Property | RoomActualPowerLoadPerAreaParam | — | `public static ForgeTypeId RoomActualPowerLoadPerAreaParam { get ; }` |
| Property | RoomActualReturnAirflowParam | — | `public static ForgeTypeId RoomActualReturnAirflowParam { get ; }` |
| Property | RoomActualSupplyAirflowParam | — | `public static ForgeTypeId RoomActualSupplyAirflowParam { get ; }` |
| Property | RoomAirChangesPerHourParam | — | `public static ForgeTypeId RoomAirChangesPerHourParam { get ; }` |
| Property | RoomArea | — | `public static ForgeTypeId RoomArea { get ; }` |
| Property | RoomAreaPerPersonParam | — | `public static ForgeTypeId RoomAreaPerPersonParam { get ; }` |
| Property | RoomBaseHeatLoadOnParam | — | `public static ForgeTypeId RoomBaseHeatLoadOnParam { get ; }` |
| Property | RoomBaseLightingLoadOnParam | — | `public static ForgeTypeId RoomBaseLightingLoadOnParam { get ; }` |
| Property | RoomBasePowerLoadOnParam | — | `public static ForgeTypeId RoomBasePowerLoadOnParam { get ; }` |
| Property | RoomBaseReturnAirflowOnParam | — | `public static ForgeTypeId RoomBaseReturnAirflowOnParam { get ; }` |
| Property | RoomCalculatedCoolingLoadParam | — | `public static ForgeTypeId RoomCalculatedCoolingLoadParam { get ; }` |
| Property | RoomCalculatedCoolingLoadPerAreaParam | — | `public static ForgeTypeId RoomCalculatedCoolingLoadPerAreaParam { get ; }` |
| Property | RoomCalculatedHeatingLoadParam | — | `public static ForgeTypeId RoomCalculatedHeatingLoadParam { get ; }` |
| Property | RoomCalculatedHeatingLoadPerAreaParam | — | `public static ForgeTypeId RoomCalculatedHeatingLoadPerAreaParam { get ; }` |
| Property | RoomCalculatedSupplyAirflowParam | — | `public static ForgeTypeId RoomCalculatedSupplyAirflowParam { get ; }` |
| Property | RoomCalculatedSupplyAirflowPerAreaParam | — | `public static ForgeTypeId RoomCalculatedSupplyAirflowPerAreaParam { get ; }` |
| Property | RoomCalculationPoint | — | `public static ForgeTypeId RoomCalculationPoint { get ; }` |
| Property | RoomComputationHeight | — | `public static ForgeTypeId RoomComputationHeight { get ; }` |
| Property | RoomComputationMethod | — | `public static ForgeTypeId RoomComputationMethod { get ; }` |
| Property | RoomConditionTypeParam | — | `public static ForgeTypeId RoomConditionTypeParam { get ; }` |
| Property | RoomConstructionSetParam | — | `public static ForgeTypeId RoomConstructionSetParam { get ; }` |
| Property | RoomDepartment | — | `public static ForgeTypeId RoomDepartment { get ; }` |
| Property | RoomDesignCoolingLoadParam | — | `public static ForgeTypeId RoomDesignCoolingLoadParam { get ; }` |
| Property | RoomDesignExhaustAirflowParam | — | `public static ForgeTypeId RoomDesignExhaustAirflowParam { get ; }` |
| Property | RoomDesignHeatingLoadParam | — | `public static ForgeTypeId RoomDesignHeatingLoadParam { get ; }` |
| Property | RoomDesignLightingLoadParam | — | `public static ForgeTypeId RoomDesignLightingLoadParam { get ; }` |
| Property | RoomDesignLightingLoadPerAreaParam | — | `public static ForgeTypeId RoomDesignLightingLoadPerAreaParam { get ; }` |
| Property | RoomDesignMechanicalLoadPerAreaParam | — | `public static ForgeTypeId RoomDesignMechanicalLoadPerAreaParam { get ; }` |
| Property | RoomDesignOtherLoadPerAreaParam | — | `public static ForgeTypeId RoomDesignOtherLoadPerAreaParam { get ; }` |
| Property | RoomDesignPowerLoadParam | — | `public static ForgeTypeId RoomDesignPowerLoadParam { get ; }` |
| Property | RoomDesignPowerLoadPerAreaParam | — | `public static ForgeTypeId RoomDesignPowerLoadPerAreaParam { get ; }` |
| Property | RoomDesignReturnAirflowParam | — | `public static ForgeTypeId RoomDesignReturnAirflowParam { get ; }` |
| Property | RoomDesignSupplyAirflowParam | — | `public static ForgeTypeId RoomDesignSupplyAirflowParam { get ; }` |
| Property | RoomEditElectricalLoadsParam | — | `public static ForgeTypeId RoomEditElectricalLoadsParam { get ; }` |
| Property | RoomEditPeopleLoadsParam | — | `public static ForgeTypeId RoomEditPeopleLoadsParam { get ; }` |
| Property | RoomFinishBase | — | `public static ForgeTypeId RoomFinishBase { get ; }` |
| Property | RoomFinishCeiling | — | `public static ForgeTypeId RoomFinishCeiling { get ; }` |
| Property | RoomFinishFloor | — | `public static ForgeTypeId RoomFinishFloor { get ; }` |
| Property | RoomFinishWall | — | `public static ForgeTypeId RoomFinishWall { get ; }` |
| Property | RoomHeight | — | `public static ForgeTypeId RoomHeight { get ; }` |
| Property | RoomLevelId | — | `public static ForgeTypeId RoomLevelId { get ; }` |
| Property | RoomLightingLoadUnitsParam | — | `public static ForgeTypeId RoomLightingLoadUnitsParam { get ; }` |
| Property | RoomLowerOffset | — | `public static ForgeTypeId RoomLowerOffset { get ; }` |
| Property | RoomName | — | `public static ForgeTypeId RoomName { get ; }` |
| Property | RoomNumber | — | `public static ForgeTypeId RoomNumber { get ; }` |
| Property | RoomNumberOfPeopleParam | — | `public static ForgeTypeId RoomNumberOfPeopleParam { get ; }` |
| Property | RoomOccupancy | — | `public static ForgeTypeId RoomOccupancy { get ; }` |
| Property | RoomOccupancyUnitParam | — | `public static ForgeTypeId RoomOccupancyUnitParam { get ; }` |
| Property | RoomOutdoorAirInfoParam | — | `public static ForgeTypeId RoomOutdoorAirInfoParam { get ; }` |
| Property | RoomOutdoorAirPerAreaParam | — | `public static ForgeTypeId RoomOutdoorAirPerAreaParam { get ; }` |
| Property | RoomOutdoorAirPerPersonParam | — | `public static ForgeTypeId RoomOutdoorAirPerPersonParam { get ; }` |
| Property | RoomOutdoorAirflowParam | — | `public static ForgeTypeId RoomOutdoorAirflowParam { get ; }` |
| Property | RoomOutdoorAirflowStandardParam | — | `public static ForgeTypeId RoomOutdoorAirflowStandardParam { get ; }` |
| Property | RoomPeopleLatentHeatGainPerPersonParam | — | `public static ForgeTypeId RoomPeopleLatentHeatGainPerPersonParam { get ; }` |
| Property | RoomPeopleSensibleHeatGainPerPersonParam | — | `public static ForgeTypeId RoomPeopleSensibleHeatGainPerPersonParam { get ; }` |
| Property | RoomPeopleTotalHeatGainPerPersonParam | — | `public static ForgeTypeId RoomPeopleTotalHeatGainPerPersonParam { get ; }` |
| Property | RoomPerimeter | — | `public static ForgeTypeId RoomPerimeter { get ; }` |
| Property | RoomPhase | — | `public static ForgeTypeId RoomPhase { get ; }` |
| Property | RoomPhaseId | — | `public static ForgeTypeId RoomPhaseId { get ; }` |
| Property | RoomPlenumLightingParam | — | `public static ForgeTypeId RoomPlenumLightingParam { get ; }` |
| Property | RoomPowerLoadUnitsParam | — | `public static ForgeTypeId RoomPowerLoadUnitsParam { get ; }` |
| Property | RoomSpaceTypeParam | — | `public static ForgeTypeId RoomSpaceTypeParam { get ; }` |
| Property | RoomTagOrientationParam | — | `public static ForgeTypeId RoomTagOrientationParam { get ; }` |
| Property | RoomUpperLevel | — | `public static ForgeTypeId RoomUpperLevel { get ; }` |
| Property | RoomUpperOffset | — | `public static ForgeTypeId RoomUpperOffset { get ; }` |
| Property | RoomVolume | — | `public static ForgeTypeId RoomVolume { get ; }` |
| Property | RouteAnalysisSettingsParam | — | `public static ForgeTypeId RouteAnalysisSettingsParam { get ; }` |
| Property | RoutingPreferenceParam | — | `public static ForgeTypeId RoutingPreferenceParam { get ; }` |
| Property | RvtHostLevel | — | `public static ForgeTypeId RvtHostLevel { get ; }` |
| Property | RvtLevelOffset | — | `public static ForgeTypeId RvtLevelOffset { get ; }` |
| Property | RvtLinkFileNameWithoutExt | — | `public static ForgeTypeId RvtLinkFileNameWithoutExt { get ; }` |
| Property | RvtLinkInstanceName | — | `public static ForgeTypeId RvtLinkInstanceName { get ; }` |
| Property | RvtLinkInstanceProjectInformation | — | `public static ForgeTypeId RvtLinkInstanceProjectInformation { get ; }` |
| Property | RvtLinkPhaseMap | — | `public static ForgeTypeId RvtLinkPhaseMap { get ; }` |
| Property | RvtLinkReferenceType | — | `public static ForgeTypeId RvtLinkReferenceType { get ; }` |
| Property | RvtSourceLevel | — | `public static ForgeTypeId RvtSourceLevel { get ; }` |
| Property | ScheduleBaseLevelOffsetParam | — | `public static ForgeTypeId ScheduleBaseLevelOffsetParam { get ; }` |
| Property | ScheduleBaseLevelParam | — | `public static ForgeTypeId ScheduleBaseLevelParam { get ; }` |
| Property | ScheduleCategory | — | `public static ForgeTypeId ScheduleCategory { get ; }` |
| Property | ScheduleEmbeddedParam | — | `public static ForgeTypeId ScheduleEmbeddedParam { get ; }` |
| Property | ScheduleFieldsParam | — | `public static ForgeTypeId ScheduleFieldsParam { get ; }` |
| Property | ScheduleFilterParam | — | `public static ForgeTypeId ScheduleFilterParam { get ; }` |
| Property | ScheduleFormatParam | — | `public static ForgeTypeId ScheduleFormatParam { get ; }` |
| Property | ScheduleGroupParam | — | `public static ForgeTypeId ScheduleGroupParam { get ; }` |
| Property | ScheduleLevelParam | — | `public static ForgeTypeId ScheduleLevelParam { get ; }` |
| Property | ScheduleResizeRows | — | `public static ForgeTypeId ScheduleResizeRows { get ; }` |
| Property | ScheduleRotationOnSheet | — | `public static ForgeTypeId ScheduleRotationOnSheet { get ; }` |
| Property | ScheduleRowHeightInput | — | `public static ForgeTypeId ScheduleRowHeightInput { get ; }` |
| Property | ScheduleSheetAppearanceParam | — | `public static ForgeTypeId ScheduleSheetAppearanceParam { get ; }` |
| Property | ScheduleTopLevelOffsetParam | — | `public static ForgeTypeId ScheduleTopLevelOffsetParam { get ; }` |
| Property | ScheduleTopLevelParam | — | `public static ForgeTypeId ScheduleTopLevelParam { get ; }` |
| Property | ScheduleTypeForBrowser | — | `public static ForgeTypeId ScheduleTypeForBrowser { get ; }` |
| Property | SectionAttrHeadTag | — | `public static ForgeTypeId SectionAttrHeadTag { get ; }` |
| Property | SectionAttrTailLength | — | `public static ForgeTypeId SectionAttrTailLength { get ; }` |
| Property | SectionAttrTailTag | — | `public static ForgeTypeId SectionAttrTailTag { get ; }` |
| Property | SectionAttrTailWidth | — | `public static ForgeTypeId SectionAttrTailWidth { get ; }` |
| Property | SectionBrokenDisplayStyle | — | `public static ForgeTypeId SectionBrokenDisplayStyle { get ; }` |
| Property | SectionCoarserScalePulldownImperial | — | `public static ForgeTypeId SectionCoarserScalePulldownImperial { get ; }` |
| Property | SectionCoarserScalePulldownMetric | — | `public static ForgeTypeId SectionCoarserScalePulldownMetric { get ; }` |
| Property | SectionParentViewName | — | `public static ForgeTypeId SectionParentViewName { get ; }` |
| Property | SectionShowInOneViewOnly | — | `public static ForgeTypeId SectionShowInOneViewOnly { get ; }` |
| Property | SectionTag | — | `public static ForgeTypeId SectionTag { get ; }` |
| Property | SeekItemId | — | `public static ForgeTypeId SeekItemId { get ; }` |
| Property | SelectionEditableOnly | — | `public static ForgeTypeId SelectionEditableOnly { get ; }` |
| Property | SheetApprovedBy | — | `public static ForgeTypeId SheetApprovedBy { get ; }` |
| Property | SheetAssemblyAssemblyCode | — | `public static ForgeTypeId SheetAssemblyAssemblyCode { get ; }` |
| Property | SheetAssemblyAssemblyDescription | — | `public static ForgeTypeId SheetAssemblyAssemblyDescription { get ; }` |
| Property | SheetAssemblyCost | — | `public static ForgeTypeId SheetAssemblyCost { get ; }` |
| Property | SheetAssemblyDescription | — | `public static ForgeTypeId SheetAssemblyDescription { get ; }` |
| Property | SheetAssemblyKeynote | — | `public static ForgeTypeId SheetAssemblyKeynote { get ; }` |
| Property | SheetAssemblyManufacturer | — | `public static ForgeTypeId SheetAssemblyManufacturer { get ; }` |
| Property | SheetAssemblyModel | — | `public static ForgeTypeId SheetAssemblyModel { get ; }` |
| Property | SheetAssemblyName | — | `public static ForgeTypeId SheetAssemblyName { get ; }` |
| Property | SheetAssemblyTypeComments | — | `public static ForgeTypeId SheetAssemblyTypeComments { get ; }` |
| Property | SheetAssemblyTypeMark | — | `public static ForgeTypeId SheetAssemblyTypeMark { get ; }` |
| Property | SheetAssemblyUrl | — | `public static ForgeTypeId SheetAssemblyUrl { get ; }` |
| Property | SheetCheckedBy | — | `public static ForgeTypeId SheetCheckedBy { get ; }` |
| Property | SheetCurrentRevision | — | `public static ForgeTypeId SheetCurrentRevision { get ; }` |
| Property | SheetCurrentRevisionDate | — | `public static ForgeTypeId SheetCurrentRevisionDate { get ; }` |
| Property | SheetCurrentRevisionDescription | — | `public static ForgeTypeId SheetCurrentRevisionDescription { get ; }` |
| Property | SheetCurrentRevisionIssued | — | `public static ForgeTypeId SheetCurrentRevisionIssued { get ; }` |
| Property | SheetCurrentRevisionIssuedBy | — | `public static ForgeTypeId SheetCurrentRevisionIssuedBy { get ; }` |
| Property | SheetCurrentRevisionIssuedTo | — | `public static ForgeTypeId SheetCurrentRevisionIssuedTo { get ; }` |
| Property | SheetDate | — | `public static ForgeTypeId SheetDate { get ; }` |
| Property | SheetDesignedBy | — | `public static ForgeTypeId SheetDesignedBy { get ; }` |
| Property | SheetDrawnBy | — | `public static ForgeTypeId SheetDrawnBy { get ; }` |
| Property | SheetFilePath | — | `public static ForgeTypeId SheetFilePath { get ; }` |
| Property | SheetGuideGrid | — | `public static ForgeTypeId SheetGuideGrid { get ; }` |
| Property | SheetHeight | — | `public static ForgeTypeId SheetHeight { get ; }` |
| Property | SheetIssueDate | — | `public static ForgeTypeId SheetIssueDate { get ; }` |
| Property | SheetKeyNumber | — | `public static ForgeTypeId SheetKeyNumber { get ; }` |
| Property | SheetName | — | `public static ForgeTypeId SheetName { get ; }` |
| Property | SheetNumber | — | `public static ForgeTypeId SheetNumber { get ; }` |
| Property | SheetRevisionsOnSheet | — | `public static ForgeTypeId SheetRevisionsOnSheet { get ; }` |
| Property | SheetScale | — | `public static ForgeTypeId SheetScale { get ; }` |
| Property | SheetScheduled | — | `public static ForgeTypeId SheetScheduled { get ; }` |
| Property | SheetWidth | — | `public static ForgeTypeId SheetWidth { get ; }` |
| Property | ShowArrowheadToCutMark | — | `public static ForgeTypeId ShowArrowheadToCutMark { get ; }` |
| Property | ShowIconParam | — | `public static ForgeTypeId ShowIconParam { get ; }` |
| Property | ShowTitle | — | `public static ForgeTypeId ShowTitle { get ; }` |
| Property | SketchGridSpacingParam | — | `public static ForgeTypeId SketchGridSpacingParam { get ; }` |
| Property | SketchPlaneParam | — | `public static ForgeTypeId SketchPlaneParam { get ; }` |
| Property | SlabEdgeMaterialParam | — | `public static ForgeTypeId SlabEdgeMaterialParam { get ; }` |
| Property | SlabEdgeProfileParam | — | `public static ForgeTypeId SlabEdgeProfileParam { get ; }` |
| Property | SlantedColumnBaseCutStyle | — | `public static ForgeTypeId SlantedColumnBaseCutStyle { get ; }` |
| Property | SlantedColumnBaseExtension | — | `public static ForgeTypeId SlantedColumnBaseExtension { get ; }` |
| Property | SlantedColumnGeometryTreatmentBase | — | `public static ForgeTypeId SlantedColumnGeometryTreatmentBase { get ; }` |
| Property | SlantedColumnGeometryTreatmentTop | — | `public static ForgeTypeId SlantedColumnGeometryTreatmentTop { get ; }` |
| Property | SlantedColumnTopCutStyle | — | `public static ForgeTypeId SlantedColumnTopCutStyle { get ; }` |
| Property | SlantedColumnTopExtension | — | `public static ForgeTypeId SlantedColumnTopExtension { get ; }` |
| Property | SlantedColumnTypeParam | — | `public static ForgeTypeId SlantedColumnTypeParam { get ; }` |
| Property | SlopeArrowLevelEnd | — | `public static ForgeTypeId SlopeArrowLevelEnd { get ; }` |
| Property | SlopeArrowLevelStart | — | `public static ForgeTypeId SlopeArrowLevelStart { get ; }` |
| Property | SlopeEndHeight | — | `public static ForgeTypeId SlopeEndHeight { get ; }` |
| Property | SlopeStartHeight | — | `public static ForgeTypeId SlopeStartHeight { get ; }` |
| Property | SpaceAirChangesPerHour | — | `public static ForgeTypeId SpaceAirChangesPerHour { get ; }` |
| Property | SpaceAirflowPerAreaParam | — | `public static ForgeTypeId SpaceAirflowPerAreaParam { get ; }` |
| Property | SpaceArea | — | `public static ForgeTypeId SpaceArea { get ; }` |
| Property | SpaceAreaPerPersonParam | — | `public static ForgeTypeId SpaceAreaPerPersonParam { get ; }` |
| Property | SpaceAssocRoomName | — | `public static ForgeTypeId SpaceAssocRoomName { get ; }` |
| Property | SpaceAssocRoomNumber | — | `public static ForgeTypeId SpaceAssocRoomNumber { get ; }` |
| Property | SpaceCarpetingParam | — | `public static ForgeTypeId SpaceCarpetingParam { get ; }` |
| Property | SpaceComposednameParam | — | `public static ForgeTypeId SpaceComposednameParam { get ; }` |
| Property | SpaceConditionType | — | `public static ForgeTypeId SpaceConditionType { get ; }` |
| Property | SpaceCoolingSetPoint | — | `public static ForgeTypeId SpaceCoolingSetPoint { get ; }` |
| Property | SpaceDehumidificationSetPoint | — | `public static ForgeTypeId SpaceDehumidificationSetPoint { get ; }` |
| Property | SpaceElecEquipmentRadiantPercentageParam | — | `public static ForgeTypeId SpaceElecEquipmentRadiantPercentageParam { get ; }` |
| Property | SpaceHeatingSetPoint | — | `public static ForgeTypeId SpaceHeatingSetPoint { get ; }` |
| Property | SpaceHumidificationSetPoint | — | `public static ForgeTypeId SpaceHumidificationSetPoint { get ; }` |
| Property | SpaceInfiltrationAirflow | — | `public static ForgeTypeId SpaceInfiltrationAirflow { get ; }` |
| Property | SpaceInfiltrationAirflowPerArea | — | `public static ForgeTypeId SpaceInfiltrationAirflowPerArea { get ; }` |
| Property | SpaceInfiltrationParam | — | `public static ForgeTypeId SpaceInfiltrationParam { get ; }` |
| Property | SpaceIsOccupiable | — | `public static ForgeTypeId SpaceIsOccupiable { get ; }` |
| Property | SpaceIsPlenum | — | `public static ForgeTypeId SpaceIsPlenum { get ; }` |
| Property | SpaceLightingLoadParam | — | `public static ForgeTypeId SpaceLightingLoadParam { get ; }` |
| Property | SpaceLightingLoadPerAreaParam | — | `public static ForgeTypeId SpaceLightingLoadPerAreaParam { get ; }` |
| Property | SpaceLightingScheduleParam | — | `public static ForgeTypeId SpaceLightingScheduleParam { get ; }` |
| Property | SpaceNameParam | — | `public static ForgeTypeId SpaceNameParam { get ; }` |
| Property | SpaceNumberOfPeople | — | `public static ForgeTypeId SpaceNumberOfPeople { get ; }` |
| Property | SpaceNumberParam | — | `public static ForgeTypeId SpaceNumberParam { get ; }` |
| Property | SpaceOccupancyScheduleParam | — | `public static ForgeTypeId SpaceOccupancyScheduleParam { get ; }` |
| Property | SpaceOutdoorAirflow | — | `public static ForgeTypeId SpaceOutdoorAirflow { get ; }` |
| Property | SpaceOutdoorAirflowPerArea | — | `public static ForgeTypeId SpaceOutdoorAirflowPerArea { get ; }` |
| Property | SpaceOutdoorAirflowPerPerson | — | `public static ForgeTypeId SpaceOutdoorAirflowPerPerson { get ; }` |
| Property | SpacePeopleActivityLevelParam | — | `public static ForgeTypeId SpacePeopleActivityLevelParam { get ; }` |
| Property | SpacePeopleLatentHeatGainPerPersonParam | — | `public static ForgeTypeId SpacePeopleLatentHeatGainPerPersonParam { get ; }` |
| Property | SpacePeopleLoadParam | — | `public static ForgeTypeId SpacePeopleLoadParam { get ; }` |
| Property | SpacePeopleSensibleHeatGainPerPersonParam | — | `public static ForgeTypeId SpacePeopleSensibleHeatGainPerPersonParam { get ; }` |
| Property | SpacePowerLoadParam | — | `public static ForgeTypeId SpacePowerLoadParam { get ; }` |
| Property | SpacePowerLoadPerAreaParam | — | `public static ForgeTypeId SpacePowerLoadPerAreaParam { get ; }` |
| Property | SpacePowerScheduleParam | — | `public static ForgeTypeId SpacePowerScheduleParam { get ; }` |
| Property | SpaceReferenceLevelParam | — | `public static ForgeTypeId SpaceReferenceLevelParam { get ; }` |
| Property | SpaceTypeGbxml | — | `public static ForgeTypeId SpaceTypeGbxml { get ; }` |
| Property | SpaceVolume | — | `public static ForgeTypeId SpaceVolume { get ; }` |
| Property | SpaceZoneName | — | `public static ForgeTypeId SpaceZoneName { get ; }` |
| Property | SpacingAppend | — | `public static ForgeTypeId SpacingAppend { get ; }` |
| Property | SpacingJustification | — | `public static ForgeTypeId SpacingJustification { get ; }` |
| Property | SpacingJustificationHoriz | — | `public static ForgeTypeId SpacingJustificationHoriz { get ; }` |
| Property | SpacingJustificationU | — | `public static ForgeTypeId SpacingJustificationU { get ; }` |
| Property | SpacingJustificationV | — | `public static ForgeTypeId SpacingJustificationV { get ; }` |
| Property | SpacingJustificationVert | — | `public static ForgeTypeId SpacingJustificationVert { get ; }` |
| Property | SpacingJustificationn1 | — | `public static ForgeTypeId SpacingJustificationn1 { get ; }` |
| Property | SpacingJustificationn2 | — | `public static ForgeTypeId SpacingJustificationn2 { get ; }` |
| Property | SpacingLayout | — | `public static ForgeTypeId SpacingLayout { get ; }` |
| Property | SpacingLayoutHoriz | — | `public static ForgeTypeId SpacingLayoutHoriz { get ; }` |
| Property | SpacingLayoutU | — | `public static ForgeTypeId SpacingLayoutU { get ; }` |
| Property | SpacingLayoutV | — | `public static ForgeTypeId SpacingLayoutV { get ; }` |
| Property | SpacingLayoutVert | — | `public static ForgeTypeId SpacingLayoutVert { get ; }` |
| Property | SpacingLayoutn1 | — | `public static ForgeTypeId SpacingLayoutn1 { get ; }` |
| Property | SpacingLayoutn2 | — | `public static ForgeTypeId SpacingLayoutn2 { get ; }` |
| Property | SpacingLength | — | `public static ForgeTypeId SpacingLength { get ; }` |
| Property | SpacingLengthHoriz | — | `public static ForgeTypeId SpacingLengthHoriz { get ; }` |
| Property | SpacingLengthU | — | `public static ForgeTypeId SpacingLengthU { get ; }` |
| Property | SpacingLengthV | — | `public static ForgeTypeId SpacingLengthV { get ; }` |
| Property | SpacingLengthVert | — | `public static ForgeTypeId SpacingLengthVert { get ; }` |
| Property | SpacingLengthn1 | — | `public static ForgeTypeId SpacingLengthn1 { get ; }` |
| Property | SpacingLengthn2 | — | `public static ForgeTypeId SpacingLengthn2 { get ; }` |
| Property | SpacingNumDivisions | — | `public static ForgeTypeId SpacingNumDivisions { get ; }` |
| Property | SpacingNumDivisionsHoriz | — | `public static ForgeTypeId SpacingNumDivisionsHoriz { get ; }` |
| Property | SpacingNumDivisionsU | — | `public static ForgeTypeId SpacingNumDivisionsU { get ; }` |
| Property | SpacingNumDivisionsV | — | `public static ForgeTypeId SpacingNumDivisionsV { get ; }` |
| Property | SpacingNumDivisionsVert | — | `public static ForgeTypeId SpacingNumDivisionsVert { get ; }` |
| Property | SpacingNumDivisionsn1 | — | `public static ForgeTypeId SpacingNumDivisionsn1 { get ; }` |
| Property | SpacingNumDivisionsn2 | — | `public static ForgeTypeId SpacingNumDivisionsn2 { get ; }` |
| Property | SpanDirInstParamAngle | — | `public static ForgeTypeId SpanDirInstParamAngle { get ; }` |
| Property | SpanDirSymParamBottom | — | `public static ForgeTypeId SpanDirSymParamBottom { get ; }` |
| Property | SpanDirSymParamLeft | — | `public static ForgeTypeId SpanDirSymParamLeft { get ; }` |
| Property | SpanDirSymParamRight | — | `public static ForgeTypeId SpanDirSymParamRight { get ; }` |
| Property | SpanDirSymParamTop | — | `public static ForgeTypeId SpanDirSymParamTop { get ; }` |
| Property | SpatialFieldMgrCurrentName | — | `public static ForgeTypeId SpatialFieldMgrCurrentName { get ; }` |
| Property | SpatialFieldMgrDescription | — | `public static ForgeTypeId SpatialFieldMgrDescription { get ; }` |
| Property | SpatialFieldMgrLegendHeight | — | `public static ForgeTypeId SpatialFieldMgrLegendHeight { get ; }` |
| Property | SpatialFieldMgrLegendHorOriginGap | — | `public static ForgeTypeId SpatialFieldMgrLegendHorOriginGap { get ; }` |
| Property | SpatialFieldMgrLegendShowConfigName | — | `public static ForgeTypeId SpatialFieldMgrLegendShowConfigName { get ; }` |
| Property | SpatialFieldMgrLegendShowDescription | — | `public static ForgeTypeId SpatialFieldMgrLegendShowDescription { get ; }` |
| Property | SpatialFieldMgrLegendTextType | — | `public static ForgeTypeId SpatialFieldMgrLegendTextType { get ; }` |
| Property | SpatialFieldMgrLegendVertOriginGap | — | `public static ForgeTypeId SpatialFieldMgrLegendVertOriginGap { get ; }` |
| Property | SpatialFieldMgrLegendWidth | — | `public static ForgeTypeId SpatialFieldMgrLegendWidth { get ; }` |
| Property | SpatialFieldMgrRange | — | `public static ForgeTypeId SpatialFieldMgrRange { get ; }` |
| Property | SpatialFieldMgrResultsVisibility | — | `public static ForgeTypeId SpatialFieldMgrResultsVisibility { get ; }` |
| Property | SpecifySlopeOrOffset | — | `public static ForgeTypeId SpecifySlopeOrOffset { get ; }` |
| Property | SpotCoordinateBase | — | `public static ForgeTypeId SpotCoordinateBase { get ; }` |
| Property | SpotCoordinateBottomPrefix | — | `public static ForgeTypeId SpotCoordinateBottomPrefix { get ; }` |
| Property | SpotCoordinateBottomSuffix | — | `public static ForgeTypeId SpotCoordinateBottomSuffix { get ; }` |
| Property | SpotCoordinateElevationPrefix | — | `public static ForgeTypeId SpotCoordinateElevationPrefix { get ; }` |
| Property | SpotCoordinateElevationSuffix | — | `public static ForgeTypeId SpotCoordinateElevationSuffix { get ; }` |
| Property | SpotCoordinateIncludeElevation | — | `public static ForgeTypeId SpotCoordinateIncludeElevation { get ; }` |
| Property | SpotCoordinateTopPrefix | — | `public static ForgeTypeId SpotCoordinateTopPrefix { get ; }` |
| Property | SpotCoordinateTopSuffix | — | `public static ForgeTypeId SpotCoordinateTopSuffix { get ; }` |
| Property | SpotDimLeader | — | `public static ForgeTypeId SpotDimLeader { get ; }` |
| Property | SpotDimLeaderLine | — | `public static ForgeTypeId SpotDimLeaderLine { get ; }` |
| Property | SpotDimStyleSlopeUnits | — | `public static ForgeTypeId SpotDimStyleSlopeUnits { get ; }` |
| Property | SpotDimStyleSlopeUnitsAlt | — | `public static ForgeTypeId SpotDimStyleSlopeUnitsAlt { get ; }` |
| Property | SpotElevBase | — | `public static ForgeTypeId SpotElevBase { get ; }` |
| Property | SpotElevBendLeader | — | `public static ForgeTypeId SpotElevBendLeader { get ; }` |
| Property | SpotElevBotValue | — | `public static ForgeTypeId SpotElevBotValue { get ; }` |
| Property | SpotElevDisplayElevations | — | `public static ForgeTypeId SpotElevDisplayElevations { get ; }` |
| Property | SpotElevFlipTextVert | — | `public static ForgeTypeId SpotElevFlipTextVert { get ; }` |
| Property | SpotElevIndBottom | — | `public static ForgeTypeId SpotElevIndBottom { get ; }` |
| Property | SpotElevIndElevation | — | `public static ForgeTypeId SpotElevIndElevation { get ; }` |
| Property | SpotElevIndEw | — | `public static ForgeTypeId SpotElevIndEw { get ; }` |
| Property | SpotElevIndNs | — | `public static ForgeTypeId SpotElevIndNs { get ; }` |
| Property | SpotElevIndTop | — | `public static ForgeTypeId SpotElevIndTop { get ; }` |
| Property | SpotElevIndType | — | `public static ForgeTypeId SpotElevIndType { get ; }` |
| Property | SpotElevIndTypeBottom | — | `public static ForgeTypeId SpotElevIndTypeBottom { get ; }` |
| Property | SpotElevIndTypeElevation | — | `public static ForgeTypeId SpotElevIndTypeElevation { get ; }` |
| Property | SpotElevIndTypeTop | — | `public static ForgeTypeId SpotElevIndTypeTop { get ; }` |
| Property | SpotElevLeaderArrowhead | — | `public static ForgeTypeId SpotElevLeaderArrowhead { get ; }` |
| Property | SpotElevLinePen | — | `public static ForgeTypeId SpotElevLinePen { get ; }` |
| Property | SpotElevLowerPrefix | — | `public static ForgeTypeId SpotElevLowerPrefix { get ; }` |
| Property | SpotElevLowerSuffix | — | `public static ForgeTypeId SpotElevLowerSuffix { get ; }` |
| Property | SpotElevLowerValue | — | `public static ForgeTypeId SpotElevLowerValue { get ; }` |
| Property | SpotElevRelativeBase | — | `public static ForgeTypeId SpotElevRelativeBase { get ; }` |
| Property | SpotElevRotateWithComponent | — | `public static ForgeTypeId SpotElevRotateWithComponent { get ; }` |
| Property | SpotElevSingleOrUpperPrefix | — | `public static ForgeTypeId SpotElevSingleOrUpperPrefix { get ; }` |
| Property | SpotElevSingleOrUpperSuffix | — | `public static ForgeTypeId SpotElevSingleOrUpperSuffix { get ; }` |
| Property | SpotElevSingleOrUpperValue | — | `public static ForgeTypeId SpotElevSingleOrUpperValue { get ; }` |
| Property | SpotElevSymbol | — | `public static ForgeTypeId SpotElevSymbol { get ; }` |
| Property | SpotElevTextHorizOffset | — | `public static ForgeTypeId SpotElevTextHorizOffset { get ; }` |
| Property | SpotElevTextLocation | — | `public static ForgeTypeId SpotElevTextLocation { get ; }` |
| Property | SpotElevTextOrientation | — | `public static ForgeTypeId SpotElevTextOrientation { get ; }` |
| Property | SpotElevTickMarkPen | — | `public static ForgeTypeId SpotElevTickMarkPen { get ; }` |
| Property | SpotElevTopValue | — | `public static ForgeTypeId SpotElevTopValue { get ; }` |
| Property | SpotSlopeLeaderLength | — | `public static ForgeTypeId SpotSlopeLeaderLength { get ; }` |
| Property | SpotSlopeOffsetFromReference | — | `public static ForgeTypeId SpotSlopeOffsetFromReference { get ; }` |
| Property | SpotSlopePrefix | — | `public static ForgeTypeId SpotSlopePrefix { get ; }` |
| Property | SpotSlopeSlopeDirection | — | `public static ForgeTypeId SpotSlopeSlopeDirection { get ; }` |
| Property | SpotSlopeSlopeRepresentation | — | `public static ForgeTypeId SpotSlopeSlopeRepresentation { get ; }` |
| Property | SpotSlopeSuffix | — | `public static ForgeTypeId SpotSlopeSuffix { get ; }` |
| Property | SpotTextFromLeader | — | `public static ForgeTypeId SpotTextFromLeader { get ; }` |
| Property | SsePointBasetypeEnum | — | `public static ForgeTypeId SsePointBasetypeEnum { get ; }` |
| Property | SsePointElevation | — | `public static ForgeTypeId SsePointElevation { get ; }` |
| Property | SsePointElevationBaseType | — | `public static ForgeTypeId SsePointElevationBaseType { get ; }` |
| Property | SsePointOffsetFromSurface | — | `public static ForgeTypeId SsePointOffsetFromSurface { get ; }` |
| Property | StairsActualNumRisers | — | `public static ForgeTypeId StairsActualNumRisers { get ; }` |
| Property | StairsActualNumberOfRisers | — | `public static ForgeTypeId StairsActualNumberOfRisers { get ; }` |
| Property | StairsActualRiserHeight | — | `public static ForgeTypeId StairsActualRiserHeight { get ; }` |
| Property | StairsActualTreadDepth | — | `public static ForgeTypeId StairsActualTreadDepth { get ; }` |
| Property | StairsAttrBodyMaterial | — | `public static ForgeTypeId StairsAttrBodyMaterial { get ; }` |
| Property | StairsAttrBreakSymInCutline | — | `public static ForgeTypeId StairsAttrBreakSymInCutline { get ; }` |
| Property | StairsAttrCalcEnabled | — | `public static ForgeTypeId StairsAttrCalcEnabled { get ; }` |
| Property | StairsAttrCalcMax | — | `public static ForgeTypeId StairsAttrCalcMax { get ; }` |
| Property | StairsAttrCalcMin | — | `public static ForgeTypeId StairsAttrCalcMin { get ; }` |
| Property | StairsAttrEqResult | — | `public static ForgeTypeId StairsAttrEqResult { get ; }` |
| Property | StairsAttrFirstRiser | — | `public static ForgeTypeId StairsAttrFirstRiser { get ; }` |
| Property | StairsAttrLandingCarriage | — | `public static ForgeTypeId StairsAttrLandingCarriage { get ; }` |
| Property | StairsAttrLandingsOverlapping | — | `public static ForgeTypeId StairsAttrLandingsOverlapping { get ; }` |
| Property | StairsAttrLastRiser | — | `public static ForgeTypeId StairsAttrLastRiser { get ; }` |
| Property | StairsAttrLeftSideStringer | — | `public static ForgeTypeId StairsAttrLeftSideStringer { get ; }` |
| Property | StairsAttrMaxRiserHeight | — | `public static ForgeTypeId StairsAttrMaxRiserHeight { get ; }` |
| Property | StairsAttrMinimumTreadDepth | — | `public static ForgeTypeId StairsAttrMinimumTreadDepth { get ; }` |
| Property | StairsAttrMonolithicStairs | — | `public static ForgeTypeId StairsAttrMonolithicStairs { get ; }` |
| Property | StairsAttrNosingLength | — | `public static ForgeTypeId StairsAttrNosingLength { get ; }` |
| Property | StairsAttrNosingPlacement | — | `public static ForgeTypeId StairsAttrNosingPlacement { get ; }` |
| Property | StairsAttrNumMidStringers | — | `public static ForgeTypeId StairsAttrNumMidStringers { get ; }` |
| Property | StairsAttrRightSideStringer | — | `public static ForgeTypeId StairsAttrRightSideStringer { get ; }` |
| Property | StairsAttrRiserAngle | — | `public static ForgeTypeId StairsAttrRiserAngle { get ; }` |
| Property | StairsAttrRiserMaterial | — | `public static ForgeTypeId StairsAttrRiserMaterial { get ; }` |
| Property | StairsAttrRiserMult | — | `public static ForgeTypeId StairsAttrRiserMult { get ; }` |
| Property | StairsAttrRiserThickness | — | `public static ForgeTypeId StairsAttrRiserThickness { get ; }` |
| Property | StairsAttrRiserTreadConnect | — | `public static ForgeTypeId StairsAttrRiserTreadConnect { get ; }` |
| Property | StairsAttrRiserType | — | `public static ForgeTypeId StairsAttrRiserType { get ; }` |
| Property | StairsAttrRisersPresent | — | `public static ForgeTypeId StairsAttrRisersPresent { get ; }` |
| Property | StairsAttrSideStringerTypeParam | — | `public static ForgeTypeId StairsAttrSideStringerTypeParam { get ; }` |
| Property | StairsAttrStairCalculator | — | `public static ForgeTypeId StairsAttrStairCalculator { get ; }` |
| Property | StairsAttrStairsBottom | — | `public static ForgeTypeId StairsAttrStairsBottom { get ; }` |
| Property | StairsAttrStairsCutOffset | — | `public static ForgeTypeId StairsAttrStairsCutOffset { get ; }` |
| Property | StairsAttrStringerCarriage | — | `public static ForgeTypeId StairsAttrStringerCarriage { get ; }` |
| Property | StairsAttrStringerHeight | — | `public static ForgeTypeId StairsAttrStringerHeight { get ; }` |
| Property | StairsAttrStringerMaterial | — | `public static ForgeTypeId StairsAttrStringerMaterial { get ; }` |
| Property | StairsAttrStringerOffset | — | `public static ForgeTypeId StairsAttrStringerOffset { get ; }` |
| Property | StairsAttrStringerThickness | — | `public static ForgeTypeId StairsAttrStringerThickness { get ; }` |
| Property | StairsAttrTextFont | — | `public static ForgeTypeId StairsAttrTextFont { get ; }` |
| Property | StairsAttrTextSize | — | `public static ForgeTypeId StairsAttrTextSize { get ; }` |
| Property | StairsAttrTreadFrontProfile | — | `public static ForgeTypeId StairsAttrTreadFrontProfile { get ; }` |
| Property | StairsAttrTreadMaterial | — | `public static ForgeTypeId StairsAttrTreadMaterial { get ; }` |
| Property | StairsAttrTreadMult | — | `public static ForgeTypeId StairsAttrTreadMult { get ; }` |
| Property | StairsAttrTreadThickness | — | `public static ForgeTypeId StairsAttrTreadThickness { get ; }` |
| Property | StairsAttrTreadWidth | — | `public static ForgeTypeId StairsAttrTreadWidth { get ; }` |
| Property | StairsAttrTrimTop | — | `public static ForgeTypeId StairsAttrTrimTop { get ; }` |
| Property | StairsBaseLevel | — | `public static ForgeTypeId StairsBaseLevel { get ; }` |
| Property | StairsBaseLevelParam | — | `public static ForgeTypeId StairsBaseLevelParam { get ; }` |
| Property | StairsBaseOffset | — | `public static ForgeTypeId StairsBaseOffset { get ; }` |
| Property | StairsCurveType | — | `public static ForgeTypeId StairsCurveType { get ; }` |
| Property | StairsDbgShowAnnotationCutMark | — | `public static ForgeTypeId StairsDbgShowAnnotationCutMark { get ; }` |
| Property | StairsDbgShowBoundary2d | — | `public static ForgeTypeId StairsDbgShowBoundary2d { get ; }` |
| Property | StairsDbgShowBoundary3d | — | `public static ForgeTypeId StairsDbgShowBoundary3d { get ; }` |
| Property | StairsDbgShowLandingBoundary | — | `public static ForgeTypeId StairsDbgShowLandingBoundary { get ; }` |
| Property | StairsDbgShowLandingFaces | — | `public static ForgeTypeId StairsDbgShowLandingFaces { get ; }` |
| Property | StairsDbgShowLandingPath | — | `public static ForgeTypeId StairsDbgShowLandingPath { get ; }` |
| Property | StairsDbgShowLeftRunBoundary2d | — | `public static ForgeTypeId StairsDbgShowLeftRunBoundary2d { get ; }` |
| Property | StairsDbgShowLeftRunBoundary3d | — | `public static ForgeTypeId StairsDbgShowLeftRunBoundary3d { get ; }` |
| Property | StairsDbgShowMonolithicSupportCorseGeom | — | `public static ForgeTypeId StairsDbgShowMonolithicSupportCorseGeom { get ; }` |
| Property | StairsDbgShowMonolithicSupportGeom | — | `public static ForgeTypeId StairsDbgShowMonolithicSupportGeom { get ; }` |
| Property | StairsDbgShowRightRunBoundary2d | — | `public static ForgeTypeId StairsDbgShowRightRunBoundary2d { get ; }` |
| Property | StairsDbgShowRightRunBoundary3d | — | `public static ForgeTypeId StairsDbgShowRightRunBoundary3d { get ; }` |
| Property | StairsDbgShowRunCorseGeom | — | `public static ForgeTypeId StairsDbgShowRunCorseGeom { get ; }` |
| Property | StairsDbgShowRunGeom | — | `public static ForgeTypeId StairsDbgShowRunGeom { get ; }` |
| Property | StairsDbgShowRunNosing | — | `public static ForgeTypeId StairsDbgShowRunNosing { get ; }` |
| Property | StairsDbgShowRunOutlineForPlan | — | `public static ForgeTypeId StairsDbgShowRunOutlineForPlan { get ; }` |
| Property | StairsDbgShowRunPath2d | — | `public static ForgeTypeId StairsDbgShowRunPath2d { get ; }` |
| Property | StairsDbgShowRunPath3d | — | `public static ForgeTypeId StairsDbgShowRunPath3d { get ; }` |
| Property | StairsDbgShowRunRiser | — | `public static ForgeTypeId StairsDbgShowRunRiser { get ; }` |
| Property | StairsDbgShowSupportPath | — | `public static ForgeTypeId StairsDbgShowSupportPath { get ; }` |
| Property | StairsDbgShowTreadFaces | — | `public static ForgeTypeId StairsDbgShowTreadFaces { get ; }` |
| Property | StairsDbgShowTriserCorseGeom | — | `public static ForgeTypeId StairsDbgShowTriserCorseGeom { get ; }` |
| Property | StairsDbgShowTriserGeom | — | `public static ForgeTypeId StairsDbgShowTriserGeom { get ; }` |
| Property | StairsDesiredNumRisers | — | `public static ForgeTypeId StairsDesiredNumRisers { get ; }` |
| Property | StairsDesiredNumberOfRisers | — | `public static ForgeTypeId StairsDesiredNumberOfRisers { get ; }` |
| Property | StairsDownText | — | `public static ForgeTypeId StairsDownText { get ; }` |
| Property | StairsEnableCalculationRuleChecking | — | `public static ForgeTypeId StairsEnableCalculationRuleChecking { get ; }` |
| Property | StairsInstAlwaysUp | — | `public static ForgeTypeId StairsInstAlwaysUp { get ; }` |
| Property | StairsInstDownArrowOn | — | `public static ForgeTypeId StairsInstDownArrowOn { get ; }` |
| Property | StairsInstDownLabelOn | — | `public static ForgeTypeId StairsInstDownLabelOn { get ; }` |
| Property | StairsInstDownLabelText | — | `public static ForgeTypeId StairsInstDownLabelText { get ; }` |
| Property | StairsInstUpArrowOn | — | `public static ForgeTypeId StairsInstUpArrowOn { get ; }` |
| Property | StairsInstUpLabelOn | — | `public static ForgeTypeId StairsInstUpLabelOn { get ; }` |
| Property | StairsInstUpLabelText | — | `public static ForgeTypeId StairsInstUpLabelText { get ; }` |
| Property | StairsLandingBaseElevation | — | `public static ForgeTypeId StairsLandingBaseElevation { get ; }` |
| Property | StairsLandingOverridden | — | `public static ForgeTypeId StairsLandingOverridden { get ; }` |
| Property | StairsLandingStructural | — | `public static ForgeTypeId StairsLandingStructural { get ; }` |
| Property | StairsLandingThickness | — | `public static ForgeTypeId StairsLandingThickness { get ; }` |
| Property | StairsLandingtypeHasMonolithicSupport | — | `public static ForgeTypeId StairsLandingtypeHasMonolithicSupport { get ; }` |
| Property | StairsLandingtypeLandingMaterial | — | `public static ForgeTypeId StairsLandingtypeLandingMaterial { get ; }` |
| Property | StairsLandingtypeStructure | — | `public static ForgeTypeId StairsLandingtypeStructure { get ; }` |
| Property | StairsLandingtypeThickness | — | `public static ForgeTypeId StairsLandingtypeThickness { get ; }` |
| Property | StairsLandingtypeTreadriserType | — | `public static ForgeTypeId StairsLandingtypeTreadriserType { get ; }` |
| Property | StairsLandingtypeUseSameTriserAsRun | — | `public static ForgeTypeId StairsLandingtypeUseSameTriserAsRun { get ; }` |
| Property | StairsMinAutomaticLandingDepth | — | `public static ForgeTypeId StairsMinAutomaticLandingDepth { get ; }` |
| Property | StairsMultistoryTopLevelParam | — | `public static ForgeTypeId StairsMultistoryTopLevelParam { get ; }` |
| Property | StairsMultistoryUpToLevel | — | `public static ForgeTypeId StairsMultistoryUpToLevel { get ; }` |
| Property | StairsPathFullStepArrow | — | `public static ForgeTypeId StairsPathFullStepArrow { get ; }` |
| Property | StairsPathStartExtension | — | `public static ForgeTypeId StairsPathStartExtension { get ; }` |
| Property | StairsPathStartFromRiser | — | `public static ForgeTypeId StairsPathStartFromRiser { get ; }` |
| Property | StairsRailingAngledConnection | — | `public static ForgeTypeId StairsRailingAngledConnection { get ; }` |
| Property | StairsRailingBalusterBottomAngle | — | `public static ForgeTypeId StairsRailingBalusterBottomAngle { get ; }` |
| Property | StairsRailingBalusterFamily | — | `public static ForgeTypeId StairsRailingBalusterFamily { get ; }` |
| Property | StairsRailingBalusterHeight | — | `public static ForgeTypeId StairsRailingBalusterHeight { get ; }` |
| Property | StairsRailingBalusterIsPost | — | `public static ForgeTypeId StairsRailingBalusterIsPost { get ; }` |
| Property | StairsRailingBalusterLength | — | `public static ForgeTypeId StairsRailingBalusterLength { get ; }` |
| Property | StairsRailingBalusterOffset | — | `public static ForgeTypeId StairsRailingBalusterOffset { get ; }` |
| Property | StairsRailingBalusterPlacement | — | `public static ForgeTypeId StairsRailingBalusterPlacement { get ; }` |
| Property | StairsRailingBalusterShape | — | `public static ForgeTypeId StairsRailingBalusterShape { get ; }` |
| Property | StairsRailingBalusterSlopeAngle | — | `public static ForgeTypeId StairsRailingBalusterSlopeAngle { get ; }` |
| Property | StairsRailingBalusterSpacing | — | `public static ForgeTypeId StairsRailingBalusterSpacing { get ; }` |
| Property | StairsRailingBalusterSpacingType | — | `public static ForgeTypeId StairsRailingBalusterSpacingType { get ; }` |
| Property | StairsRailingBalusterTopAngle | — | `public static ForgeTypeId StairsRailingBalusterTopAngle { get ; }` |
| Property | StairsRailingBalusterWidth | — | `public static ForgeTypeId StairsRailingBalusterWidth { get ; }` |
| Property | StairsRailingBalustersPerTread | — | `public static ForgeTypeId StairsRailingBalustersPerTread { get ; }` |
| Property | StairsRailingBaseLevelParam | — | `public static ForgeTypeId StairsRailingBaseLevelParam { get ; }` |
| Property | StairsRailingConnection | — | `public static ForgeTypeId StairsRailingConnection { get ; }` |
| Property | StairsRailingHeight | — | `public static ForgeTypeId StairsRailingHeight { get ; }` |
| Property | StairsRailingHeightOffset | — | `public static ForgeTypeId StairsRailingHeightOffset { get ; }` |
| Property | StairsRailingHeightShiftType | — | `public static ForgeTypeId StairsRailingHeightShiftType { get ; }` |
| Property | StairsRailingHeightShiftVal | — | `public static ForgeTypeId StairsRailingHeightShiftVal { get ; }` |
| Property | StairsRailingPlacementOffset | — | `public static ForgeTypeId StairsRailingPlacementOffset { get ; }` |
| Property | StairsRailingRailHeight | — | `public static ForgeTypeId StairsRailingRailHeight { get ; }` |
| Property | StairsRailingRailName | — | `public static ForgeTypeId StairsRailingRailName { get ; }` |
| Property | StairsRailingRailOffset | — | `public static ForgeTypeId StairsRailingRailOffset { get ; }` |
| Property | StairsRailingRailStructure | — | `public static ForgeTypeId StairsRailingRailStructure { get ; }` |
| Property | StairsRailingShape | — | `public static ForgeTypeId StairsRailingShape { get ; }` |
| Property | StairsRailingTangentConnection | — | `public static ForgeTypeId StairsRailingTangentConnection { get ; }` |
| Property | StairsRailingThickness | — | `public static ForgeTypeId StairsRailingThickness { get ; }` |
| Property | StairsRailingWidth | — | `public static ForgeTypeId StairsRailingWidth { get ; }` |
| Property | StairsRunActualNumberOfRisers | — | `public static ForgeTypeId StairsRunActualNumberOfRisers { get ; }` |
| Property | StairsRunActualNumberOfTreads | — | `public static ForgeTypeId StairsRunActualNumberOfTreads { get ; }` |
| Property | StairsRunActualRiserHeight | — | `public static ForgeTypeId StairsRunActualRiserHeight { get ; }` |
| Property | StairsRunActualRunWidth | — | `public static ForgeTypeId StairsRunActualRunWidth { get ; }` |
| Property | StairsRunActualTreadDepth | — | `public static ForgeTypeId StairsRunActualTreadDepth { get ; }` |
| Property | StairsRunBeginWithRiser | — | `public static ForgeTypeId StairsRunBeginWithRiser { get ; }` |
| Property | StairsRunBottomElevation | — | `public static ForgeTypeId StairsRunBottomElevation { get ; }` |
| Property | StairsRunCcw | — | `public static ForgeTypeId StairsRunCcw { get ; }` |
| Property | StairsRunCenterMarkVisible | — | `public static ForgeTypeId StairsRunCenterMarkVisible { get ; }` |
| Property | StairsRunCreateAutoLanding | — | `public static ForgeTypeId StairsRunCreateAutoLanding { get ; }` |
| Property | StairsRunEndWithRiser | — | `public static ForgeTypeId StairsRunEndWithRiser { get ; }` |
| Property | StairsRunExtendBelowRiserBase | — | `public static ForgeTypeId StairsRunExtendBelowRiserBase { get ; }` |
| Property | StairsRunExtendBelowTreadBase | — | `public static ForgeTypeId StairsRunExtendBelowTreadBase { get ; }` |
| Property | StairsRunHeight | — | `public static ForgeTypeId StairsRunHeight { get ; }` |
| Property | StairsRunLocationpathJustfication | — | `public static ForgeTypeId StairsRunLocationpathJustfication { get ; }` |
| Property | StairsRunOverridden | — | `public static ForgeTypeId StairsRunOverridden { get ; }` |
| Property | StairsRunStructural | — | `public static ForgeTypeId StairsRunStructural { get ; }` |
| Property | StairsRunTopElevation | — | `public static ForgeTypeId StairsRunTopElevation { get ; }` |
| Property | StairsRunWidthMeasurement | — | `public static ForgeTypeId StairsRunWidthMeasurement { get ; }` |
| Property | StairsRunWinderBeginWithStraight | — | `public static ForgeTypeId StairsRunWinderBeginWithStraight { get ; }` |
| Property | StairsRunWinderEndWithStraight | — | `public static ForgeTypeId StairsRunWinderEndWithStraight { get ; }` |
| Property | StairsRuntypeHasMonolithicSupport | — | `public static ForgeTypeId StairsRuntypeHasMonolithicSupport { get ; }` |
| Property | StairsRuntypeRunMaterial | — | `public static ForgeTypeId StairsRuntypeRunMaterial { get ; }` |
| Property | StairsRuntypeStructuralDepth | — | `public static ForgeTypeId StairsRuntypeStructuralDepth { get ; }` |
| Property | StairsRuntypeStructure | — | `public static ForgeTypeId StairsRuntypeStructure { get ; }` |
| Property | StairsRuntypeTotalDepth | — | `public static ForgeTypeId StairsRuntypeTotalDepth { get ; }` |
| Property | StairsRuntypeUndersideSurfaceType | — | `public static ForgeTypeId StairsRuntypeUndersideSurfaceType { get ; }` |
| Property | StairsShowDownText | — | `public static ForgeTypeId StairsShowDownText { get ; }` |
| Property | StairsShowUpText | — | `public static ForgeTypeId StairsShowUpText { get ; }` |
| Property | StairsStairsHeight | — | `public static ForgeTypeId StairsStairsHeight { get ; }` |
| Property | StairsStringersPresent | — | `public static ForgeTypeId StairsStringersPresent { get ; }` |
| Property | StairsSupportHorizontalOffset | — | `public static ForgeTypeId StairsSupportHorizontalOffset { get ; }` |
| Property | StairsSupportLandingsupportType | — | `public static ForgeTypeId StairsSupportLandingsupportType { get ; }` |
| Property | StairsSupportLowerEndCut | — | `public static ForgeTypeId StairsSupportLowerEndCut { get ; }` |
| Property | StairsSupportOverridden | — | `public static ForgeTypeId StairsSupportOverridden { get ; }` |
| Property | StairsSupportTrimSupportUpper | — | `public static ForgeTypeId StairsSupportTrimSupportUpper { get ; }` |
| Property | StairsSupportUpperEndCut | — | `public static ForgeTypeId StairsSupportUpperEndCut { get ; }` |
| Property | StairsSupportVerticalOffset | — | `public static ForgeTypeId StairsSupportVerticalOffset { get ; }` |
| Property | StairsSupporttypeFlipSectionProfile | — | `public static ForgeTypeId StairsSupporttypeFlipSectionProfile { get ; }` |
| Property | StairsSupporttypeMaterial | — | `public static ForgeTypeId StairsSupporttypeMaterial { get ; }` |
| Property | StairsSupporttypeSectionProfile | — | `public static ForgeTypeId StairsSupporttypeSectionProfile { get ; }` |
| Property | StairsSupporttypeStructuralDepth | — | `public static ForgeTypeId StairsSupporttypeStructuralDepth { get ; }` |
| Property | StairsSupporttypeStructuralDepthOnLanding | — | `public static ForgeTypeId StairsSupporttypeStructuralDepthOnLanding { get ; }` |
| Property | StairsSupporttypeStructuralDepthOnRun | — | `public static ForgeTypeId StairsSupporttypeStructuralDepthOnRun { get ; }` |
| Property | StairsSupporttypeTopsideSurface | — | `public static ForgeTypeId StairsSupporttypeTopsideSurface { get ; }` |
| Property | StairsSupporttypeTotalDepth | — | `public static ForgeTypeId StairsSupporttypeTotalDepth { get ; }` |
| Property | StairsSupporttypeUndersideSurface | — | `public static ForgeTypeId StairsSupporttypeUndersideSurface { get ; }` |
| Property | StairsSupporttypeWidth | — | `public static ForgeTypeId StairsSupporttypeWidth { get ; }` |
| Property | StairsTextOrientation | — | `public static ForgeTypeId StairsTextOrientation { get ; }` |
| Property | StairsTextType | — | `public static ForgeTypeId StairsTextType { get ; }` |
| Property | StairsTopLevel | — | `public static ForgeTypeId StairsTopLevel { get ; }` |
| Property | StairsTopLevelParam | — | `public static ForgeTypeId StairsTopLevelParam { get ; }` |
| Property | StairsTopOffset | — | `public static ForgeTypeId StairsTopOffset { get ; }` |
| Property | StairsTotalNumberOfRisers | — | `public static ForgeTypeId StairsTotalNumberOfRisers { get ; }` |
| Property | StairsTotalNumberOfTreads | — | `public static ForgeTypeId StairsTotalNumberOfTreads { get ; }` |
| Property | StairsTriserIsTypeOverridden | — | `public static ForgeTypeId StairsTriserIsTypeOverridden { get ; }` |
| Property | StairsTriserNumberBaseIndex | — | `public static ForgeTypeId StairsTriserNumberBaseIndex { get ; }` |
| Property | StairsTriserRiserMark | — | `public static ForgeTypeId StairsTriserRiserMark { get ; }` |
| Property | StairsTriserRiserNumber | — | `public static ForgeTypeId StairsTriserRiserNumber { get ; }` |
| Property | StairsTriserTreadMark | — | `public static ForgeTypeId StairsTriserTreadMark { get ; }` |
| Property | StairsTriserTreadNumber | — | `public static ForgeTypeId StairsTriserTreadNumber { get ; }` |
| Property | StairsTrisertypeBackNosing | — | `public static ForgeTypeId StairsTrisertypeBackNosing { get ; }` |
| Property | StairsTrisertypeFrontNosing | — | `public static ForgeTypeId StairsTrisertypeFrontNosing { get ; }` |
| Property | StairsTrisertypeLeftNosing | — | `public static ForgeTypeId StairsTrisertypeLeftNosing { get ; }` |
| Property | StairsTrisertypeNosingLength | — | `public static ForgeTypeId StairsTrisertypeNosingLength { get ; }` |
| Property | StairsTrisertypeNosingPlacement | — | `public static ForgeTypeId StairsTrisertypeNosingPlacement { get ; }` |
| Property | StairsTrisertypeNosingProfile | — | `public static ForgeTypeId StairsTrisertypeNosingProfile { get ; }` |
| Property | StairsTrisertypeRightNosing | — | `public static ForgeTypeId StairsTrisertypeRightNosing { get ; }` |
| Property | StairsTrisertypeRiser | — | `public static ForgeTypeId StairsTrisertypeRiser { get ; }` |
| Property | StairsTrisertypeRiserIsSlanted | — | `public static ForgeTypeId StairsTrisertypeRiserIsSlanted { get ; }` |
| Property | StairsTrisertypeRiserMaterial | — | `public static ForgeTypeId StairsTrisertypeRiserMaterial { get ; }` |
| Property | StairsTrisertypeRiserProfile | — | `public static ForgeTypeId StairsTrisertypeRiserProfile { get ; }` |
| Property | StairsTrisertypeRiserStyle | — | `public static ForgeTypeId StairsTrisertypeRiserStyle { get ; }` |
| Property | StairsTrisertypeRiserThickness | — | `public static ForgeTypeId StairsTrisertypeRiserThickness { get ; }` |
| Property | StairsTrisertypeRiserTreadConnection | — | `public static ForgeTypeId StairsTrisertypeRiserTreadConnection { get ; }` |
| Property | StairsTrisertypeTread | — | `public static ForgeTypeId StairsTrisertypeTread { get ; }` |
| Property | StairsTrisertypeTreadMaterial | — | `public static ForgeTypeId StairsTrisertypeTreadMaterial { get ; }` |
| Property | StairsTrisertypeTreadProfile | — | `public static ForgeTypeId StairsTrisertypeTreadProfile { get ; }` |
| Property | StairsTrisertypeTreadThickness | — | `public static ForgeTypeId StairsTrisertypeTreadThickness { get ; }` |
| Property | StairsUpText | — | `public static ForgeTypeId StairsUpText { get ; }` |
| Property | StairsWinderpatternFilletInsideCorner | — | `public static ForgeTypeId StairsWinderpatternFilletInsideCorner { get ; }` |
| Property | StairsWinderpatternMinimumWidthCorner | — | `public static ForgeTypeId StairsWinderpatternMinimumWidthCorner { get ; }` |
| Property | StairsWinderpatternMinimumWidthInsideWalkline | — | `public static ForgeTypeId StairsWinderpatternMinimumWidthInsideWalkline { get ; }` |
| Property | StairsWinderpatternNumberOfStraightStepsAtBegin | — | `public static ForgeTypeId StairsWinderpatternNumberOfStraightStepsAtBegin { get ; }` |
| Property | StairsWinderpatternNumberOfStraightStepsAtEnd | — | `public static ForgeTypeId StairsWinderpatternNumberOfStraightStepsAtEnd { get ; }` |
| Property | StairsWinderpatternRadiusInterior | — | `public static ForgeTypeId StairsWinderpatternRadiusInterior { get ; }` |
| Property | StairsWinderpatternStairPathOffset | — | `public static ForgeTypeId StairsWinderpatternStairPathOffset { get ; }` |
| Property | StairsWinderpatternWinderStyle | — | `public static ForgeTypeId StairsWinderpatternWinderStyle { get ; }` |
| Property | StairstypeCalcRuleMaxResult | — | `public static ForgeTypeId StairstypeCalcRuleMaxResult { get ; }` |
| Property | StairstypeCalcRuleMinResult | — | `public static ForgeTypeId StairstypeCalcRuleMinResult { get ; }` |
| Property | StairstypeCalcRuleRiserMultiplier | — | `public static ForgeTypeId StairstypeCalcRuleRiserMultiplier { get ; }` |
| Property | StairstypeCalcRuleTargetResult | — | `public static ForgeTypeId StairstypeCalcRuleTargetResult { get ; }` |
| Property | StairstypeCalcRuleTreadMultiplier | — | `public static ForgeTypeId StairstypeCalcRuleTreadMultiplier { get ; }` |
| Property | StairstypeCalculationRules | — | `public static ForgeTypeId StairstypeCalculationRules { get ; }` |
| Property | StairstypeConstructionMethod | — | `public static ForgeTypeId StairstypeConstructionMethod { get ; }` |
| Property | StairstypeCutmarkType | — | `public static ForgeTypeId StairstypeCutmarkType { get ; }` |
| Property | StairstypeGeomunjoinedEndCutStyle | — | `public static ForgeTypeId StairstypeGeomunjoinedEndCutStyle { get ; }` |
| Property | StairstypeHasIntermediateSupport | — | `public static ForgeTypeId StairstypeHasIntermediateSupport { get ; }` |
| Property | StairstypeHasLeftSupport | — | `public static ForgeTypeId StairstypeHasLeftSupport { get ; }` |
| Property | StairstypeHasRightSupport | — | `public static ForgeTypeId StairstypeHasRightSupport { get ; }` |
| Property | StairstypeIntermediateSupportType | — | `public static ForgeTypeId StairstypeIntermediateSupportType { get ; }` |
| Property | StairstypeIsAssembledStairs | — | `public static ForgeTypeId StairstypeIsAssembledStairs { get ; }` |
| Property | StairstypeLandingType | — | `public static ForgeTypeId StairstypeLandingType { get ; }` |
| Property | StairstypeLeftSideSupportType | — | `public static ForgeTypeId StairstypeLeftSideSupportType { get ; }` |
| Property | StairstypeLeftSupportLateralOffset | — | `public static ForgeTypeId StairstypeLeftSupportLateralOffset { get ; }` |
| Property | StairstypeMaximumRiserHeight | — | `public static ForgeTypeId StairstypeMaximumRiserHeight { get ; }` |
| Property | StairstypeMinimumRunWidth | — | `public static ForgeTypeId StairstypeMinimumRunWidth { get ; }` |
| Property | StairstypeMinimumTreadDepth | — | `public static ForgeTypeId StairstypeMinimumTreadDepth { get ; }` |
| Property | StairstypeMinimumTreadWidthInsideBoundary | — | `public static ForgeTypeId StairstypeMinimumTreadWidthInsideBoundary { get ; }` |
| Property | StairstypeNotchCustomWidth | — | `public static ForgeTypeId StairstypeNotchCustomWidth { get ; }` |
| Property | StairstypeNotchExtension | — | `public static ForgeTypeId StairstypeNotchExtension { get ; }` |
| Property | StairstypeNotchHorizontalGap | — | `public static ForgeTypeId StairstypeNotchHorizontalGap { get ; }` |
| Property | StairstypeNotchThickness | — | `public static ForgeTypeId StairstypeNotchThickness { get ; }` |
| Property | StairstypeNotchVerticalGap | — | `public static ForgeTypeId StairstypeNotchVerticalGap { get ; }` |
| Property | StairstypeNotchWidth | — | `public static ForgeTypeId StairstypeNotchWidth { get ; }` |
| Property | StairstypeNumberOfIntermediateSupports | — | `public static ForgeTypeId StairstypeNumberOfIntermediateSupports { get ; }` |
| Property | StairstypeRightSideSupportType | — | `public static ForgeTypeId StairstypeRightSideSupportType { get ; }` |
| Property | StairstypeRightSupportLateralOffset | — | `public static ForgeTypeId StairstypeRightSupportLateralOffset { get ; }` |
| Property | StairstypeRunType | — | `public static ForgeTypeId StairstypeRunType { get ; }` |
| Property | StairstypeShowCutline | — | `public static ForgeTypeId StairstypeShowCutline { get ; }` |
| Property | StairstypeShowStairPath | — | `public static ForgeTypeId StairstypeShowStairPath { get ; }` |
| Property | StairstypeShowUpdown | — | `public static ForgeTypeId StairstypeShowUpdown { get ; }` |
| Property | StairstypeWinderStepFrontMeasurement | — | `public static ForgeTypeId StairstypeWinderStepFrontMeasurement { get ; }` |
| Property | StartExtension | — | `public static ForgeTypeId StartExtension { get ; }` |
| Property | StartJoinCutback | — | `public static ForgeTypeId StartJoinCutback { get ; }` |
| Property | StartSymbolType | — | `public static ForgeTypeId StartSymbolType { get ; }` |
| Property | StartYJustification | — | `public static ForgeTypeId StartYJustification { get ; }` |
| Property | StartYOffsetValue | — | `public static ForgeTypeId StartYOffsetValue { get ; }` |
| Property | StartZJustification | — | `public static ForgeTypeId StartZJustification { get ; }` |
| Property | StartZOffsetValue | — | `public static ForgeTypeId StartZOffsetValue { get ; }` |
| Property | SteelElemAnchorAssembly | — | `public static ForgeTypeId SteelElemAnchorAssembly { get ; }` |
| Property | SteelElemAnchorDiameter | — | `public static ForgeTypeId SteelElemAnchorDiameter { get ; }` |
| Property | SteelElemAnchorGrade | — | `public static ForgeTypeId SteelElemAnchorGrade { get ; }` |
| Property | SteelElemAnchorLength | — | `public static ForgeTypeId SteelElemAnchorLength { get ; }` |
| Property | SteelElemAnchorOrientation | — | `public static ForgeTypeId SteelElemAnchorOrientation { get ; }` |
| Property | SteelElemAnchorStandard | — | `public static ForgeTypeId SteelElemAnchorStandard { get ; }` |
| Property | SteelElemAnchorTotalWeight | — | `public static ForgeTypeId SteelElemAnchorTotalWeight { get ; }` |
| Property | SteelElemBoltAssembly | — | `public static ForgeTypeId SteelElemBoltAssembly { get ; }` |
| Property | SteelElemBoltCoating | — | `public static ForgeTypeId SteelElemBoltCoating { get ; }` |
| Property | SteelElemBoltDiameter | — | `public static ForgeTypeId SteelElemBoltDiameter { get ; }` |
| Property | SteelElemBoltFinishCalculationAtGap | — | `public static ForgeTypeId SteelElemBoltFinishCalculationAtGap { get ; }` |
| Property | SteelElemBoltGrade | — | `public static ForgeTypeId SteelElemBoltGrade { get ; }` |
| Property | SteelElemBoltGripLength | — | `public static ForgeTypeId SteelElemBoltGripLength { get ; }` |
| Property | SteelElemBoltGripLengthIncrease | — | `public static ForgeTypeId SteelElemBoltGripLengthIncrease { get ; }` |
| Property | SteelElemBoltInverted | — | `public static ForgeTypeId SteelElemBoltInverted { get ; }` |
| Property | SteelElemBoltLength | — | `public static ForgeTypeId SteelElemBoltLength { get ; }` |
| Property | SteelElemBoltLocation | — | `public static ForgeTypeId SteelElemBoltLocation { get ; }` |
| Property | SteelElemBoltStandard | — | `public static ForgeTypeId SteelElemBoltStandard { get ; }` |
| Property | SteelElemBoltTotalWeight | — | `public static ForgeTypeId SteelElemBoltTotalWeight { get ; }` |
| Property | SteelElemCoating | — | `public static ForgeTypeId SteelElemCoating { get ; }` |
| Property | SteelElemContourGapWidth | — | `public static ForgeTypeId SteelElemContourGapWidth { get ; }` |
| Property | SteelElemContourSide1dist | — | `public static ForgeTypeId SteelElemContourSide1dist { get ; }` |
| Property | SteelElemContourSide2dist | — | `public static ForgeTypeId SteelElemContourSide2dist { get ; }` |
| Property | SteelElemCopeAroundAxis | — | `public static ForgeTypeId SteelElemCopeAroundAxis { get ; }` |
| Property | SteelElemCopeAxisAngle | — | `public static ForgeTypeId SteelElemCopeAxisAngle { get ; }` |
| Property | SteelElemCopeDistanceAxis | — | `public static ForgeTypeId SteelElemCopeDistanceAxis { get ; }` |
| Property | SteelElemCopeWidthx | — | `public static ForgeTypeId SteelElemCopeWidthx { get ; }` |
| Property | SteelElemCopeXAngle | — | `public static ForgeTypeId SteelElemCopeXAngle { get ; }` |
| Property | SteelElemCopeZAngle | — | `public static ForgeTypeId SteelElemCopeZAngle { get ; }` |
| Property | SteelElemCutLength | — | `public static ForgeTypeId SteelElemCutLength { get ; }` |
| Property | SteelElemCutType | — | `public static ForgeTypeId SteelElemCutType { get ; }` |
| Property | SteelElemExactWeight | — | `public static ForgeTypeId SteelElemExactWeight { get ; }` |
| Property | SteelElemHoleAlpha | — | `public static ForgeTypeId SteelElemHoleAlpha { get ; }` |
| Property | SteelElemHoleAngle | — | `public static ForgeTypeId SteelElemHoleAngle { get ; }` |
| Property | SteelElemHoleBackTaperThread | — | `public static ForgeTypeId SteelElemHoleBackTaperThread { get ; }` |
| Property | SteelElemHoleDefinition | — | `public static ForgeTypeId SteelElemHoleDefinition { get ; }` |
| Property | SteelElemHoleDepth | — | `public static ForgeTypeId SteelElemHoleDepth { get ; }` |
| Property | SteelElemHoleDepthOfBoltHead | — | `public static ForgeTypeId SteelElemHoleDepthOfBoltHead { get ; }` |
| Property | SteelElemHoleDiameter | — | `public static ForgeTypeId SteelElemHoleDiameter { get ; }` |
| Property | SteelElemHoleHeadDiameter | — | `public static ForgeTypeId SteelElemHoleHeadDiameter { get ; }` |
| Property | SteelElemHoleSlotDirection | — | `public static ForgeTypeId SteelElemHoleSlotDirection { get ; }` |
| Property | SteelElemHoleSlotLength | — | `public static ForgeTypeId SteelElemHoleSlotLength { get ; }` |
| Property | SteelElemHoleTapping | — | `public static ForgeTypeId SteelElemHoleTapping { get ; }` |
| Property | SteelElemHoleTappingHole | — | `public static ForgeTypeId SteelElemHoleTappingHole { get ; }` |
| Property | SteelElemHoleType | — | `public static ForgeTypeId SteelElemHoleType { get ; }` |
| Property | SteelElemPaintArea | — | `public static ForgeTypeId SteelElemPaintArea { get ; }` |
| Property | SteelElemParamBoringout | — | `public static ForgeTypeId SteelElemParamBoringout { get ; }` |
| Property | SteelElemParamRadius | — | `public static ForgeTypeId SteelElemParamRadius { get ; }` |
| Property | SteelElemPatternEdgeDistanceX | — | `public static ForgeTypeId SteelElemPatternEdgeDistanceX { get ; }` |
| Property | SteelElemPatternEdgeDistanceY | — | `public static ForgeTypeId SteelElemPatternEdgeDistanceY { get ; }` |
| Property | SteelElemPatternIntermediateDistanceX | — | `public static ForgeTypeId SteelElemPatternIntermediateDistanceX { get ; }` |
| Property | SteelElemPatternIntermediateDistanceY | — | `public static ForgeTypeId SteelElemPatternIntermediateDistanceY { get ; }` |
| Property | SteelElemPatternNumber | — | `public static ForgeTypeId SteelElemPatternNumber { get ; }` |
| Property | SteelElemPatternNumberX | — | `public static ForgeTypeId SteelElemPatternNumberX { get ; }` |
| Property | SteelElemPatternNumberY | — | `public static ForgeTypeId SteelElemPatternNumberY { get ; }` |
| Property | SteelElemPatternRadius | — | `public static ForgeTypeId SteelElemPatternRadius { get ; }` |
| Property | SteelElemPatternTotalLength | — | `public static ForgeTypeId SteelElemPatternTotalLength { get ; }` |
| Property | SteelElemPatternTotalWidth | — | `public static ForgeTypeId SteelElemPatternTotalWidth { get ; }` |
| Property | SteelElemPlateArea | — | `public static ForgeTypeId SteelElemPlateArea { get ; }` |
| Property | SteelElemPlateExactWeight | — | `public static ForgeTypeId SteelElemPlateExactWeight { get ; }` |
| Property | SteelElemPlateJustification | — | `public static ForgeTypeId SteelElemPlateJustification { get ; }` |
| Property | SteelElemPlateLength | — | `public static ForgeTypeId SteelElemPlateLength { get ; }` |
| Property | SteelElemPlatePaintArea | — | `public static ForgeTypeId SteelElemPlatePaintArea { get ; }` |
| Property | SteelElemPlateShortenAngle | — | `public static ForgeTypeId SteelElemPlateShortenAngle { get ; }` |
| Property | SteelElemPlateShortenCutstraight | — | `public static ForgeTypeId SteelElemPlateShortenCutstraight { get ; }` |
| Property | SteelElemPlateShortenSuction | — | `public static ForgeTypeId SteelElemPlateShortenSuction { get ; }` |
| Property | SteelElemPlateThickness | — | `public static ForgeTypeId SteelElemPlateThickness { get ; }` |
| Property | SteelElemPlateType | — | `public static ForgeTypeId SteelElemPlateType { get ; }` |
| Property | SteelElemPlateVolume | — | `public static ForgeTypeId SteelElemPlateVolume { get ; }` |
| Property | SteelElemPlateWeight | — | `public static ForgeTypeId SteelElemPlateWeight { get ; }` |
| Property | SteelElemPlateWidth | — | `public static ForgeTypeId SteelElemPlateWidth { get ; }` |
| Property | SteelElemProfileLength | — | `public static ForgeTypeId SteelElemProfileLength { get ; }` |
| Property | SteelElemProfileType | — | `public static ForgeTypeId SteelElemProfileType { get ; }` |
| Property | SteelElemProfileVolume | — | `public static ForgeTypeId SteelElemProfileVolume { get ; }` |
| Property | SteelElemShearstudDiameter | — | `public static ForgeTypeId SteelElemShearstudDiameter { get ; }` |
| Property | SteelElemShearstudGrade | — | `public static ForgeTypeId SteelElemShearstudGrade { get ; }` |
| Property | SteelElemShearstudLength | — | `public static ForgeTypeId SteelElemShearstudLength { get ; }` |
| Property | SteelElemShearstudStandard | — | `public static ForgeTypeId SteelElemShearstudStandard { get ; }` |
| Property | SteelElemShearstudTotalWeight | — | `public static ForgeTypeId SteelElemShearstudTotalWeight { get ; }` |
| Property | SteelElemShortenAngley | — | `public static ForgeTypeId SteelElemShortenAngley { get ; }` |
| Property | SteelElemShortenAnglez | — | `public static ForgeTypeId SteelElemShortenAnglez { get ; }` |
| Property | SteelElemShortenReflength | — | `public static ForgeTypeId SteelElemShortenReflength { get ; }` |
| Property | SteelElemWeight | — | `public static ForgeTypeId SteelElemWeight { get ; }` |
| Property | SteelElemWeldContinuous | — | `public static ForgeTypeId SteelElemWeldContinuous { get ; }` |
| Property | SteelElemWeldDoubleEffectivethroat | — | `public static ForgeTypeId SteelElemWeldDoubleEffectivethroat { get ; }` |
| Property | SteelElemWeldDoublePrepdepth | — | `public static ForgeTypeId SteelElemWeldDoublePrepdepth { get ; }` |
| Property | SteelElemWeldDoubleRootopening | — | `public static ForgeTypeId SteelElemWeldDoubleRootopening { get ; }` |
| Property | SteelElemWeldDoubleSurfaceshape | — | `public static ForgeTypeId SteelElemWeldDoubleSurfaceshape { get ; }` |
| Property | SteelElemWeldDoubleText | — | `public static ForgeTypeId SteelElemWeldDoubleText { get ; }` |
| Property | SteelElemWeldDoubleThickness | — | `public static ForgeTypeId SteelElemWeldDoubleThickness { get ; }` |
| Property | SteelElemWeldDoubleType | — | `public static ForgeTypeId SteelElemWeldDoubleType { get ; }` |
| Property | SteelElemWeldDoubleWeldprep | — | `public static ForgeTypeId SteelElemWeldDoubleWeldprep { get ; }` |
| Property | SteelElemWeldLength | — | `public static ForgeTypeId SteelElemWeldLength { get ; }` |
| Property | SteelElemWeldLocation | — | `public static ForgeTypeId SteelElemWeldLocation { get ; }` |
| Property | SteelElemWeldMainEffectivethroat | — | `public static ForgeTypeId SteelElemWeldMainEffectivethroat { get ; }` |
| Property | SteelElemWeldMainPrepdepth | — | `public static ForgeTypeId SteelElemWeldMainPrepdepth { get ; }` |
| Property | SteelElemWeldMainRootopening | — | `public static ForgeTypeId SteelElemWeldMainRootopening { get ; }` |
| Property | SteelElemWeldMainSurfaceshape | — | `public static ForgeTypeId SteelElemWeldMainSurfaceshape { get ; }` |
| Property | SteelElemWeldMainText | — | `public static ForgeTypeId SteelElemWeldMainText { get ; }` |
| Property | SteelElemWeldMainThickness | — | `public static ForgeTypeId SteelElemWeldMainThickness { get ; }` |
| Property | SteelElemWeldMainType | — | `public static ForgeTypeId SteelElemWeldMainType { get ; }` |
| Property | SteelElemWeldMainWeldprep | — | `public static ForgeTypeId SteelElemWeldMainWeldprep { get ; }` |
| Property | SteelElemWeldPitch | — | `public static ForgeTypeId SteelElemWeldPitch { get ; }` |
| Property | SteelElemWeldPrefix | — | `public static ForgeTypeId SteelElemWeldPrefix { get ; }` |
| Property | SteelElemWeldTextModule | — | `public static ForgeTypeId SteelElemWeldTextModule { get ; }` |
| Property | SteelElemXDistance | — | `public static ForgeTypeId SteelElemXDistance { get ; }` |
| Property | SteelElemYDistance | — | `public static ForgeTypeId SteelElemYDistance { get ; }` |
| Property | SteelElemZclipType | — | `public static ForgeTypeId SteelElemZclipType { get ; }` |
| Property | StiffenerClassification | — | `public static ForgeTypeId StiffenerClassification { get ; }` |
| Property | StructConnectionApplyTo | — | `public static ForgeTypeId StructConnectionApplyTo { get ; }` |
| Property | StructConnectionBeamEnd | — | `public static ForgeTypeId StructConnectionBeamEnd { get ; }` |
| Property | StructConnectionBeamStart | — | `public static ForgeTypeId StructConnectionBeamStart { get ; }` |
| Property | StructConnectionColumnBase | — | `public static ForgeTypeId StructConnectionColumnBase { get ; }` |
| Property | StructConnectionColumnTop | — | `public static ForgeTypeId StructConnectionColumnTop { get ; }` |
| Property | StructConnectionCutback | — | `public static ForgeTypeId StructConnectionCutback { get ; }` |
| Property | StructConnectionTypeName | — | `public static ForgeTypeId StructConnectionTypeName { get ; }` |
| Property | StructFramJoinStatus | — | `public static ForgeTypeId StructFramJoinStatus { get ; }` |
| Property | StructuralAnalyticalBeamHorizontalProjectionPlane | — | `public static ForgeTypeId StructuralAnalyticalBeamHorizontalProjectionPlane { get ; }` |
| Property | StructuralAnalyticalBeamRigidLink | — | `public static ForgeTypeId StructuralAnalyticalBeamRigidLink { get ; }` |
| Property | StructuralAnalyticalColumnHorizontalProjectionPlane | — | `public static ForgeTypeId StructuralAnalyticalColumnHorizontalProjectionPlane { get ; }` |
| Property | StructuralAnalyticalColumnRigidLink | — | `public static ForgeTypeId StructuralAnalyticalColumnRigidLink { get ; }` |
| Property | StructuralAnalyticalHardPoints | — | `public static ForgeTypeId StructuralAnalyticalHardPoints { get ; }` |
| Property | StructuralAnalyticalModel | — | `public static ForgeTypeId StructuralAnalyticalModel { get ; }` |
| Property | StructuralAnalyticalProjectFloorPlane | — | `public static ForgeTypeId StructuralAnalyticalProjectFloorPlane { get ; }` |
| Property | StructuralAnalyticalProjectMemberPlane | — | `public static ForgeTypeId StructuralAnalyticalProjectMemberPlane { get ; }` |
| Property | StructuralAnalyticalProjectMemberPlaneColumnBottom | — | `public static ForgeTypeId StructuralAnalyticalProjectMemberPlaneColumnBottom { get ; }` |
| Property | StructuralAnalyticalProjectMemberPlaneColumnTop | — | `public static ForgeTypeId StructuralAnalyticalProjectMemberPlaneColumnTop { get ; }` |
| Property | StructuralAnalyticalTessDeviation | — | `public static ForgeTypeId StructuralAnalyticalTessDeviation { get ; }` |
| Property | StructuralAnalyticalTessellate | — | `public static ForgeTypeId StructuralAnalyticalTessellate { get ; }` |
| Property | StructuralAnalyzesAs | — | `public static ForgeTypeId StructuralAnalyzesAs { get ; }` |
| Property | StructuralAssetParam | — | `public static ForgeTypeId StructuralAssetParam { get ; }` |
| Property | StructuralAttachmentBaseDistance | — | `public static ForgeTypeId StructuralAttachmentBaseDistance { get ; }` |
| Property | StructuralAttachmentBaseRatio | — | `public static ForgeTypeId StructuralAttachmentBaseRatio { get ; }` |
| Property | StructuralAttachmentBaseReferencedend | — | `public static ForgeTypeId StructuralAttachmentBaseReferencedend { get ; }` |
| Property | StructuralAttachmentBaseType | — | `public static ForgeTypeId StructuralAttachmentBaseType { get ; }` |
| Property | StructuralAttachmentEndLevelReference | — | `public static ForgeTypeId StructuralAttachmentEndLevelReference { get ; }` |
| Property | StructuralAttachmentEndRefelementEnd | — | `public static ForgeTypeId StructuralAttachmentEndRefelementEnd { get ; }` |
| Property | StructuralAttachmentEndType | — | `public static ForgeTypeId StructuralAttachmentEndType { get ; }` |
| Property | StructuralAttachmentEndValueDistance | — | `public static ForgeTypeId StructuralAttachmentEndValueDistance { get ; }` |
| Property | StructuralAttachmentEndValueElevation | — | `public static ForgeTypeId StructuralAttachmentEndValueElevation { get ; }` |
| Property | StructuralAttachmentEndValueRatio | — | `public static ForgeTypeId StructuralAttachmentEndValueRatio { get ; }` |
| Property | StructuralAttachmentStartLevelReference | — | `public static ForgeTypeId StructuralAttachmentStartLevelReference { get ; }` |
| Property | StructuralAttachmentStartRefelementEnd | — | `public static ForgeTypeId StructuralAttachmentStartRefelementEnd { get ; }` |
| Property | StructuralAttachmentStartType | — | `public static ForgeTypeId StructuralAttachmentStartType { get ; }` |
| Property | StructuralAttachmentStartValueDistance | — | `public static ForgeTypeId StructuralAttachmentStartValueDistance { get ; }` |
| Property | StructuralAttachmentStartValueElevation | — | `public static ForgeTypeId StructuralAttachmentStartValueElevation { get ; }` |
| Property | StructuralAttachmentStartValueRatio | — | `public static ForgeTypeId StructuralAttachmentStartValueRatio { get ; }` |
| Property | StructuralAttachmentTopDistance | — | `public static ForgeTypeId StructuralAttachmentTopDistance { get ; }` |
| Property | StructuralAttachmentTopRatio | — | `public static ForgeTypeId StructuralAttachmentTopRatio { get ; }` |
| Property | StructuralAttachmentTopReferencedend | — | `public static ForgeTypeId StructuralAttachmentTopReferencedend { get ; }` |
| Property | StructuralAttachmentTopType | — | `public static ForgeTypeId StructuralAttachmentTopType { get ; }` |
| Property | StructuralBeamCutbackForColumn | — | `public static ForgeTypeId StructuralBeamCutbackForColumn { get ; }` |
| Property | StructuralBeamEnd0Elevation | — | `public static ForgeTypeId StructuralBeamEnd0Elevation { get ; }` |
| Property | StructuralBeamEnd1Elevation | — | `public static ForgeTypeId StructuralBeamEnd1Elevation { get ; }` |
| Property | StructuralBeamEndAttachmentDistance | — | `public static ForgeTypeId StructuralBeamEndAttachmentDistance { get ; }` |
| Property | StructuralBeamEndAttachmentRefcolumnEnd | — | `public static ForgeTypeId StructuralBeamEndAttachmentRefcolumnEnd { get ; }` |
| Property | StructuralBeamEndAttachmentType | — | `public static ForgeTypeId StructuralBeamEndAttachmentType { get ; }` |
| Property | StructuralBeamEndSupport | — | `public static ForgeTypeId StructuralBeamEndSupport { get ; }` |
| Property | StructuralBeamOrientation | — | `public static ForgeTypeId StructuralBeamOrientation { get ; }` |
| Property | StructuralBeamStartAttachmentDistance | — | `public static ForgeTypeId StructuralBeamStartAttachmentDistance { get ; }` |
| Property | StructuralBeamStartAttachmentRefcolumnEnd | — | `public static ForgeTypeId StructuralBeamStartAttachmentRefcolumnEnd { get ; }` |
| Property | StructuralBeamStartAttachmentType | — | `public static ForgeTypeId StructuralBeamStartAttachmentType { get ; }` |
| Property | StructuralBeamStartSupport | — | `public static ForgeTypeId StructuralBeamStartSupport { get ; }` |
| Property | StructuralBendDirAngle | — | `public static ForgeTypeId StructuralBendDirAngle { get ; }` |
| Property | StructuralBottomReleaseFx | — | `public static ForgeTypeId StructuralBottomReleaseFx { get ; }` |
| Property | StructuralBottomReleaseFy | — | `public static ForgeTypeId StructuralBottomReleaseFy { get ; }` |
| Property | StructuralBottomReleaseFz | — | `public static ForgeTypeId StructuralBottomReleaseFz { get ; }` |
| Property | StructuralBottomReleaseMx | — | `public static ForgeTypeId StructuralBottomReleaseMx { get ; }` |
| Property | StructuralBottomReleaseMy | — | `public static ForgeTypeId StructuralBottomReleaseMy { get ; }` |
| Property | StructuralBottomReleaseMz | — | `public static ForgeTypeId StructuralBottomReleaseMz { get ; }` |
| Property | StructuralBottomReleaseType | — | `public static ForgeTypeId StructuralBottomReleaseType { get ; }` |
| Property | StructuralBraceRepresentation | — | `public static ForgeTypeId StructuralBraceRepresentation { get ; }` |
| Property | StructuralCamber | — | `public static ForgeTypeId StructuralCamber { get ; }` |
| Property | StructuralConnectionApprovalStatus | — | `public static ForgeTypeId StructuralConnectionApprovalStatus { get ; }` |
| Property | StructuralConnectionCodeCheckingStatus | — | `public static ForgeTypeId StructuralConnectionCodeCheckingStatus { get ; }` |
| Property | StructuralConnectionEditRangesOfApplicability | — | `public static ForgeTypeId StructuralConnectionEditRangesOfApplicability { get ; }` |
| Property | StructuralConnectionEditType | — | `public static ForgeTypeId StructuralConnectionEditType { get ; }` |
| Property | StructuralConnectionInputElements | — | `public static ForgeTypeId StructuralConnectionInputElements { get ; }` |
| Property | StructuralConnectionModifyConnectionParameters | — | `public static ForgeTypeId StructuralConnectionModifyConnectionParameters { get ; }` |
| Property | StructuralConnectionNobleStatus | — | `public static ForgeTypeId StructuralConnectionNobleStatus { get ; }` |
| Property | StructuralConnectionOverrideType | — | `public static ForgeTypeId StructuralConnectionOverrideType { get ; }` |
| Property | StructuralConnectionSymbol | — | `public static ForgeTypeId StructuralConnectionSymbol { get ; }` |
| Property | StructuralCopingDistance | — | `public static ForgeTypeId StructuralCopingDistance { get ; }` |
| Property | StructuralDisplayInHiddenViews | — | `public static ForgeTypeId StructuralDisplayInHiddenViews { get ; }` |
| Property | StructuralDisplayInHiddenViewsColumn | — | `public static ForgeTypeId StructuralDisplayInHiddenViewsColumn { get ; }` |
| Property | StructuralDisplayInHiddenViewsFraming | — | `public static ForgeTypeId StructuralDisplayInHiddenViewsFraming { get ; }` |
| Property | StructuralElevationAtBottom | — | `public static ForgeTypeId StructuralElevationAtBottom { get ; }` |
| Property | StructuralElevationAtBottomCore | — | `public static ForgeTypeId StructuralElevationAtBottomCore { get ; }` |
| Property | StructuralElevationAtBottomSurvey | — | `public static ForgeTypeId StructuralElevationAtBottomSurvey { get ; }` |
| Property | StructuralElevationAtTop | — | `public static ForgeTypeId StructuralElevationAtTop { get ; }` |
| Property | StructuralElevationAtTopCore | — | `public static ForgeTypeId StructuralElevationAtTopCore { get ; }` |
| Property | StructuralElevationAtTopSurvey | — | `public static ForgeTypeId StructuralElevationAtTopSurvey { get ; }` |
| Property | StructuralEndReleaseFx | — | `public static ForgeTypeId StructuralEndReleaseFx { get ; }` |
| Property | StructuralEndReleaseFy | — | `public static ForgeTypeId StructuralEndReleaseFy { get ; }` |
| Property | StructuralEndReleaseFz | — | `public static ForgeTypeId StructuralEndReleaseFz { get ; }` |
| Property | StructuralEndReleaseMx | — | `public static ForgeTypeId StructuralEndReleaseMx { get ; }` |
| Property | StructuralEndReleaseMy | — | `public static ForgeTypeId StructuralEndReleaseMy { get ; }` |
| Property | StructuralEndReleaseMz | — | `public static ForgeTypeId StructuralEndReleaseMz { get ; }` |
| Property | StructuralEndReleaseType | — | `public static ForgeTypeId StructuralEndReleaseType { get ; }` |
| Property | StructuralFamilyCodeName | — | `public static ForgeTypeId StructuralFamilyCodeName { get ; }` |
| Property | StructuralFamilyNameKey | — | `public static ForgeTypeId StructuralFamilyNameKey { get ; }` |
| Property | StructuralFloorAnalyzesAs | — | `public static ForgeTypeId StructuralFloorAnalyzesAs { get ; }` |
| Property | StructuralFloorCoreThickness | — | `public static ForgeTypeId StructuralFloorCoreThickness { get ; }` |
| Property | StructuralFoundationLength | — | `public static ForgeTypeId StructuralFoundationLength { get ; }` |
| Property | StructuralFoundationThickness | — | `public static ForgeTypeId StructuralFoundationThickness { get ; }` |
| Property | StructuralFoundationWidth | — | `public static ForgeTypeId StructuralFoundationWidth { get ; }` |
| Property | StructuralFrameCutLength | — | `public static ForgeTypeId StructuralFrameCutLength { get ; }` |
| Property | StructuralMaterialParam | — | `public static ForgeTypeId StructuralMaterialParam { get ; }` |
| Property | StructuralMaterialType | — | `public static ForgeTypeId StructuralMaterialType { get ; }` |
| Property | StructuralMemberForces | — | `public static ForgeTypeId StructuralMemberForces { get ; }` |
| Property | StructuralNumberOfStuds | — | `public static ForgeTypeId StructuralNumberOfStuds { get ; }` |
| Property | StructuralReferenceLevelElevation | — | `public static ForgeTypeId StructuralReferenceLevelElevation { get ; }` |
| Property | StructuralSectionArea | — | `public static ForgeTypeId StructuralSectionArea { get ; }` |
| Property | StructuralSectionBottomCutHeight | — | `public static ForgeTypeId StructuralSectionBottomCutHeight { get ; }` |
| Property | StructuralSectionBottomCutWidth | — | `public static ForgeTypeId StructuralSectionBottomCutWidth { get ; }` |
| Property | StructuralSectionCantileverHeight | — | `public static ForgeTypeId StructuralSectionCantileverHeight { get ; }` |
| Property | StructuralSectionCantileverLength | — | `public static ForgeTypeId StructuralSectionCantileverLength { get ; }` |
| Property | StructuralSectionCommonAlpha | — | `public static ForgeTypeId StructuralSectionCommonAlpha { get ; }` |
| Property | StructuralSectionCommonCentroidHoriz | — | `public static ForgeTypeId StructuralSectionCommonCentroidHoriz { get ; }` |
| Property | StructuralSectionCommonCentroidVertical | — | `public static ForgeTypeId StructuralSectionCommonCentroidVertical { get ; }` |
| Property | StructuralSectionCommonDiameter | — | `public static ForgeTypeId StructuralSectionCommonDiameter { get ; }` |
| Property | StructuralSectionCommonElasticModulusStrongAxis | — | `public static ForgeTypeId StructuralSectionCommonElasticModulusStrongAxis { get ; }` |
| Property | StructuralSectionCommonElasticModulusWeakAxis | — | `public static ForgeTypeId StructuralSectionCommonElasticModulusWeakAxis { get ; }` |
| Property | StructuralSectionCommonHeight | — | `public static ForgeTypeId StructuralSectionCommonHeight { get ; }` |
| Property | StructuralSectionCommonMomentOfInertiaStrongAxis | — | `public static ForgeTypeId StructuralSectionCommonMomentOfInertiaStrongAxis { get ; }` |
| Property | StructuralSectionCommonMomentOfInertiaWeakAxis | — | `public static ForgeTypeId StructuralSectionCommonMomentOfInertiaWeakAxis { get ; }` |
| Property | StructuralSectionCommonNominalWeight | — | `public static ForgeTypeId StructuralSectionCommonNominalWeight { get ; }` |
| Property | StructuralSectionCommonPerimeter | — | `public static ForgeTypeId StructuralSectionCommonPerimeter { get ; }` |
| Property | StructuralSectionCommonPlasticModulusStrongAxis | — | `public static ForgeTypeId StructuralSectionCommonPlasticModulusStrongAxis { get ; }` |
| Property | StructuralSectionCommonPlasticModulusWeakAxis | — | `public static ForgeTypeId StructuralSectionCommonPlasticModulusWeakAxis { get ; }` |
| Property | StructuralSectionCommonShearAreaStrongAxis | — | `public static ForgeTypeId StructuralSectionCommonShearAreaStrongAxis { get ; }` |
| Property | StructuralSectionCommonShearAreaWeakAxis | — | `public static ForgeTypeId StructuralSectionCommonShearAreaWeakAxis { get ; }` |
| Property | StructuralSectionCommonTorsionalModulus | — | `public static ForgeTypeId StructuralSectionCommonTorsionalModulus { get ; }` |
| Property | StructuralSectionCommonTorsionalMomentOfInertia | — | `public static ForgeTypeId StructuralSectionCommonTorsionalMomentOfInertia { get ; }` |
| Property | StructuralSectionCommonWarpingConstant | — | `public static ForgeTypeId StructuralSectionCommonWarpingConstant { get ; }` |
| Property | StructuralSectionCommonWidth | — | `public static ForgeTypeId StructuralSectionCommonWidth { get ; }` |
| Property | StructuralSectionCprofileFoldLength | — | `public static ForgeTypeId StructuralSectionCprofileFoldLength { get ; }` |
| Property | StructuralSectionHssInnerfillet | — | `public static ForgeTypeId StructuralSectionHssInnerfillet { get ; }` |
| Property | StructuralSectionHssOuterfillet | — | `public static ForgeTypeId StructuralSectionHssOuterfillet { get ; }` |
| Property | StructuralSectionIshapeBoltDiameter | — | `public static ForgeTypeId StructuralSectionIshapeBoltDiameter { get ; }` |
| Property | StructuralSectionIshapeBoltSpacing | — | `public static ForgeTypeId StructuralSectionIshapeBoltSpacing { get ; }` |
| Property | StructuralSectionIshapeBoltSpacingBetweenRows | — | `public static ForgeTypeId StructuralSectionIshapeBoltSpacingBetweenRows { get ; }` |
| Property | StructuralSectionIshapeBoltSpacingTwoRows | — | `public static ForgeTypeId StructuralSectionIshapeBoltSpacingTwoRows { get ; }` |
| Property | StructuralSectionIshapeBoltSpacingWeb | — | `public static ForgeTypeId StructuralSectionIshapeBoltSpacingWeb { get ; }` |
| Property | StructuralSectionIshapeClearWebHeight | — | `public static ForgeTypeId StructuralSectionIshapeClearWebHeight { get ; }` |
| Property | StructuralSectionIshapeFlangeToeOfFillet | — | `public static ForgeTypeId StructuralSectionIshapeFlangeToeOfFillet { get ; }` |
| Property | StructuralSectionIshapeFlangefillet | — | `public static ForgeTypeId StructuralSectionIshapeFlangefillet { get ; }` |
| Property | StructuralSectionIshapeFlangethickness | — | `public static ForgeTypeId StructuralSectionIshapeFlangethickness { get ; }` |
| Property | StructuralSectionIshapeFlangethicknessLocation | — | `public static ForgeTypeId StructuralSectionIshapeFlangethicknessLocation { get ; }` |
| Property | StructuralSectionIshapeWebToeOfFillet | — | `public static ForgeTypeId StructuralSectionIshapeWebToeOfFillet { get ; }` |
| Property | StructuralSectionIshapeWebfillet | — | `public static ForgeTypeId StructuralSectionIshapeWebfillet { get ; }` |
| Property | StructuralSectionIshapeWebheight | — | `public static ForgeTypeId StructuralSectionIshapeWebheight { get ; }` |
| Property | StructuralSectionIshapeWebthickness | — | `public static ForgeTypeId StructuralSectionIshapeWebthickness { get ; }` |
| Property | StructuralSectionIshapeWebthicknessLocation | — | `public static ForgeTypeId StructuralSectionIshapeWebthicknessLocation { get ; }` |
| Property | StructuralSectionIweldedBottomflangethickness | — | `public static ForgeTypeId StructuralSectionIweldedBottomflangethickness { get ; }` |
| Property | StructuralSectionIweldedBottomflangewidth | — | `public static ForgeTypeId StructuralSectionIweldedBottomflangewidth { get ; }` |
| Property | StructuralSectionIweldedTopflangethickness | — | `public static ForgeTypeId StructuralSectionIweldedTopflangethickness { get ; }` |
| Property | StructuralSectionIweldedTopflangewidth | — | `public static ForgeTypeId StructuralSectionIweldedTopflangewidth { get ; }` |
| Property | StructuralSectionLangleBoltDiameterLongerFlange | — | `public static ForgeTypeId StructuralSectionLangleBoltDiameterLongerFlange { get ; }` |
| Property | StructuralSectionLangleBoltDiameterShorterFlange | — | `public static ForgeTypeId StructuralSectionLangleBoltDiameterShorterFlange { get ; }` |
| Property | StructuralSectionLangleBoltSpacing1LongerFlange | — | `public static ForgeTypeId StructuralSectionLangleBoltSpacing1LongerFlange { get ; }` |
| Property | StructuralSectionLangleBoltSpacing2LongerFlange | — | `public static ForgeTypeId StructuralSectionLangleBoltSpacing2LongerFlange { get ; }` |
| Property | StructuralSectionLangleBoltSpacingShorterFlange | — | `public static ForgeTypeId StructuralSectionLangleBoltSpacingShorterFlange { get ; }` |
| Property | StructuralSectionLprofileLipLength | — | `public static ForgeTypeId StructuralSectionLprofileLipLength { get ; }` |
| Property | StructuralSectionNameKey | — | `public static ForgeTypeId StructuralSectionNameKey { get ; }` |
| Property | StructuralSectionPipestandardWalldesignthickness | — | `public static ForgeTypeId StructuralSectionPipestandardWalldesignthickness { get ; }` |
| Property | StructuralSectionPipestandardWallnominalthickness | — | `public static ForgeTypeId StructuralSectionPipestandardWallnominalthickness { get ; }` |
| Property | StructuralSectionShape | — | `public static ForgeTypeId StructuralSectionShape { get ; }` |
| Property | StructuralSectionSigmaProfileBendWidth | — | `public static ForgeTypeId StructuralSectionSigmaProfileBendWidth { get ; }` |
| Property | StructuralSectionSigmaProfileMiddleBendWidth | — | `public static ForgeTypeId StructuralSectionSigmaProfileMiddleBendWidth { get ; }` |
| Property | StructuralSectionSigmaProfileTopBendWidth | — | `public static ForgeTypeId StructuralSectionSigmaProfileTopBendWidth { get ; }` |
| Property | StructuralSectionSlopedFlangeAngle | — | `public static ForgeTypeId StructuralSectionSlopedFlangeAngle { get ; }` |
| Property | StructuralSectionSlopedWebAngle | — | `public static ForgeTypeId StructuralSectionSlopedWebAngle { get ; }` |
| Property | StructuralSectionTopCutHeight | — | `public static ForgeTypeId StructuralSectionTopCutHeight { get ; }` |
| Property | StructuralSectionTopCutWidth | — | `public static ForgeTypeId StructuralSectionTopCutWidth { get ; }` |
| Property | StructuralSectionTopWebFillet | — | `public static ForgeTypeId StructuralSectionTopWebFillet { get ; }` |
| Property | StructuralSectionZprofileBottomFlangeLength | — | `public static ForgeTypeId StructuralSectionZprofileBottomFlangeLength { get ; }` |
| Property | StructuralStartReleaseFx | — | `public static ForgeTypeId StructuralStartReleaseFx { get ; }` |
| Property | StructuralStartReleaseFy | — | `public static ForgeTypeId StructuralStartReleaseFy { get ; }` |
| Property | StructuralStartReleaseFz | — | `public static ForgeTypeId StructuralStartReleaseFz { get ; }` |
| Property | StructuralStartReleaseMx | — | `public static ForgeTypeId StructuralStartReleaseMx { get ; }` |
| Property | StructuralStartReleaseMy | — | `public static ForgeTypeId StructuralStartReleaseMy { get ; }` |
| Property | StructuralStartReleaseMz | — | `public static ForgeTypeId StructuralStartReleaseMz { get ; }` |
| Property | StructuralStartReleaseType | — | `public static ForgeTypeId StructuralStartReleaseType { get ; }` |
| Property | StructuralStickSymbolLocation | — | `public static ForgeTypeId StructuralStickSymbolLocation { get ; }` |
| Property | StructuralTopReleaseFx | — | `public static ForgeTypeId StructuralTopReleaseFx { get ; }` |
| Property | StructuralTopReleaseFy | — | `public static ForgeTypeId StructuralTopReleaseFy { get ; }` |
| Property | StructuralTopReleaseFz | — | `public static ForgeTypeId StructuralTopReleaseFz { get ; }` |
| Property | StructuralTopReleaseMx | — | `public static ForgeTypeId StructuralTopReleaseMx { get ; }` |
| Property | StructuralTopReleaseMy | — | `public static ForgeTypeId StructuralTopReleaseMy { get ; }` |
| Property | StructuralTopReleaseMz | — | `public static ForgeTypeId StructuralTopReleaseMz { get ; }` |
| Property | StructuralTopReleaseType | — | `public static ForgeTypeId StructuralTopReleaseType { get ; }` |
| Property | StructuralWallBottomProjectionPlane | — | `public static ForgeTypeId StructuralWallBottomProjectionPlane { get ; }` |
| Property | StructuralWallProjectionSurface | — | `public static ForgeTypeId StructuralWallProjectionSurface { get ; }` |
| Property | StructuralWallTopProjectionPlane | — | `public static ForgeTypeId StructuralWallTopProjectionPlane { get ; }` |
| Property | SupportHandClearance | — | `public static ForgeTypeId SupportHandClearance { get ; }` |
| Property | SupportHeight | — | `public static ForgeTypeId SupportHeight { get ; }` |
| Property | SurfaceArea | — | `public static ForgeTypeId SurfaceArea { get ; }` |
| Property | SurfaceName | — | `public static ForgeTypeId SurfaceName { get ; }` |
| Property | SurfacePatternIdParam | — | `public static ForgeTypeId SurfacePatternIdParam { get ; }` |
| Property | SurfacePerimeter | — | `public static ForgeTypeId SurfacePerimeter { get ; }` |
| Property | SweepBaseFloorSubcategoryId | — | `public static ForgeTypeId SweepBaseFloorSubcategoryId { get ; }` |
| Property | SweepBaseOffset | — | `public static ForgeTypeId SweepBaseOffset { get ; }` |
| Property | SweepBaseRoofSubcategoryId | — | `public static ForgeTypeId SweepBaseRoofSubcategoryId { get ; }` |
| Property | SweepBaseVertOffset | — | `public static ForgeTypeId SweepBaseVertOffset { get ; }` |
| Property | SweepMaxSegAngle | — | `public static ForgeTypeId SweepMaxSegAngle { get ; }` |
| Property | SweepTrajSegmented | — | `public static ForgeTypeId SweepTrajSegmented { get ; }` |
| Property | SymbolFamilyAndTypeNamesParam | — | `public static ForgeTypeId SymbolFamilyAndTypeNamesParam { get ; }` |
| Property | SymbolFamilyNameParam | — | `public static ForgeTypeId SymbolFamilyNameParam { get ; }` |
| Property | SymbolIdParam | — | `public static ForgeTypeId SymbolIdParam { get ; }` |
| Property | SymbolNameParam | — | `public static ForgeTypeId SymbolNameParam { get ; }` |
| Property | SystemEquipmentSets | — | `public static ForgeTypeId SystemEquipmentSets { get ; }` |
| Property | SystemZoneLevelId | — | `public static ForgeTypeId SystemZoneLevelId { get ; }` |
| Property | SystemsAnalysisReportFolder | — | `public static ForgeTypeId SystemsAnalysisReportFolder { get ; }` |
| Property | SystemsAnalysisReportStyle | — | `public static ForgeTypeId SystemsAnalysisReportStyle { get ; }` |
| Property | TagAngleParam | — | `public static ForgeTypeId TagAngleParam { get ; }` |
| Property | TagElementCount | — | `public static ForgeTypeId TagElementCount { get ; }` |
| Property | TagElevationBase | — | `public static ForgeTypeId TagElevationBase { get ; }` |
| Property | TagLeaderType | — | `public static ForgeTypeId TagLeaderType { get ; }` |
| Property | TagNoBreakParamStrings | — | `public static ForgeTypeId TagNoBreakParamStrings { get ; }` |
| Property | TagOnPlacementUi | — | `public static ForgeTypeId TagOnPlacementUi { get ; }` |
| Property | TagOrientationParam | — | `public static ForgeTypeId TagOrientationParam { get ; }` |
| Property | TagSampleText | — | `public static ForgeTypeId TagSampleText { get ; }` |
| Property | TagTag | — | `public static ForgeTypeId TagTag { get ; }` |
| Property | TemplateName | — | `public static ForgeTypeId TemplateName { get ; }` |
| Property | TerminationExtensionLength | — | `public static ForgeTypeId TerminationExtensionLength { get ; }` |
| Property | TextAlignHorz | — | `public static ForgeTypeId TextAlignHorz { get ; }` |
| Property | TextAlignVert | — | `public static ForgeTypeId TextAlignVert { get ; }` |
| Property | TextAlignment | — | `public static ForgeTypeId TextAlignment { get ; }` |
| Property | TextBackground | — | `public static ForgeTypeId TextBackground { get ; }` |
| Property | TextBoxVisibility | — | `public static ForgeTypeId TextBoxVisibility { get ; }` |
| Property | TextColor | — | `public static ForgeTypeId TextColor { get ; }` |
| Property | TextDistToLine | — | `public static ForgeTypeId TextDistToLine { get ; }` |
| Property | TextFont | — | `public static ForgeTypeId TextFont { get ; }` |
| Property | TextPosition | — | `public static ForgeTypeId TextPosition { get ; }` |
| Property | TextSize | — | `public static ForgeTypeId TextSize { get ; }` |
| Property | TextStyleBold | — | `public static ForgeTypeId TextStyleBold { get ; }` |
| Property | TextStyleFont | — | `public static ForgeTypeId TextStyleFont { get ; }` |
| Property | TextStyleItalic | — | `public static ForgeTypeId TextStyleItalic { get ; }` |
| Property | TextStyleSize | — | `public static ForgeTypeId TextStyleSize { get ; }` |
| Property | TextStyleUnderline | — | `public static ForgeTypeId TextStyleUnderline { get ; }` |
| Property | TextTabSize | — | `public static ForgeTypeId TextTabSize { get ; }` |
| Property | TextText | — | `public static ForgeTypeId TextText { get ; }` |
| Property | TextWidthScale | — | `public static ForgeTypeId TextWidthScale { get ; }` |
| Property | ThermalMaterialParamCompressibility | — | `public static ForgeTypeId ThermalMaterialParamCompressibility { get ; }` |
| Property | ThermalMaterialParamElectricalResistivity | — | `public static ForgeTypeId ThermalMaterialParamElectricalResistivity { get ; }` |
| Property | ThermalMaterialParamEmissivity | — | `public static ForgeTypeId ThermalMaterialParamEmissivity { get ; }` |
| Property | ThermalMaterialParamGasViscosity | — | `public static ForgeTypeId ThermalMaterialParamGasViscosity { get ; }` |
| Property | ThermalMaterialParamLiquidViscosity | — | `public static ForgeTypeId ThermalMaterialParamLiquidViscosity { get ; }` |
| Property | ThermalMaterialParamPermeability | — | `public static ForgeTypeId ThermalMaterialParamPermeability { get ; }` |
| Property | ThermalMaterialParamPorosity | — | `public static ForgeTypeId ThermalMaterialParamPorosity { get ; }` |
| Property | ThermalMaterialParamReflectivity | — | `public static ForgeTypeId ThermalMaterialParamReflectivity { get ; }` |
| Property | ThermalMaterialParamSpecificHeatOfVaporization | — | `public static ForgeTypeId ThermalMaterialParamSpecificHeatOfVaporization { get ; }` |
| Property | ThermalMaterialParamTransmitsLight | — | `public static ForgeTypeId ThermalMaterialParamTransmitsLight { get ; }` |
| Property | ThermalMaterialParamVaporPressure | — | `public static ForgeTypeId ThermalMaterialParamVaporPressure { get ; }` |
| Property | TickMarkPen | — | `public static ForgeTypeId TickMarkPen { get ; }` |
| Property | TilePatternFamrefComponentExtents | — | `public static ForgeTypeId TilePatternFamrefComponentExtents { get ; }` |
| Property | TilePatternGridCellsX | — | `public static ForgeTypeId TilePatternGridCellsX { get ; }` |
| Property | TilePatternGridCellsY | — | `public static ForgeTypeId TilePatternGridCellsY { get ; }` |
| Property | TilePatternGridUnitX | — | `public static ForgeTypeId TilePatternGridUnitX { get ; }` |
| Property | TilePatternGridUnitY | — | `public static ForgeTypeId TilePatternGridUnitY { get ; }` |
| Property | Tilt | — | `public static ForgeTypeId Tilt { get ; }` |
| Property | TitleFont | — | `public static ForgeTypeId TitleFont { get ; }` |
| Property | TitleSize | — | `public static ForgeTypeId TitleSize { get ; }` |
| Property | TitleStyleBold | — | `public static ForgeTypeId TitleStyleBold { get ; }` |
| Property | TitleStyleItalic | — | `public static ForgeTypeId TitleStyleItalic { get ; }` |
| Property | TitleStyleUnderline | — | `public static ForgeTypeId TitleStyleUnderline { get ; }` |
| Property | TopographyLinkName | — | `public static ForgeTypeId TopographyLinkName { get ; }` |
| Property | TopographyLinkPath | — | `public static ForgeTypeId TopographyLinkPath { get ; }` |
| Property | ToposolidAttrThicknessParam | — | `public static ForgeTypeId ToposolidAttrThicknessParam { get ; }` |
| Property | ToposolidContourDisplaySettingsIdParam | — | `public static ForgeTypeId ToposolidContourDisplaySettingsIdParam { get ; }` |
| Property | ToposolidContourSubcategoryId | — | `public static ForgeTypeId ToposolidContourSubcategoryId { get ; }` |
| Property | ToposolidElevationAtBottom | — | `public static ForgeTypeId ToposolidElevationAtBottom { get ; }` |
| Property | ToposolidElevationAtTop | — | `public static ForgeTypeId ToposolidElevationAtTop { get ; }` |
| Property | ToposolidFunctionParam | — | `public static ForgeTypeId ToposolidFunctionParam { get ; }` |
| Property | ToposolidHeightabovelevelParam | — | `public static ForgeTypeId ToposolidHeightabovelevelParam { get ; }` |
| Property | ToposolidInheritContours | — | `public static ForgeTypeId ToposolidInheritContours { get ; }` |
| Property | ToposolidStructureIdParam | — | `public static ForgeTypeId ToposolidStructureIdParam { get ; }` |
| Property | ToposolidSubdivideHeignt | — | `public static ForgeTypeId ToposolidSubdivideHeignt { get ; }` |
| Property | ToposolidSubdivideMaterial | — | `public static ForgeTypeId ToposolidSubdivideMaterial { get ; }` |
| Property | ToposolidTypeDefaultThicknessParam | — | `public static ForgeTypeId ToposolidTypeDefaultThicknessParam { get ; }` |
| Property | ToposurfaceContourSubcategoryId | — | `public static ForgeTypeId ToposurfaceContourSubcategoryId { get ; }` |
| Property | TrapMullWidth | — | `public static ForgeTypeId TrapMullWidth { get ; }` |
| Property | TrussBearingChordTopBottomParam | — | `public static ForgeTypeId TrussBearingChordTopBottomParam { get ; }` |
| Property | TrussElementAngleParam | — | `public static ForgeTypeId TrussElementAngleParam { get ; }` |
| Property | TrussElementBearingJustParam | — | `public static ForgeTypeId TrussElementBearingJustParam { get ; }` |
| Property | TrussElementClassParam | — | `public static ForgeTypeId TrussElementClassParam { get ; }` |
| Property | TrussElementCreateBottomParam | — | `public static ForgeTypeId TrussElementCreateBottomParam { get ; }` |
| Property | TrussElementCreateTopParam | — | `public static ForgeTypeId TrussElementCreateTopParam { get ; }` |
| Property | TrussElementEnd0Elevation | — | `public static ForgeTypeId TrussElementEnd0Elevation { get ; }` |
| Property | TrussElementEnd1Elevation | — | `public static ForgeTypeId TrussElementEnd1Elevation { get ; }` |
| Property | TrussElementReferenceLevelParam | — | `public static ForgeTypeId TrussElementReferenceLevelParam { get ; }` |
| Property | TrussElementRotateChordsWithTruss | — | `public static ForgeTypeId TrussElementRotateChordsWithTruss { get ; }` |
| Property | TrussElementSpanParam | — | `public static ForgeTypeId TrussElementSpanParam { get ; }` |
| Property | TrussElementStickJustParam | — | `public static ForgeTypeId TrussElementStickJustParam { get ; }` |
| Property | TrussElementTagNewMembersView | — | `public static ForgeTypeId TrussElementTagNewMembersView { get ; }` |
| Property | TrussFamilyBottomChordAngleParam | — | `public static ForgeTypeId TrussFamilyBottomChordAngleParam { get ; }` |
| Property | TrussFamilyBottomChordEndReleaseType | — | `public static ForgeTypeId TrussFamilyBottomChordEndReleaseType { get ; }` |
| Property | TrussFamilyBottomChordStartReleaseType | — | `public static ForgeTypeId TrussFamilyBottomChordStartReleaseType { get ; }` |
| Property | TrussFamilyBottomChordStructuralTypesParam | — | `public static ForgeTypeId TrussFamilyBottomChordStructuralTypesParam { get ; }` |
| Property | TrussFamilyBottomChordVerticalProjectionParam | — | `public static ForgeTypeId TrussFamilyBottomChordVerticalProjectionParam { get ; }` |
| Property | TrussFamilyDiagWebAngleParam | — | `public static ForgeTypeId TrussFamilyDiagWebAngleParam { get ; }` |
| Property | TrussFamilyDiagWebEndReleaseType | — | `public static ForgeTypeId TrussFamilyDiagWebEndReleaseType { get ; }` |
| Property | TrussFamilyDiagWebStartReleaseType | — | `public static ForgeTypeId TrussFamilyDiagWebStartReleaseType { get ; }` |
| Property | TrussFamilyDiagWebStructuralTypesParam | — | `public static ForgeTypeId TrussFamilyDiagWebStructuralTypesParam { get ; }` |
| Property | TrussFamilyTopChordAngleParam | — | `public static ForgeTypeId TrussFamilyTopChordAngleParam { get ; }` |
| Property | TrussFamilyTopChordEndReleaseType | — | `public static ForgeTypeId TrussFamilyTopChordEndReleaseType { get ; }` |
| Property | TrussFamilyTopChordStartReleaseType | — | `public static ForgeTypeId TrussFamilyTopChordStartReleaseType { get ; }` |
| Property | TrussFamilyTopChordStructuralTypesParam | — | `public static ForgeTypeId TrussFamilyTopChordStructuralTypesParam { get ; }` |
| Property | TrussFamilyTopChordVerticalProjectionParam | — | `public static ForgeTypeId TrussFamilyTopChordVerticalProjectionParam { get ; }` |
| Property | TrussFamilyTransformationParam | — | `public static ForgeTypeId TrussFamilyTransformationParam { get ; }` |
| Property | TrussFamilyVertWebAngleParam | — | `public static ForgeTypeId TrussFamilyVertWebAngleParam { get ; }` |
| Property | TrussFamilyVertWebEndReleaseType | — | `public static ForgeTypeId TrussFamilyVertWebEndReleaseType { get ; }` |
| Property | TrussFamilyVertWebStartReleaseType | — | `public static ForgeTypeId TrussFamilyVertWebStartReleaseType { get ; }` |
| Property | TrussFamilyVertWebStructuralTypesParam | — | `public static ForgeTypeId TrussFamilyVertWebStructuralTypesParam { get ; }` |
| Property | TrussFamilyWebsHaveSymbolicCutbackParam | — | `public static ForgeTypeId TrussFamilyWebsHaveSymbolicCutbackParam { get ; }` |
| Property | TrussHeight | — | `public static ForgeTypeId TrussHeight { get ; }` |
| Property | TrussLength | — | `public static ForgeTypeId TrussLength { get ; }` |
| Property | TrussNonBearingOffsetParam | — | `public static ForgeTypeId TrussNonBearingOffsetParam { get ; }` |
| Property | TypeWallClosure | — | `public static ForgeTypeId TypeWallClosure { get ; }` |
| Property | UniformatCode | — | `public static ForgeTypeId UniformatCode { get ; }` |
| Property | UniformatDescription | — | `public static ForgeTypeId UniformatDescription { get ; }` |
| Property | ViewAnalysisDisplayStyle | — | `public static ForgeTypeId ViewAnalysisDisplayStyle { get ; }` |
| Property | ViewAnalysisResultsVisibility | — | `public static ForgeTypeId ViewAnalysisResultsVisibility { get ; }` |
| Property | ViewAssociatedAssemblyInstanceId | — | `public static ForgeTypeId ViewAssociatedAssemblyInstanceId { get ; }` |
| Property | ViewBackClipping | — | `public static ForgeTypeId ViewBackClipping { get ; }` |
| Property | ViewCameraOrientation | — | `public static ForgeTypeId ViewCameraOrientation { get ; }` |
| Property | ViewCameraPosition | — | `public static ForgeTypeId ViewCameraPosition { get ; }` |
| Property | ViewCleanJoins | — | `public static ForgeTypeId ViewCleanJoins { get ; }` |
| Property | ViewDependency | — | `public static ForgeTypeId ViewDependency { get ; }` |
| Property | ViewDepth | — | `public static ForgeTypeId ViewDepth { get ; }` |
| Property | ViewDescription | — | `public static ForgeTypeId ViewDescription { get ; }` |
| Property | ViewDesignOptionsConfig | — | `public static ForgeTypeId ViewDesignOptionsConfig { get ; }` |
| Property | ViewDetailLevel | — | `public static ForgeTypeId ViewDetailLevel { get ; }` |
| Property | ViewDiscipline | — | `public static ForgeTypeId ViewDiscipline { get ; }` |
| Property | ViewFamily | — | `public static ForgeTypeId ViewFamily { get ; }` |
| Property | ViewFamilyAndTypeSchedules | — | `public static ForgeTypeId ViewFamilyAndTypeSchedules { get ; }` |
| Property | ViewFamilySchedules | — | `public static ForgeTypeId ViewFamilySchedules { get ; }` |
| Property | ViewFixedSketchPlane | — | `public static ForgeTypeId ViewFixedSketchPlane { get ; }` |
| Property | ViewGraphSchedBottomLevel | — | `public static ForgeTypeId ViewGraphSchedBottomLevel { get ; }` |
| Property | ViewGraphSchedGridAppearance | — | `public static ForgeTypeId ViewGraphSchedGridAppearance { get ; }` |
| Property | ViewGraphSchedGroupSimilar | — | `public static ForgeTypeId ViewGraphSchedGroupSimilar { get ; }` |
| Property | ViewGraphSchedHiddenLevels | — | `public static ForgeTypeId ViewGraphSchedHiddenLevels { get ; }` |
| Property | ViewGraphSchedLevelRelativeBaseType | — | `public static ForgeTypeId ViewGraphSchedLevelRelativeBaseType { get ; }` |
| Property | ViewGraphSchedLocationsHigh | — | `public static ForgeTypeId ViewGraphSchedLocationsHigh { get ; }` |
| Property | ViewGraphSchedLocationsLow | — | `public static ForgeTypeId ViewGraphSchedLocationsLow { get ; }` |
| Property | ViewGraphSchedMaterialTypes | — | `public static ForgeTypeId ViewGraphSchedMaterialTypes { get ; }` |
| Property | ViewGraphSchedNumberColumns | — | `public static ForgeTypeId ViewGraphSchedNumberColumns { get ; }` |
| Property | ViewGraphSchedOffGrid | — | `public static ForgeTypeId ViewGraphSchedOffGrid { get ; }` |
| Property | ViewGraphSchedRowsCount | — | `public static ForgeTypeId ViewGraphSchedRowsCount { get ; }` |
| Property | ViewGraphSchedRowsFrom | — | `public static ForgeTypeId ViewGraphSchedRowsFrom { get ; }` |
| Property | ViewGraphSchedTextAppearance | — | `public static ForgeTypeId ViewGraphSchedTextAppearance { get ; }` |
| Property | ViewGraphSchedTitle | — | `public static ForgeTypeId ViewGraphSchedTitle { get ; }` |
| Property | ViewGraphSchedTopLevel | — | `public static ForgeTypeId ViewGraphSchedTopLevel { get ; }` |
| Property | ViewGraphSchedTotalColumns | — | `public static ForgeTypeId ViewGraphSchedTotalColumns { get ; }` |
| Property | ViewGraphSchedTotalRows | — | `public static ForgeTypeId ViewGraphSchedTotalRows { get ; }` |
| Property | ViewGraphSchedUnitsFormat | — | `public static ForgeTypeId ViewGraphSchedUnitsFormat { get ; }` |
| Property | ViewGraphSunPath | — | `public static ForgeTypeId ViewGraphSunPath { get ; }` |
| Property | ViewGraphSunPathSize | — | `public static ForgeTypeId ViewGraphSunPathSize { get ; }` |
| Property | ViewModelDisplayMode | — | `public static ForgeTypeId ViewModelDisplayMode { get ; }` |
| Property | ViewName | — | `public static ForgeTypeId ViewName { get ; }` |
| Property | ViewPartsVisibility | — | `public static ForgeTypeId ViewPartsVisibility { get ; }` |
| Property | ViewPhase | — | `public static ForgeTypeId ViewPhase { get ; }` |
| Property | ViewPhaseFilter | — | `public static ForgeTypeId ViewPhaseFilter { get ; }` |
| Property | ViewReferencingDetail | — | `public static ForgeTypeId ViewReferencingDetail { get ; }` |
| Property | ViewReferencingSheet | — | `public static ForgeTypeId ViewReferencingSheet { get ; }` |
| Property | ViewScale | — | `public static ForgeTypeId ViewScale { get ; }` |
| Property | ViewScaleCustomname | — | `public static ForgeTypeId ViewScaleCustomname { get ; }` |
| Property | ViewScaleHavename | — | `public static ForgeTypeId ViewScaleHavename { get ; }` |
| Property | ViewScalePulldownImperial | — | `public static ForgeTypeId ViewScalePulldownImperial { get ; }` |
| Property | ViewScalePulldownMetric | — | `public static ForgeTypeId ViewScalePulldownMetric { get ; }` |
| Property | ViewSchemaSettingForBuilding | — | `public static ForgeTypeId ViewSchemaSettingForBuilding { get ; }` |
| Property | ViewSchemaSettingForSystem | — | `public static ForgeTypeId ViewSchemaSettingForSystem { get ; }` |
| Property | ViewSchemaSettingForSystemTemplate | — | `public static ForgeTypeId ViewSchemaSettingForSystemTemplate { get ; }` |
| Property | ViewSheetViewportInfo | — | `public static ForgeTypeId ViewSheetViewportInfo { get ; }` |
| Property | ViewShowGrids | — | `public static ForgeTypeId ViewShowGrids { get ; }` |
| Property | ViewShowHiddenLines | — | `public static ForgeTypeId ViewShowHiddenLines { get ; }` |
| Property | ViewShowMassing | — | `public static ForgeTypeId ViewShowMassing { get ; }` |
| Property | ViewSlantedColumnSymbolOffset | — | `public static ForgeTypeId ViewSlantedColumnSymbolOffset { get ; }` |
| Property | ViewSolarstudyAnimationSpeedText | — | `public static ForgeTypeId ViewSolarstudyAnimationSpeedText { get ; }` |
| Property | ViewSolarstudyAnimationSpeedValue | — | `public static ForgeTypeId ViewSolarstudyAnimationSpeedValue { get ; }` |
| Property | ViewSolarstudyCurrentStudyTypeIndex | — | `public static ForgeTypeId ViewSolarstudyCurrentStudyTypeIndex { get ; }` |
| Property | ViewSolarstudyIsLightingStudyType | — | `public static ForgeTypeId ViewSolarstudyIsLightingStudyType { get ; }` |
| Property | ViewSolarstudyIsMultidayStudyType | — | `public static ForgeTypeId ViewSolarstudyIsMultidayStudyType { get ; }` |
| Property | ViewSolarstudyIsSingledayStudyType | — | `public static ForgeTypeId ViewSolarstudyIsSingledayStudyType { get ; }` |
| Property | ViewSolarstudyIsStillimageStudyType | — | `public static ForgeTypeId ViewSolarstudyIsStillimageStudyType { get ; }` |
| Property | ViewSolarstudyLightingAltitudeText | — | `public static ForgeTypeId ViewSolarstudyLightingAltitudeText { get ; }` |
| Property | ViewSolarstudyLightingAltitudeValue | — | `public static ForgeTypeId ViewSolarstudyLightingAltitudeValue { get ; }` |
| Property | ViewSolarstudyLightingAzimuthText | — | `public static ForgeTypeId ViewSolarstudyLightingAzimuthText { get ; }` |
| Property | ViewSolarstudyLightingAzimuthValue | — | `public static ForgeTypeId ViewSolarstudyLightingAzimuthValue { get ; }` |
| Property | ViewSolarstudyLightingPresetIndex | — | `public static ForgeTypeId ViewSolarstudyLightingPresetIndex { get ; }` |
| Property | ViewSolarstudyMultidayDatetimeText | — | `public static ForgeTypeId ViewSolarstudyMultidayDatetimeText { get ; }` |
| Property | ViewSolarstudyMultidayFrameText | — | `public static ForgeTypeId ViewSolarstudyMultidayFrameText { get ; }` |
| Property | ViewSolarstudyMultidayFrameValue | — | `public static ForgeTypeId ViewSolarstudyMultidayFrameValue { get ; }` |
| Property | ViewSolarstudyMultidayPresetIndex | — | `public static ForgeTypeId ViewSolarstudyMultidayPresetIndex { get ; }` |
| Property | ViewSolarstudyShadowsIntensityText | — | `public static ForgeTypeId ViewSolarstudyShadowsIntensityText { get ; }` |
| Property | ViewSolarstudyShadowsIntensityValue | — | `public static ForgeTypeId ViewSolarstudyShadowsIntensityValue { get ; }` |
| Property | ViewSolarstudySingledayDatetimeText | — | `public static ForgeTypeId ViewSolarstudySingledayDatetimeText { get ; }` |
| Property | ViewSolarstudySingledayFrameText | — | `public static ForgeTypeId ViewSolarstudySingledayFrameText { get ; }` |
| Property | ViewSolarstudySingledayFrameValue | — | `public static ForgeTypeId ViewSolarstudySingledayFrameValue { get ; }` |
| Property | ViewSolarstudySingledayPresetIndex | — | `public static ForgeTypeId ViewSolarstudySingledayPresetIndex { get ; }` |
| Property | ViewSolarstudyStillDateText | — | `public static ForgeTypeId ViewSolarstudyStillDateText { get ; }` |
| Property | ViewSolarstudyStillDateValue | — | `public static ForgeTypeId ViewSolarstudyStillDateValue { get ; }` |
| Property | ViewSolarstudyStillPresetIndex | — | `public static ForgeTypeId ViewSolarstudyStillPresetIndex { get ; }` |
| Property | ViewSolarstudyStillTimeText | — | `public static ForgeTypeId ViewSolarstudyStillTimeText { get ; }` |
| Property | ViewSolarstudyStillTimeValue | — | `public static ForgeTypeId ViewSolarstudyStillTimeValue { get ; }` |
| Property | ViewSolarstudySunIntensityText | — | `public static ForgeTypeId ViewSolarstudySunIntensityText { get ; }` |
| Property | ViewSolarstudySunIntensityValue | — | `public static ForgeTypeId ViewSolarstudySunIntensityValue { get ; }` |
| Property | ViewTemplate | — | `public static ForgeTypeId ViewTemplate { get ; }` |
| Property | ViewTemplateForSchedule | — | `public static ForgeTypeId ViewTemplateForSchedule { get ; }` |
| Property | ViewType | — | `public static ForgeTypeId ViewType { get ; }` |
| Property | ViewTypeSchedules | — | `public static ForgeTypeId ViewTypeSchedules { get ; }` |
| Property | ViewUnderlayBottomId | — | `public static ForgeTypeId ViewUnderlayBottomId { get ; }` |
| Property | ViewUnderlayOrientation | — | `public static ForgeTypeId ViewUnderlayOrientation { get ; }` |
| Property | ViewUnderlayTopId | — | `public static ForgeTypeId ViewUnderlayTopId { get ; }` |
| Property | ViewVisibleCategories | — | `public static ForgeTypeId ViewVisibleCategories { get ; }` |
| Property | Viewer3dRenderSettings | — | `public static ForgeTypeId Viewer3dRenderSettings { get ; }` |
| Property | ViewerAnnotationCropActive | — | `public static ForgeTypeId ViewerAnnotationCropActive { get ; }` |
| Property | ViewerBoundActiveBottom | — | `public static ForgeTypeId ViewerBoundActiveBottom { get ; }` |
| Property | ViewerBoundActiveFar | — | `public static ForgeTypeId ViewerBoundActiveFar { get ; }` |
| Property | ViewerBoundActiveLeft | — | `public static ForgeTypeId ViewerBoundActiveLeft { get ; }` |
| Property | ViewerBoundActiveNear | — | `public static ForgeTypeId ViewerBoundActiveNear { get ; }` |
| Property | ViewerBoundActiveRight | — | `public static ForgeTypeId ViewerBoundActiveRight { get ; }` |
| Property | ViewerBoundActiveTop | — | `public static ForgeTypeId ViewerBoundActiveTop { get ; }` |
| Property | ViewerBoundFarClipping | — | `public static ForgeTypeId ViewerBoundFarClipping { get ; }` |
| Property | ViewerBoundOffsetBottom | — | `public static ForgeTypeId ViewerBoundOffsetBottom { get ; }` |
| Property | ViewerBoundOffsetFar | — | `public static ForgeTypeId ViewerBoundOffsetFar { get ; }` |
| Property | ViewerBoundOffsetLeft | — | `public static ForgeTypeId ViewerBoundOffsetLeft { get ; }` |
| Property | ViewerBoundOffsetNear | — | `public static ForgeTypeId ViewerBoundOffsetNear { get ; }` |
| Property | ViewerBoundOffsetRight | — | `public static ForgeTypeId ViewerBoundOffsetRight { get ; }` |
| Property | ViewerBoundOffsetTop | — | `public static ForgeTypeId ViewerBoundOffsetTop { get ; }` |
| Property | ViewerCropRegion | — | `public static ForgeTypeId ViewerCropRegion { get ; }` |
| Property | ViewerCropRegionDisabled | — | `public static ForgeTypeId ViewerCropRegionDisabled { get ; }` |
| Property | ViewerCropRegionVisible | — | `public static ForgeTypeId ViewerCropRegionVisible { get ; }` |
| Property | ViewerDetailNumber | — | `public static ForgeTypeId ViewerDetailNumber { get ; }` |
| Property | ViewerEyeElevation | — | `public static ForgeTypeId ViewerEyeElevation { get ; }` |
| Property | ViewerIsReference | — | `public static ForgeTypeId ViewerIsReference { get ; }` |
| Property | ViewerModelClipBoxActive | — | `public static ForgeTypeId ViewerModelClipBoxActive { get ; }` |
| Property | ViewerOptionVisibility | — | `public static ForgeTypeId ViewerOptionVisibility { get ; }` |
| Property | ViewerPerspective | — | `public static ForgeTypeId ViewerPerspective { get ; }` |
| Property | ViewerReferenceLabel | — | `public static ForgeTypeId ViewerReferenceLabel { get ; }` |
| Property | ViewerReferenceLabelText | — | `public static ForgeTypeId ViewerReferenceLabelText { get ; }` |
| Property | ViewerSheetNumber | — | `public static ForgeTypeId ViewerSheetNumber { get ; }` |
| Property | ViewerShowUncropped | — | `public static ForgeTypeId ViewerShowUncropped { get ; }` |
| Property | ViewerTargetElevation | — | `public static ForgeTypeId ViewerTargetElevation { get ; }` |
| Property | ViewerVolumeOfInterestCrop | — | `public static ForgeTypeId ViewerVolumeOfInterestCrop { get ; }` |
| Property | ViewportAttrLabelTag | — | `public static ForgeTypeId ViewportAttrLabelTag { get ; }` |
| Property | ViewportAttrOrientationOnSheet | — | `public static ForgeTypeId ViewportAttrOrientationOnSheet { get ; }` |
| Property | ViewportAttrPreserveTitlePosition | — | `public static ForgeTypeId ViewportAttrPreserveTitlePosition { get ; }` |
| Property | ViewportAttrShowBox | — | `public static ForgeTypeId ViewportAttrShowBox { get ; }` |
| Property | ViewportAttrShowExtensionLine | — | `public static ForgeTypeId ViewportAttrShowExtensionLine { get ; }` |
| Property | ViewportAttrShowLabel | — | `public static ForgeTypeId ViewportAttrShowLabel { get ; }` |
| Property | ViewportDetailNumber | — | `public static ForgeTypeId ViewportDetailNumber { get ; }` |
| Property | ViewportPositioning | — | `public static ForgeTypeId ViewportPositioning { get ; }` |
| Property | ViewportScale | — | `public static ForgeTypeId ViewportScale { get ; }` |
| Property | ViewportSheetName | — | `public static ForgeTypeId ViewportSheetName { get ; }` |
| Property | ViewportSheetNumber | — | `public static ForgeTypeId ViewportSheetNumber { get ; }` |
| Property | ViewportView | — | `public static ForgeTypeId ViewportView { get ; }` |
| Property | ViewportViewName | — | `public static ForgeTypeId ViewportViewName { get ; }` |
| Property | VisGraphicsAnalyticalModel | — | `public static ForgeTypeId VisGraphicsAnalyticalModel { get ; }` |
| Property | VisGraphicsAnnotation | — | `public static ForgeTypeId VisGraphicsAnnotation { get ; }` |
| Property | VisGraphicsCoordinationModel | — | `public static ForgeTypeId VisGraphicsCoordinationModel { get ; }` |
| Property | VisGraphicsDesignoptions | — | `public static ForgeTypeId VisGraphicsDesignoptions { get ; }` |
| Property | VisGraphicsFilters | — | `public static ForgeTypeId VisGraphicsFilters { get ; }` |
| Property | VisGraphicsImport | — | `public static ForgeTypeId VisGraphicsImport { get ; }` |
| Property | VisGraphicsModel | — | `public static ForgeTypeId VisGraphicsModel { get ; }` |
| Property | VisGraphicsPointClouds | — | `public static ForgeTypeId VisGraphicsPointClouds { get ; }` |
| Property | VisGraphicsRvtLinks | — | `public static ForgeTypeId VisGraphicsRvtLinks { get ; }` |
| Property | VisGraphicsWorksets | — | `public static ForgeTypeId VisGraphicsWorksets { get ; }` |
| Property | VoidCutsGeometry | — | `public static ForgeTypeId VoidCutsGeometry { get ; }` |
| Property | VolumeCut | — | `public static ForgeTypeId VolumeCut { get ; }` |
| Property | VolumeFill | — | `public static ForgeTypeId VolumeFill { get ; }` |
| Property | VolumeNet | — | `public static ForgeTypeId VolumeNet { get ; }` |
| Property | VolumeOfInterestHeight | — | `public static ForgeTypeId VolumeOfInterestHeight { get ; }` |
| Property | VolumeOfInterestName | — | `public static ForgeTypeId VolumeOfInterestName { get ; }` |
| Property | VolumeOfInterestViewsVisible | — | `public static ForgeTypeId VolumeOfInterestViewsVisible { get ; }` |
| Property | WalkthroughFramesCount | — | `public static ForgeTypeId WalkthroughFramesCount { get ; }` |
| Property | WallAlignKeyRefParam | — | `public static ForgeTypeId WallAlignKeyRefParam { get ; }` |
| Property | WallAttrDefheightParam | — | `public static ForgeTypeId WallAttrDefheightParam { get ; }` |
| Property | WallAttrHeightParam | — | `public static ForgeTypeId WallAttrHeightParam { get ; }` |
| Property | WallAttrRoomBounding | — | `public static ForgeTypeId WallAttrRoomBounding { get ; }` |
| Property | WallAttrWidthParam | — | `public static ForgeTypeId WallAttrWidthParam { get ; }` |
| Property | WallBaseConstraint | — | `public static ForgeTypeId WallBaseConstraint { get ; }` |
| Property | WallBaseHeightParam | — | `public static ForgeTypeId WallBaseHeightParam { get ; }` |
| Property | WallBaseOffset | — | `public static ForgeTypeId WallBaseOffset { get ; }` |
| Property | WallBottomExtensionDistParam | — | `public static ForgeTypeId WallBottomExtensionDistParam { get ; }` |
| Property | WallBottomIsAttached | — | `public static ForgeTypeId WallBottomIsAttached { get ; }` |
| Property | WallCrossSection | — | `public static ForgeTypeId WallCrossSection { get ; }` |
| Property | WallHeightType | — | `public static ForgeTypeId WallHeightType { get ; }` |
| Property | WallKeyRefParam | — | `public static ForgeTypeId WallKeyRefParam { get ; }` |
| Property | WallLocationLineOffsetParam | — | `public static ForgeTypeId WallLocationLineOffsetParam { get ; }` |
| Property | WallSingleSlantAngleFromVertical | — | `public static ForgeTypeId WallSingleSlantAngleFromVertical { get ; }` |
| Property | WallStructuralSignificant | — | `public static ForgeTypeId WallStructuralSignificant { get ; }` |
| Property | WallStructuralUsageParam | — | `public static ForgeTypeId WallStructuralUsageParam { get ; }` |
| Property | WallStructureIdParam | — | `public static ForgeTypeId WallStructureIdParam { get ; }` |
| Property | WallSweepCutByInsertsParam | — | `public static ForgeTypeId WallSweepCutByInsertsParam { get ; }` |
| Property | WallSweepCutsWallParam | — | `public static ForgeTypeId WallSweepCutsWallParam { get ; }` |
| Property | WallSweepDefaultSetbackParam | — | `public static ForgeTypeId WallSweepDefaultSetbackParam { get ; }` |
| Property | WallSweepLevelParam | — | `public static ForgeTypeId WallSweepLevelParam { get ; }` |
| Property | WallSweepOffsetParam | — | `public static ForgeTypeId WallSweepOffsetParam { get ; }` |
| Property | WallSweepOrientation | — | `public static ForgeTypeId WallSweepOrientation { get ; }` |
| Property | WallSweepProfileParam | — | `public static ForgeTypeId WallSweepProfileParam { get ; }` |
| Property | WallSweepWallOffsetParam | — | `public static ForgeTypeId WallSweepWallOffsetParam { get ; }` |
| Property | WallSweepWallSubcategoryId | — | `public static ForgeTypeId WallSweepWallSubcategoryId { get ; }` |
| Property | WallTaperedExteriorInwardAngle | — | `public static ForgeTypeId WallTaperedExteriorInwardAngle { get ; }` |
| Property | WallTaperedInteriorInwardAngle | — | `public static ForgeTypeId WallTaperedInteriorInwardAngle { get ; }` |
| Property | WallTaperedUseInstanceAngles | — | `public static ForgeTypeId WallTaperedUseInstanceAngles { get ; }` |
| Property | WallTaperedWidthAtBottom | — | `public static ForgeTypeId WallTaperedWidthAtBottom { get ; }` |
| Property | WallTaperedWidthAtTop | — | `public static ForgeTypeId WallTaperedWidthAtTop { get ; }` |
| Property | WallTopExtensionDistParam | — | `public static ForgeTypeId WallTopExtensionDistParam { get ; }` |
| Property | WallTopIsAttached | — | `public static ForgeTypeId WallTopIsAttached { get ; }` |
| Property | WallTopOffset | — | `public static ForgeTypeId WallTopOffset { get ; }` |
| Property | WallTypeDefaultTaperedExteriorInwardAngle | — | `public static ForgeTypeId WallTypeDefaultTaperedExteriorInwardAngle { get ; }` |
| Property | WallTypeDefaultTaperedInteriorInwardAngle | — | `public static ForgeTypeId WallTypeDefaultTaperedInteriorInwardAngle { get ; }` |
| Property | WallTypeWidthMeasuredAt | — | `public static ForgeTypeId WallTypeWidthMeasuredAt { get ; }` |
| Property | WallUserHeightParam | — | `public static ForgeTypeId WallUserHeightParam { get ; }` |
| Property | WindowTypeId | — | `public static ForgeTypeId WindowTypeId { get ; }` |
| Property | WindowTypeName | — | `public static ForgeTypeId WindowTypeName { get ; }` |
| Property | WitnsLineExtension | — | `public static ForgeTypeId WitnsLineExtension { get ; }` |
| Property | WitnsLineGapToElt | — | `public static ForgeTypeId WitnsLineGapToElt { get ; }` |
| Property | WitnsLineTickMark | — | `public static ForgeTypeId WitnsLineTickMark { get ; }` |
| Property | WrappingAtEndsParam | — | `public static ForgeTypeId WrappingAtEndsParam { get ; }` |
| Property | WrappingAtInsertsParam | — | `public static ForgeTypeId WrappingAtInsertsParam { get ; }` |
| Property | YJustification | — | `public static ForgeTypeId YJustification { get ; }` |
| Property | YOffsetValue | — | `public static ForgeTypeId YOffsetValue { get ; }` |
| Property | YzJustification | — | `public static ForgeTypeId YzJustification { get ; }` |
| Property | ZJustification | — | `public static ForgeTypeId ZJustification { get ; }` |
| Property | ZOffsetValue | — | `public static ForgeTypeId ZOffsetValue { get ; }` |
| Property | ZoneAirChangesPerHour | — | `public static ForgeTypeId ZoneAirChangesPerHour { get ; }` |
| Property | ZoneAirVolumeCalculationTypeParam | — | `public static ForgeTypeId ZoneAirVolumeCalculationTypeParam { get ; }` |
| Property | ZoneArea | — | `public static ForgeTypeId ZoneArea { get ; }` |
| Property | ZoneAreaGross | — | `public static ForgeTypeId ZoneAreaGross { get ; }` |
| Property | ZoneCalculatedAreaPerCoolingLoadParam | — | `public static ForgeTypeId ZoneCalculatedAreaPerCoolingLoadParam { get ; }` |
| Property | ZoneCalculatedAreaPerHeatingLoadParam | — | `public static ForgeTypeId ZoneCalculatedAreaPerHeatingLoadParam { get ; }` |
| Property | ZoneCalculatedCoolingLoadParam | — | `public static ForgeTypeId ZoneCalculatedCoolingLoadParam { get ; }` |
| Property | ZoneCalculatedCoolingLoadPerAreaParam | — | `public static ForgeTypeId ZoneCalculatedCoolingLoadPerAreaParam { get ; }` |
| Property | ZoneCalculatedHeatingLoadParam | — | `public static ForgeTypeId ZoneCalculatedHeatingLoadParam { get ; }` |
| Property | ZoneCalculatedHeatingLoadPerAreaParam | — | `public static ForgeTypeId ZoneCalculatedHeatingLoadPerAreaParam { get ; }` |
| Property | ZoneCalculatedHydronicCoolingflowParam | — | `public static ForgeTypeId ZoneCalculatedHydronicCoolingflowParam { get ; }` |
| Property | ZoneCalculatedHydronicHeatingflowParam | — | `public static ForgeTypeId ZoneCalculatedHydronicHeatingflowParam { get ; }` |
| Property | ZoneCalculatedSupplyAirflowParam | — | `public static ForgeTypeId ZoneCalculatedSupplyAirflowParam { get ; }` |
| Property | ZoneCalculatedSupplyAirflowPerAreaParam | — | `public static ForgeTypeId ZoneCalculatedSupplyAirflowPerAreaParam { get ; }` |
| Property | ZoneCoilBypassPercentageParam | — | `public static ForgeTypeId ZoneCoilBypassPercentageParam { get ; }` |
| Property | ZoneCoolingAirTemperatureParam | — | `public static ForgeTypeId ZoneCoolingAirTemperatureParam { get ; }` |
| Property | ZoneCoolingInformationParam | — | `public static ForgeTypeId ZoneCoolingInformationParam { get ; }` |
| Property | ZoneCoolingSetPointParam | — | `public static ForgeTypeId ZoneCoolingSetPointParam { get ; }` |
| Property | ZoneDehumidificationSetPointParam | — | `public static ForgeTypeId ZoneDehumidificationSetPointParam { get ; }` |
| Property | ZoneDesignCoolTemperature | — | `public static ForgeTypeId ZoneDesignCoolTemperature { get ; }` |
| Property | ZoneDesignHeatTemperature | — | `public static ForgeTypeId ZoneDesignHeatTemperature { get ; }` |
| Property | ZoneHeatingAirTemperatureParam | — | `public static ForgeTypeId ZoneHeatingAirTemperatureParam { get ; }` |
| Property | ZoneHeatingInformationParam | — | `public static ForgeTypeId ZoneHeatingInformationParam { get ; }` |
| Property | ZoneHeatingSetPointParam | — | `public static ForgeTypeId ZoneHeatingSetPointParam { get ; }` |
| Property | ZoneHumidificationSetPointParam | — | `public static ForgeTypeId ZoneHumidificationSetPointParam { get ; }` |
| Property | ZoneLevelId | — | `public static ForgeTypeId ZoneLevelId { get ; }` |
| Property | ZoneLevelOffset | — | `public static ForgeTypeId ZoneLevelOffset { get ; }` |
| Property | ZoneLevelOffsetTop | — | `public static ForgeTypeId ZoneLevelOffsetTop { get ; }` |
| Property | ZoneName | — | `public static ForgeTypeId ZoneName { get ; }` |
| Property | ZoneOaRatePerAchParam | — | `public static ForgeTypeId ZoneOaRatePerAchParam { get ; }` |
| Property | ZoneOutdoorAirInformationParam | — | `public static ForgeTypeId ZoneOutdoorAirInformationParam { get ; }` |
| Property | ZoneOutsideAirFlowPerArea | — | `public static ForgeTypeId ZoneOutsideAirFlowPerArea { get ; }` |
| Property | ZoneOutsideAirFlowPerPerson | — | `public static ForgeTypeId ZoneOutsideAirFlowPerPerson { get ; }` |
| Property | ZoneOutsideAirPerAreaParam | — | `public static ForgeTypeId ZoneOutsideAirPerAreaParam { get ; }` |
| Property | ZoneOutsideAirPerPersonParam | — | `public static ForgeTypeId ZoneOutsideAirPerPersonParam { get ; }` |
| Property | ZonePerimeter | — | `public static ForgeTypeId ZonePerimeter { get ; }` |
| Property | ZonePhase | — | `public static ForgeTypeId ZonePhase { get ; }` |
| Property | ZonePhaseId | — | `public static ForgeTypeId ZonePhaseId { get ; }` |
| Property | ZoneServiceTypeParam | — | `public static ForgeTypeId ZoneServiceTypeParam { get ; }` |
| Property | ZoneSpaceOutdoorAirOptionParam | — | `public static ForgeTypeId ZoneSpaceOutdoorAirOptionParam { get ; }` |
| Property | ZoneUseAirChangesPerHourParam | — | `public static ForgeTypeId ZoneUseAirChangesPerHourParam { get ; }` |
| Property | ZoneUseDehumidificationSetpointParam | — | `public static ForgeTypeId ZoneUseDehumidificationSetpointParam { get ; }` |
| Property | ZoneUseHumidificationSetpointParam | — | `public static ForgeTypeId ZoneUseHumidificationSetpointParam { get ; }` |
| Property | ZoneUseOutsideAirPerAreaParam | — | `public static ForgeTypeId ZoneUseOutsideAirPerAreaParam { get ; }` |
| Property | ZoneUseOutsideAirPerPersonParam | — | `public static ForgeTypeId ZoneUseOutsideAirPerPersonParam { get ; }` |
| Property | ZoneVolume | — | `public static ForgeTypeId ZoneVolume { get ; }` |
| Property | ZoneVolumeGross | — | `public static ForgeTypeId ZoneVolumeGross { get ; }` |